[
  {
    "name": "Traditional Croatian Goulash",
    "description": "Clean the meat from the veins if there are some and cut it into smaller pieces, 3 × 3 cm. Marinate t...",
    "imageUrl": "https://www.themealdb.com/images/media/meals/n1hcou1628770088.jpg",
    "instructions": [
      "Clean the meat from the veins if there are some and cut it into smaller pieces, 3 × 3 cm. Marinate the meat in the mustard and spices and let it sit in the refrigerator for one hour",
      "Heat one tablespoon of pork fat or vegetable oil in a pot and fry the meat on all sides until it gets browned. Once the meat is cooked, transfer it to a plate and add another tablespoon of fat to the pot",
      "Cut the onions very fine, peel the carrots and shred it using a grater. Cook the onions and carrots over low heat for 15 minutes. You can salt the vegetables a little to make them soften faster",
      "Once the vegetables have browned and become slightly mushy, add the meat and bay leaves and garlic. Pour over with wine and simmer for 10-15 minutes to allow the alcohol to evaporate. Now is the right time to add 2/3 the amount of liquid",
      "Cover the pot and cook over low heat for an hour, stirring occasionally. After the first hour, pour over the rest of the water or stock and cook for another 30-45 minutes",
      "Allow the stew to cool slightly and serve it with a sprinkle of chopped parsley and few slices of fresh hot pepper if you like to spice it up a bit",
      "Slice ​​some fresh bread, season the salad and simply enjoying these wonderful flavors"
    ],
    "ingredients": [
      {
        "name": "Beef",
        "quantity": "500g"
      },
      {
        "name": "Onions",
        "quantity": "2 chopped"
      },
      {
        "name": "Carrots",
        "quantity": "2 chopped"
      },
      {
        "name": "Garlic",
        "quantity": "2 cloves"
      },
      {
        "name": "Bay Leaf",
        "quantity": "2"
      },
      {
        "name": "Red Wine",
        "quantity": "200ml"
      },
      {
        "name": "Water",
        "quantity": "2 Litres"
      },
      {
        "name": "Mustard",
        "quantity": "3 tbs"
      },
      {
        "name": "Salt",
        "quantity": "1tbsp"
      },
      {
        "name": "Pepper",
        "quantity": "1/2 tsp"
      },
      {
        "name": "Paprika",
        "quantity": "1/2 tsp"
      },
      {
        "name": "Vegetable Oil",
        "quantity": "2 tbs"
      }
    ],
    "cuisineType": "croatian",
    "mealType": "beef",
    "difficultyLevel": "medium",
    "prepTime": 30,
    "cookTime": 45,
    "servings": 4,
    "tags": [
      "soup"
    ]
  },
  {
    "name": "Spanish chicken pie",
    "description": "step 1\r\nHeat oven to 200C/fan 180C/gas 6. Boil the potatoes for 15-20 mins until tender. Drain, retu...",
    "imageUrl": "https://www.themealdb.com/images/media/meals/8ovxf41763253962.jpg",
    "instructions": [
      "step 1",
      "Heat oven to 200C/fan 180C/gas 6. Boil the potatoes for 15-20 mins until tender. Drain, return to the pan, then mash with some seasoning and 2 tsp of the paprika.",
      "step 2",
      "Meanwhile, heat the oil in a large pan, then fry the onions and garlic for a few mins until softened. Stir in the remaining paprika for 1 min, add the tomatoes , then, bring to a simmer. Tip into a large ovenproof dish, then stir in the chicken, peppers, olives and some seasoning.",
      "step 3",
      "Spoon over the mash, then bake for 15 mins until the mash is golden on top and the sauce is bubbling."
    ],
    "ingredients": [
      {
        "name": "Potatoes",
        "quantity": "1 kg"
      },
      {
        "name": "Paprika",
        "quantity": "3 tsp"
      },
      {
        "name": "Olive Oil",
        "quantity": "2 teaspoons"
      },
      {
        "name": "Onion",
        "quantity": "2 sliced"
      },
      {
        "name": "Garlic",
        "quantity": "2 cloves minced"
      },
      {
        "name": "Tinned Tomatos",
        "quantity": "800g"
      },
      {
        "name": "Chicken",
        "quantity": "300g"
      },
      {
        "name": "Roasted pepper",
        "quantity": "140g"
      },
      {
        "name": "Green Olives",
        "quantity": "Handful"
      }
    ],
    "cuisineType": "spanish",
    "mealType": "chicken",
    "difficultyLevel": "medium",
    "prepTime": 30,
    "cookTime": 45,
    "servings": 4,
    "tags": []
  },
  {
    "name": "Cumberland Pie",
    "description": "step 1\r\nHeat oven to 160C/140C fan/gas 3. Soften the celery, onion, carrots, bay and 1 thyme sprig i...",
    "imageUrl": "https://www.themealdb.com/images/media/meals/pvfkz61761595976.jpg",
    "instructions": [
      "step 1",
      "Heat oven to 160C/140C fan/gas 3. Soften the celery, onion, carrots, bay and 1 thyme sprig in a casserole with 1 tbsp oil and the butter for 10 mins. Stir in the flour, followed by the purée, Worcestershire sauce and stock cubes.",
      "step 2",
      "Gradually stir in 600ml hot water, then tip in the beef and bring to a gentle simmer. Cover and cook in the oven for 2 hrs 30 mins, then uncover and cook for 30 mins -1 hr more until the meat is really tender and sauce thickened.",
      "step 3",
      "Meanwhile, cook potatoes in a pan of boiling water until they’re not done but about ¾ of the way there.",
      "step 4",
      "Transfer meat to a baking dish. Slice spuds into 1cm thick rounds and gently toss with seasoning, the remaining oil and thyme leaves. Layer on the beef, scattering with the cheese as you layer. You can cover and chill the pie now for 1 day, or freeze for up to 3 months.",
      "step 5",
      "Increase oven to 200C/180C fan/gas 6 and bake for 30-40 mins until golden and crispy, and sauce bubbling if the dish went in cold. Serve with peas."
    ],
    "ingredients": [
      {
        "name": "Celery",
        "quantity": "2"
      },
      {
        "name": "Onion",
        "quantity": "1 chopped"
      },
      {
        "name": "Carrots",
        "quantity": "2 large"
      },
      {
        "name": "Bay Leaves",
        "quantity": "5"
      },
      {
        "name": "Thyme",
        "quantity": "3"
      },
      {
        "name": "Vegetable Oil",
        "quantity": "2 tblsp"
      },
      {
        "name": "Butter",
        "quantity": "1 tablespoon"
      },
      {
        "name": "Flour",
        "quantity": "2 tablespoons"
      },
      {
        "name": "Tomato Puree",
        "quantity": "2 tblsp"
      },
      {
        "name": "Worcestershire Sauce",
        "quantity": "2 tablespoons"
      },
      {
        "name": "Beef Stock Cubes",
        "quantity": "2"
      },
      {
        "name": "Feather blade beef",
        "quantity": "800g"
      },
      {
        "name": "Potatoes",
        "quantity": "800g"
      },
      {
        "name": "Mature Cheddar",
        "quantity": "25g"
      },
      {
        "name": "Parmesan Cheese",
        "quantity": "25g"
      }
    ],
    "cuisineType": "british",
    "mealType": "beef",
    "difficultyLevel": "medium",
    "prepTime": 30,
    "cookTime": 45,
    "servings": 4,
    "tags": []
  },
  {
    "name": "Rock Cakes",
    "description": "Preheat oven to 180C/350F/Gas 4 and line a baking tray with baking parchment.\r\nMix the flour, sugar ...",
    "imageUrl": "https://www.themealdb.com/images/media/meals/tqrrsq1511723764.jpg",
    "instructions": [
      "Preheat oven to 180C/350F/Gas 4 and line a baking tray with baking parchment.",
      "Mix the flour, sugar and baking powder in a bowl and rub in the cubed butter until the mixture looks like breadcrumbs, then mix in the dried fruit.",
      "In a clean bowl, beat the egg and milk together with the vanilla extract.",
      "Add the egg mixture to the dry ingredients and stir with a spoon until the mixture just comes together as a thick, lumpy dough. Add a teaspoon more milk if you really need it to make the mixture stick together.",
      "Place golfball-sized spoons of the mixture onto the prepared baking tray. Leave space between them as they will flatten and spread out to double their size during baking.",
      "Bake for 15-20 minutes, until golden-brown. Remove from the oven, allow to cool for a couple of minutes then turn them out onto a wire rack to cool."
    ],
    "ingredients": [
      {
        "name": "Self-raising Flour",
        "quantity": "225g"
      },
      {
        "name": "Caster Sugar",
        "quantity": "75g"
      },
      {
        "name": "Baking Powder",
        "quantity": "1 tsp"
      },
      {
        "name": "Butter",
        "quantity": "125g"
      },
      {
        "name": "Dried Fruit",
        "quantity": "150g"
      },
      {
        "name": "Eggs",
        "quantity": "1"
      },
      {
        "name": "Milk",
        "quantity": "1 tbs"
      },
      {
        "name": "Vanilla Extract",
        "quantity": "2 tsp"
      }
    ],
    "cuisineType": "british",
    "mealType": "dessert",
    "difficultyLevel": "medium",
    "prepTime": 30,
    "cookTime": 45,
    "servings": 4,
    "tags": [
      "baking",
      "cake"
    ]
  },
  {
    "name": "Boulangère Potatoes",
    "description": "Heat oven to 200C/fan 180C/gas 6. Fry the onions and thyme sprigs in the oil until softened and ligh...",
    "imageUrl": "https://www.themealdb.com/images/media/meals/qywups1511796761.jpg",
    "instructions": [
      "Heat oven to 200C/fan 180C/gas 6. Fry the onions and thyme sprigs in the oil until softened and lightly coloured (about 5 mins).",
      "Spread a layer of potatoes over the base of a 1.5-litre oiled gratin dish. Sprinkle over a few onions (see picture, above) and continue layering, finishing with a layer of potatoes. Pour over the stock and bake for 50-60 mins until the potatoes are cooked and the top is golden and crisp."
    ],
    "ingredients": [
      {
        "name": "Onions",
        "quantity": "2 finely chopped"
      },
      {
        "name": "Thyme",
        "quantity": "sprigs of fresh"
      },
      {
        "name": "Olive Oil",
        "quantity": "2 tbs"
      },
      {
        "name": "Potatoes",
        "quantity": "1.5kg"
      },
      {
        "name": "Vegetable Stock",
        "quantity": "425g"
      }
    ],
    "cuisineType": "french",
    "mealType": "side",
    "difficultyLevel": "medium",
    "prepTime": 30,
    "cookTime": 45,
    "servings": 4,
    "tags": [
      "sidedish"
    ]
  },
  {
    "name": "Smoked Haddock Kedgeree",
    "description": "Melt 50g butter in a large saucepan (about 20cm across), add 1 finely chopped medium onion and cook ...",
    "imageUrl": "https://www.themealdb.com/images/media/meals/1550441275.jpg",
    "instructions": [
      "Melt 50g butter in a large saucepan (about 20cm across), add 1 finely chopped medium onion and cook gently over a medium heat for 5 minutes, until softened but not browned.",
      "Stir in 3 split cardamom pods, ¼ tsp turmeric, 1 small cinnamon stick and 2 bay leaves, then cook for 1 minute.",
      "Tip in 450g basmati rice and stir until it is all well coated in the spicy butter.",
      "Pour in 1 litre chicken or fish stock, add ½ teaspoon salt and bring to the boil, stir once to release any rice from the bottom of the pan. Cover with a close-fitting lid, reduce the heat to low and leave to cook very gently for 12 minutes.",
      "Meanwhile, bring some water to the boil in a large shallow pan. Add 750g un-dyed smoked haddock fillet and simmer for 4 minutes, until the fish is just cooked. Lift it out onto a plate and leave until cool enough to handle.",
      "Hard-boil 3 eggs for 8 minutes.",
      "Flake the fish, discarding any skin and bones. Drain the eggs, cool slightly, then peel and chop. ",
      "Uncover the rice and remove the bay leaves, cinnamon stick and cardamom pods if you wish to. Gently fork in the fish and the chopped eggs, cover again and return to the heat for 2-3 minutes, or until the fish has heated through.",
      "Gently stir in almost all the 3 tbsp chopped fresh parsley, and season with a little salt and black pepper to taste. Serve scattered with the remaining parsley and garnished with 1 lemon, cut into wedges."
    ],
    "ingredients": [
      {
        "name": "Butter",
        "quantity": "50g"
      },
      {
        "name": "Onion",
        "quantity": "1 chopped"
      },
      {
        "name": "Cardamom",
        "quantity": "3 Pods"
      },
      {
        "name": "Turmeric",
        "quantity": "1/4 tsp"
      },
      {
        "name": "Cinnamon Stick",
        "quantity": "1 small"
      },
      {
        "name": "Bay Leaf",
        "quantity": "Sprigs of fresh"
      },
      {
        "name": "Basmati Rice",
        "quantity": "450g"
      },
      {
        "name": "Chicken Stock",
        "quantity": "1 Litre"
      },
      {
        "name": "Smoked Haddock",
        "quantity": "750g"
      },
      {
        "name": "Eggs",
        "quantity": "3"
      },
      {
        "name": "Parsley",
        "quantity": "3 tblsp chopped"
      },
      {
        "name": "Lemon",
        "quantity": "1 chopped"
      }
    ],
    "cuisineType": "indian",
    "mealType": "breakfast",
    "difficultyLevel": "medium",
    "prepTime": 30,
    "cookTime": 45,
    "servings": 4,
    "tags": [
      "brunch",
      "fish",
      "fusion"
    ]
  },
  {
    "name": "Portuguese barbecued pork (Febras assadas)",
    "description": "STEP 1\r\n\r\nCut the tenderloins into 5 equal-size pieces leaving the tail ends a little longer. Take a...",
    "imageUrl": "https://www.themealdb.com/images/media/meals/cybyue1614349443.jpg",
    "instructions": [
      "STEP 1",
      "Cut the tenderloins into 5 equal-size pieces leaving the tail ends a little longer. Take a clear plastic bag and slip one of the pieces in. Bash it into an escalope the size of a side-plate with a rolling pin and repeat with the remaining pieces.",
      "STEP 2",
      "Put the wine, paprika, some salt and pepper and the juice of ½ a lemon in a bowl and add the pork. Leave to marinate for 20-30 minutes, while you get your barbecue to the stage where the coals are glowing but there are no flames.",
      "STEP 3",
      "To make the chips, fill a basin with cool water and cut the potatoes into 3cm-thick chips. Soak them in the water for 5 minutes and then change the water. Leave for 5 more minutes. Drain and then pat dry on a towel or with kitchen paper.",
      "STEP 4",
      "Heat the oil in a deep fryer or a deep heavy-based pan with a lid to 130C and lower the chips into the oil (in batches). Blanch for 8-10 minutes. Remove from the oil and drain well. Place on a tray to cool. Reheat the oil to 180C (make sure it’s hot or your chips will be soggy) and lower the basket of chips into the oil (again, do this in batches). Leave to cook for 2 minutes and then give them a little shake. Cook for another minute or so until they are well coloured and crisp to the touch. Drain well for a few minutes, tip into a bowl and sprinkle with sea salt.",
      "STEP 5",
      "The pork will cook quickly so do it in 2 batches. Take the pieces out of the marinade, rub them with oil, and drop them onto the barbecue (you could also use a chargrill). Cook for 1 minute on each side – they may flare up as you do so. This should really be enough time as they will keep on cooking. Take them off the barbecue and pile onto a plate. Repeat with the remaining batch.",
      "STEP 6",
      "Serve by piling a plate with chips, drop the pork on top of each pile and pouring the juices from the plate over so the chips take up the flavours. Top with a spoon of mayonnaise and a wedge of lemon."
    ],
    "ingredients": [
      {
        "name": "Pork",
        "quantity": "2"
      },
      {
        "name": "White Wine",
        "quantity": "200ml"
      },
      {
        "name": "Paprika",
        "quantity": "1/2 tsp"
      },
      {
        "name": "Lemon",
        "quantity": "2"
      },
      {
        "name": "Lemon Juice",
        "quantity": "1/2"
      },
      {
        "name": "Olive Oil",
        "quantity": "Dash"
      },
      {
        "name": "Mayonnaise",
        "quantity": "To serve"
      },
      {
        "name": "Potatoes",
        "quantity": "1 kg"
      },
      {
        "name": "Vegetable Oil",
        "quantity": "For frying"
      }
    ],
    "cuisineType": "portuguese",
    "mealType": "pork",
    "difficultyLevel": "medium",
    "prepTime": 30,
    "cookTime": 45,
    "servings": 4,
    "tags": []
  },
  {
    "name": "Coq au vin",
    "description": "Heat 1 tbsp of the oil in a large, heavy-based saucepan or flameproof dish. Tip in the bacon and fry...",
    "imageUrl": "https://www.themealdb.com/images/media/meals/qstyvs1505931190.jpg",
    "instructions": [
      "Heat 1 tbsp of the oil in a large, heavy-based saucepan or flameproof dish. Tip in the bacon and fry until crisp. Remove and drain on kitchen paper. Add the shallots to the pan and fry, stirring or shaking the pan often, for 5-8 mins until well browned all over. Remove and set aside with the bacon.",
      "Pat the chicken pieces dry with kitchen paper. Pour the remaining oil into the pan, then fry half the chicken pieces, turning regularly, for 5-8 mins until well browned. Remove, then repeat with the remaining chicken. Remove and set aside.",
      "Scatter in the garlic and fry briefly, then, with the heat medium-high, pour in the brandy or Cognac, stirring the bottom of the pan to deglaze. The alcohol should sizzle and start to evaporate so there is not much left.",
      "Return the chicken legs and thighs to the pan along with any juices, then pour in a little of the wine, stirring the bottom of the pan again. Stir in the rest of the wine, the stock and tomato purée, drop in the bouquet garni, season with pepper and a pinch of salt, then return the bacon and shallots to the pan. Cover, lower the heat to a gentle simmer, add the chicken breasts and cook for 50 mins-1hr.",
      "Just before ready to serve, heat the oil for the mushrooms in a large non-stick frying pan. Add the mushrooms and fry over a high heat for a few mins until golden. Remove and keep warm.",
      "Lift the chicken, shallots and bacon from the pan and transfer to a warmed serving dish. Remove the bouquet garni. To make the thickener, mix the flour, olive oil and butter in a small bowl using the back of a teaspoon. Bring the wine mixture to a gentle boil, then gradually drop in small pieces of the thickener, whisking each piece in using a wire whisk. Simmer for 1-2 mins. Scatter the mushrooms over the chicken, then pour over the wine sauce. Garnish with chopped parsley."
    ],
    "ingredients": [
      {
        "name": "Olive Oil",
        "quantity": "1½ tbsp"
      },
      {
        "name": "Bacon",
        "quantity": "3 rashers (100g) chopped dry-cured"
      },
      {
        "name": "Shallots",
        "quantity": "12 small"
      },
      {
        "name": "Chicken Legs",
        "quantity": "2 (460g)"
      },
      {
        "name": "Chicken Thighs",
        "quantity": "4 (650g)"
      },
      {
        "name": "Chicken Breasts",
        "quantity": "2 (280g)"
      },
      {
        "name": "Garlic",
        "quantity": "3 finely chopped"
      },
      {
        "name": "Brandy",
        "quantity": "3 tbsp"
      },
      {
        "name": "Red Wine",
        "quantity": "600ml"
      },
      {
        "name": "Chicken Stock",
        "quantity": "150ml"
      },
      {
        "name": "tomato puree",
        "quantity": "2 tsp"
      },
      {
        "name": "thyme",
        "quantity": "3 sprigs"
      },
      {
        "name": "Rosemary",
        "quantity": "2 sprigs"
      },
      {
        "name": "bay leaves",
        "quantity": "2"
      },
      {
        "name": "parsley",
        "quantity": "garnish"
      },
      {
        "name": "chestnut mushroom",
        "quantity": "250g"
      },
      {
        "name": "plain flour",
        "quantity": "2 tbsp"
      },
      {
        "name": "butter",
        "quantity": "1 tsp"
      }
    ],
    "cuisineType": "french",
    "mealType": "chicken",
    "difficultyLevel": "medium",
    "prepTime": 30,
    "cookTime": 45,
    "servings": 4,
    "tags": []
  },
  {
    "name": "Spring onion and prawn empanadas",
    "description": "STEP 1\r\n\r\nTo make the dough, rub the butter into the flour and then add the egg white and half the y...",
    "imageUrl": "https://www.themealdb.com/images/media/meals/1c5oso1614347493.jpg",
    "instructions": [
      "STEP 1",
      "To make the dough, rub the butter into the flour and then add the egg white and half the yolk (keep the rest), vinegar, a pinch of salt and enough cold water to make a soft dough. Knead on a floured surface until smooth and then wrap and rest for 30 minutes.",
      "STEP 2",
      "Heat the oven to 180c/fan 160c/gas 4. Trim the green ends of the spring onions and then finely slice the rest. Heat a little oil in a pan and fry them gently until soft but not browned. Add the chilli and garlic, stir and then add the prawns and cook until they are opaque. Season well. Scoop out the prawns and bubble the juices until they thicken, then add back the prawns.",
      "STEP 3",
      "Divide the empanada dough into eight balls and roll out to thin circles on a floured surface. Put some filling on one half of the dough, sprinkle the feta on top and fold the other half over. Trim the edge and then fold and crimp the dough together so the empanada is tightly sealed, put it on an oiled baking sheet either on its side or sitting on its un-crimped edge like a cornish pasty. Repeat with the remaining dough and mixture. Mix the leftover egg yolk with a splash of water and brush the top of the empanadas.",
      "STEP 4",
      "Bake for 30 minutes or until golden and slightly crisp around the edges."
    ],
    "ingredients": [
      {
        "name": "Spring Onions",
        "quantity": "1  bunch"
      },
      {
        "name": "Olive Oil",
        "quantity": "Dash"
      },
      {
        "name": "Red Chilli",
        "quantity": "1 finely sliced"
      },
      {
        "name": "Garlic",
        "quantity": "1 clove"
      },
      {
        "name": "Prawns",
        "quantity": "350g"
      },
      {
        "name": "Feta",
        "quantity": "75g"
      },
      {
        "name": "Butter",
        "quantity": "15g"
      },
      {
        "name": "Plain Flour",
        "quantity": "250g"
      },
      {
        "name": "Egg",
        "quantity": "1 Seperated"
      },
      {
        "name": "White Wine Vinegar",
        "quantity": "1/2 tsp"
      }
    ],
    "cuisineType": "portuguese",
    "mealType": "seafood",
    "difficultyLevel": "medium",
    "prepTime": 30,
    "cookTime": 45,
    "servings": 4,
    "tags": []
  },
  {
    "name": "Fresh sardines",
    "description": "Wash the fish under the cold tap. Roll in the flour and deep fry in oil until crispy. Lay on kitchen...",
    "imageUrl": "https://www.themealdb.com/images/media/meals/nv5lf31628771380.jpg",
    "instructions": [
      "Wash the fish under the cold tap. Roll in the flour and deep fry in oil until crispy. Lay on kitchen towel to get rid of the excess oil and serve hot or cold with a slice of lemon."
    ],
    "ingredients": [
      {
        "name": "Sardines",
        "quantity": "500g"
      },
      {
        "name": "Vegetable Oil",
        "quantity": "Dash"
      },
      {
        "name": "Flour",
        "quantity": "To Glaze"
      },
      {
        "name": "Salt",
        "quantity": "Dash"
      }
    ],
    "cuisineType": "croatian",
    "mealType": "side",
    "difficultyLevel": "medium",
    "prepTime": 30,
    "cookTime": 45,
    "servings": 4,
    "tags": [
      "fresh"
    ]
  },
  {
    "name": "Salmon Avocado Salad",
    "description": "Season the salmon, then rub with oil. Mix the dressing ingredients together. Halve, stone, peel and ...",
    "imageUrl": "https://www.themealdb.com/images/media/meals/1549542994.jpg",
    "instructions": [
      "Season the salmon, then rub with oil. Mix the dressing ingredients together. Halve, stone, peel and slice the avocados. Halve and quarter the cucumber lengthways, then cut into slices. Divide salad, avocado and cucumber between four plates, then drizzle with half the dressing.",
      "Heat a non-stick pan. Add the salmon and fry for 3-4 mins on each side until crisp but still moist inside. Put a salmon fillet on top of each salad and drizzle over the remaining dressing. Serve warm."
    ],
    "ingredients": [
      {
        "name": "Salmon",
        "quantity": "400g"
      },
      {
        "name": "Avocado",
        "quantity": "3"
      },
      {
        "name": "Cucumber",
        "quantity": "1"
      },
      {
        "name": "Spinach",
        "quantity": "400g"
      },
      {
        "name": "Mint",
        "quantity": "4 tbs"
      },
      {
        "name": "Lime",
        "quantity": "zest and juice of 1"
      },
      {
        "name": "Honey",
        "quantity": "2 tsp"
      },
      {
        "name": "Olive Oil",
        "quantity": "3 tbs"
      }
    ],
    "cuisineType": "british",
    "mealType": "seafood",
    "difficultyLevel": "medium",
    "prepTime": 30,
    "cookTime": 45,
    "servings": 4,
    "tags": [
      "paleo",
      "keto",
      "lowcarbs",
      "salad",
      "alcoholic",
      "halloween",
      ""
    ]
  },
  {
    "name": "Pan-fried hake, white bean & chorizo broth",
    "description": "step 1\r\nDrain the beans, then tip into a large pan with 2 litres of water. Simmer with the whole gar...",
    "imageUrl": "https://www.themealdb.com/images/media/meals/4yjart1763248459.jpg",
    "instructions": [
      "step 1",
      "Drain the beans, then tip into a large pan with 2 litres of water. Simmer with the whole garlic cloves, bay leaves and thyme for 30 mins or until cooked and tender. Remove from the heat and set aside.",
      "step 2",
      "Meanwhile, heat 2 tbsp oil in a frying pan. Fry the bread with the remaining garlic clove. When golden and crisp, scoop out and drain on kitchen paper. Add the chorizo to the pan, fry until crisp, tip out and keep warm with the bread.",
      "step 3",
      "Add another 2 tbsp oil and the onion to the pan, and cook for 5 mins until softened. Stir in the paprika. Drain the beans and add to the onions with the chicken stock and 2 tsp salt. Cook for 5-10 mins. Stir through the parsley and keep warm.",
      "step 4",
      "Season the hake and heat the remaining 2 tbsp oil in the frying pan. Put the hake, skin-side down, in the pan and cook for 3-5 mins over a mediumhigh heat to crisp up the skin. Flip the fish over and cook for a further 3-5 mins until cooked through. Spoon the white bean mix into bowls, place the hake on top and finish with the fried bread, chorizo and a little more thyme."
    ],
    "ingredients": [
      {
        "name": "Dried white beans",
        "quantity": "450g"
      },
      {
        "name": "Garlic",
        "quantity": "4 cloves"
      },
      {
        "name": "Bay Leaves",
        "quantity": "2"
      },
      {
        "name": "Thyme",
        "quantity": "1 teaspoon"
      },
      {
        "name": "Olive Oil",
        "quantity": "6 tablespoons"
      },
      {
        "name": "Bread",
        "quantity": "100g"
      },
      {
        "name": "Chorizo",
        "quantity": "100g"
      },
      {
        "name": "Onion",
        "quantity": "1"
      },
      {
        "name": "Paprika",
        "quantity": "3 tsp"
      },
      {
        "name": "Chicken Stock",
        "quantity": "1 L"
      },
      {
        "name": "Parsley",
        "quantity": "Handful"
      },
      {
        "name": "Hake",
        "quantity": "6"
      }
    ],
    "cuisineType": "spanish",
    "mealType": "seafood",
    "difficultyLevel": "medium",
    "prepTime": 30,
    "cookTime": 45,
    "servings": 4,
    "tags": []
  },
  {
    "name": "Fyrstekake – Norwegian Prince Cake",
    "description": "Crust\r\n▢\r\nMix together sugar, vanilla and butter until light and fluffy. Mix in the egg yolks. Add i...",
    "imageUrl": "https://www.themealdb.com/images/media/meals/9zqrod1763075574.jpg",
    "instructions": [
      "Crust",
      "▢",
      "Mix together sugar, vanilla and butter until light and fluffy. Mix in the egg yolks. Add in the flour and baking powder and knead with hands until the dough is smooth.",
      "▢",
      "Pack the dough in plastic wrap and chill in refrigerator for at least 30 minutes.",
      "Almond filling",
      "▢",
      "Run the almonds and sugar together in a food processor until the almonds are finely ground (you can decide for yourself how coarse or fine you want them).",
      "▢",
      "Stir in the butter, egg, cognac and/or almond extract (if using).",
      "Assembly",
      "▢",
      "Line the bottom of your cake form with baking paper and grease the sides of the form.",
      "▢",
      "Preheat oven to 350°F (175°C).",
      "▢",
      "Cut 2/3 of the crust dough into slices and press down into the cake form. Cover the bottom of the cake form with the dough and bring the dough 2-3 cm (1 inch) up the sides of the form, pressing until even.",
      "▢",
      "Scoop the almond filling on top of the crust, spreading it evenly across the cake form.",
      "▢",
      "Roll out of the rest of the dough and slice into long strips. Lay the strips of dough across the cake in a grid. Don't worry of the strips break – simply press them back together on the cake.",
      "▢",
      "Gently brush the dough with egg wash.",
      "▢",
      "Bake for about 45 minutes. The top of the cake should be golden brown while the almond filling will remain soft."
    ],
    "ingredients": [
      {
        "name": "Granulated Sugar",
        "quantity": "3/4 cup"
      },
      {
        "name": "Vanilla Extract",
        "quantity": "1 teaspoon"
      },
      {
        "name": "Butter",
        "quantity": "2/3 Cup"
      },
      {
        "name": "Egg Yolks",
        "quantity": "4"
      },
      {
        "name": "Flour",
        "quantity": "2 cups"
      },
      {
        "name": "Baking Powder",
        "quantity": "1 teaspoon"
      },
      {
        "name": "Almonds",
        "quantity": "1 1/2 cups"
      },
      {
        "name": "Brown Sugar",
        "quantity": "3/4 cup"
      },
      {
        "name": "Melted Butter",
        "quantity": "2 tbsp"
      },
      {
        "name": "Egg",
        "quantity": "2 medium"
      },
      {
        "name": "Brandy",
        "quantity": "2 tablespoons"
      },
      {
        "name": "Almond Extract",
        "quantity": "5 drops"
      },
      {
        "name": "Egg",
        "quantity": "1"
      }
    ],
    "cuisineType": "norwegian",
    "mealType": "dessert",
    "difficultyLevel": "medium",
    "prepTime": 30,
    "cookTime": 45,
    "servings": 4,
    "tags": []
  },
  {
    "name": "McSinghs Scotch pie",
    "description": "Heat a large frying pan and toast the cumin seeds for a few minutes, then set aside. Heat the oil in...",
    "imageUrl": "https://www.themealdb.com/images/media/meals/vssrtx1511557680.jpg",
    "instructions": [
      "Heat a large frying pan and toast the cumin seeds for a few minutes, then set aside. Heat the oil in the same pan and fry the onion, garlic, chilli, pepper and a good pinch of salt for around eight minutes, until there is no moisture left. Remove from the heat, stir in the toasted cumin seeds, ground mace (or nutmeg) and ground coriander. Leave to cool.",
      "In a large bowl mix together the minced lamb, white pepper, fresh coriander, and the cooled spiced onion mixture until combined. Set aside, covered, in the fridge.",
      "Preheat the oven to 200C/400F/Gas 6 and generously grease a 20cm/8in diameter loose-bottomed or springform round cake tin with lard.",
      "To make the pastry, sift the flour and salt in a large bowl and make a well in the centre.",
      "Put the milk, lard and 90ml/3fl oz of water in a saucepan and heat gently. When the lard has melted, increase the heat and bring to the boil.",
      "Pour the boiling liquid into the flour, and use a wooden spoon to combine until cool enough to handle. Bring together into a ball.",
      "Dust a work surface with flour and, working quickly, knead the dough briefly – it will be soft and moist. Set aside a third of the pastry and roll the rest out on a well-floured surface. Line the pie dish with the pastry, pressing it right up the sides until it pokes just over the top of the tin.",
      "Add the filling into the pastry-lined tin bit by bit. As you reach the top, form a slight peak. Roll out the reserved pastry and top the pie with it. Pinch the edges to seal and trim the excess. Poke a hole in the top of the pie and insert a small tube made from aluminium foil to allow steam to escape.",
      "Brush the top of the pie with a little beaten egg yolk, and bake in the preheated oven for 30 minutes (put a tray on the shelf below to catch any drips). Then reduce the temperature to 160C/325F/Gas 3 and cook for a further 1¼ hours until golden-brown. Leave to cool completely before refrigerating for two hours, or overnight.",
      "Run a knife around the edge of the pie, remove from the tin and serve with chutneys, salads or pickles."
    ],
    "ingredients": [
      {
        "name": "Cumin",
        "quantity": "2 tsp"
      },
      {
        "name": "Rapeseed Oil",
        "quantity": "1 tbs"
      },
      {
        "name": "Red Onions",
        "quantity": "2 finely chopped"
      },
      {
        "name": "Garlic Clove",
        "quantity": "6"
      },
      {
        "name": "Green Chilli",
        "quantity": "3 finely chopped"
      },
      {
        "name": "Red Pepper",
        "quantity": "1 finely chopped"
      },
      {
        "name": "Nutmeg",
        "quantity": "1 tsp"
      },
      {
        "name": "Coriander",
        "quantity": "2 tsp"
      },
      {
        "name": "Lamb Mince",
        "quantity": "1kg"
      },
      {
        "name": "Pepper",
        "quantity": "1 tsp"
      },
      {
        "name": "Coriander",
        "quantity": "3 tbs"
      },
      {
        "name": "Plain Flour",
        "quantity": "340g"
      },
      {
        "name": "Salt",
        "quantity": "½ tsp"
      },
      {
        "name": "Milk",
        "quantity": "90 ml"
      },
      {
        "name": "Lard",
        "quantity": "150g"
      },
      {
        "name": "Egg Yolks",
        "quantity": "Beaten"
      }
    ],
    "cuisineType": "british",
    "mealType": "lamb",
    "difficultyLevel": "medium",
    "prepTime": 30,
    "cookTime": 45,
    "servings": 4,
    "tags": [
      "pie"
    ]
  },
  {
    "name": "Spaghetti with Spanish flavours",
    "description": "step 1\r\nPut a pan of water on over a high heat to boil. Meanwhile, snip the chorizo into strips with...",
    "imageUrl": "https://www.themealdb.com/images/media/meals/vpcqn01763335688.jpg",
    "instructions": [
      "step 1",
      "Put a pan of water on over a high heat to boil. Meanwhile, snip the chorizo into strips with scissors, and chop the parsley and peppers (check for stray seeds first).",
      "step 2",
      "When the water is boiling briskly, add the spaghetti with a good measure of salt, stir and return to the boil. Cook for 3 minutes.",
      "step 3",
      "In a large frying pan, heat the oil, add the chorizo and peppers and plenty of black pepper. Cook for a minute or so, until heated through and the juices are stained red from the paprika in the chorizo. Scoop half a mugful of pasta water from the pan, drain the remainder and tip the spaghetti into the frying pan.",
      "step 4",
      "Add the parsley and parmesan, toss well and splash in the pasta water, to moisten. Hand round extra parmesan at the table."
    ],
    "ingredients": [
      {
        "name": "Chorizo",
        "quantity": "80g"
      },
      {
        "name": "Spaghetti",
        "quantity": "300g"
      },
      {
        "name": "Parsley",
        "quantity": "20g"
      },
      {
        "name": "Red Pepper",
        "quantity": "2"
      },
      {
        "name": "Olive Oil",
        "quantity": "2 tbsp"
      },
      {
        "name": "Parmesan Cheese",
        "quantity": "50g"
      }
    ],
    "cuisineType": "spanish",
    "mealType": "pork",
    "difficultyLevel": "medium",
    "prepTime": 30,
    "cookTime": 45,
    "servings": 4,
    "tags": []
  },
  {
    "name": "Spicy North African Potato Salad",
    "description": "Cook potatoes - place potatoes in a pot of cold water, and bring to the boil. Boil 20 minutes, or un...",
    "imageUrl": "https://www.themealdb.com/images/media/meals/urtwux1486983078.jpg",
    "instructions": [
      "Cook potatoes - place potatoes in a pot of cold water, and bring to the boil. Boil 20 minutes, or until potatoes are tender. You know they are cooked when you can stick a knife in them and the knife goes straight through.",
      "Combine harissa spice, olive oil, salt and pepper and lemon juice in a small bowl and whisk until combined.",
      "Once potatoes are cooked, drain water and roughly chop potatoes in half.",
      "Add harissa mix and spring onions/green onions to potatoes and stir.",
      "In a large salad bowl, lay out arugula/rocket.",
      "Top with potato mix and toss.",
      "Add fetta, mint and sprinkle over pine nuts.",
      "Adjust salt and pepper to taste."
    ],
    "ingredients": [
      {
        "name": "Small Potatoes",
        "quantity": "650g/1lb 8 oz"
      },
      {
        "name": "Harissa Spice",
        "quantity": "1 tsp"
      },
      {
        "name": "olive oil",
        "quantity": "2 tsp"
      },
      {
        "name": "Lemon",
        "quantity": "juice of half"
      },
      {
        "name": "Spring onions",
        "quantity": "4"
      },
      {
        "name": "Rocket",
        "quantity": "150g/6oz"
      },
      {
        "name": "Feta",
        "quantity": "80g/3oz"
      },
      {
        "name": "Mint",
        "quantity": "20 chopped"
      },
      {
        "name": "Pine nuts",
        "quantity": "2 tablespoons"
      },
      {
        "name": "Salt",
        "quantity": "Pinch"
      },
      {
        "name": "Pepper",
        "quantity": "Pinch"
      }
    ],
    "cuisineType": "moroccan",
    "mealType": "vegetarian",
    "difficultyLevel": "medium",
    "prepTime": 30,
    "cookTime": 45,
    "servings": 4,
    "tags": [
      "vegetarian",
      "spicy"
    ]
  },
  {
    "name": "Beef Lo Mein",
    "description": "STEP 1 - MARINATING THE BEEF\r\nIn a bowl, add the beef, salt, 1 pinch white pepper, 1 Teaspoon sesame...",
    "imageUrl": "https://www.themealdb.com/images/media/meals/1529444830.jpg",
    "instructions": [
      "STEP 1 - MARINATING THE BEEF",
      "In a bowl, add the beef, salt, 1 pinch white pepper, 1 Teaspoon sesame seed oil, 1/2 egg, corn starch,1 Tablespoon of oil and mix together.",
      "STEP 2 - BOILING THE THE NOODLES",
      "In a 6 qt pot add your noodles to boiling water until the noodles are submerged and boil on high heat for 10 seconds. After your noodles is done boiling strain and cool with cold water.",
      "STEP 3 - STIR FRY",
      "Add 2 Tablespoons of oil, beef and cook on high heat untill beef is medium cooked.",
      "Set the cooked beef aside",
      "In a wok add 2 Tablespoon of oil, onions, minced garlic, minced ginger, bean sprouts, mushrooms, peapods and 1.5 cups of water or until the vegetables are submerged in water.",
      "Add the noodles to wok",
      "To make the sauce, add oyster sauce, 1 pinch white pepper, 1 teaspoon sesame seed oil, sugar, and 1 Teaspoon of soy sauce.",
      "Next add the beef to wok and stir-fry"
    ],
    "ingredients": [
      {
        "name": "Beef",
        "quantity": "1/2 lb"
      },
      {
        "name": "Salt",
        "quantity": "pinch"
      },
      {
        "name": "Pepper",
        "quantity": "pinch"
      },
      {
        "name": "Sesame Seed Oil",
        "quantity": "2 tsp"
      },
      {
        "name": "Egg",
        "quantity": "1/2"
      },
      {
        "name": "Starch",
        "quantity": "3 tbs"
      },
      {
        "name": "Oil",
        "quantity": "5 tbs"
      },
      {
        "name": "Noodles",
        "quantity": "1/4 lb"
      },
      {
        "name": "Onion",
        "quantity": "1/2 cup"
      },
      {
        "name": "Minced Garlic",
        "quantity": "1 tsp"
      },
      {
        "name": "Ginger",
        "quantity": "1 tsp"
      },
      {
        "name": "Bean Sprouts",
        "quantity": "1 cup"
      },
      {
        "name": "Mushrooms",
        "quantity": "1 cup"
      },
      {
        "name": "Water",
        "quantity": "1 cup"
      },
      {
        "name": "Oyster Sauce",
        "quantity": "1 tbs"
      },
      {
        "name": "Sugar",
        "quantity": "1 tsp"
      },
      {
        "name": "Soy Sauce",
        "quantity": "1 tsp"
      }
    ],
    "cuisineType": "chinese",
    "mealType": "beef",
    "difficultyLevel": "medium",
    "prepTime": 30,
    "cookTime": 45,
    "servings": 4,
    "tags": []
  },
  {
    "name": "Chickpea Fajitas",
    "description": "Heat oven to 200C/180C fan/gas 6 and line a baking tray with foil. Drain the chickpeas, pat dry and ...",
    "imageUrl": "https://www.themealdb.com/images/media/meals/tvtxpq1511464705.jpg",
    "instructions": [
      "Heat oven to 200C/180C fan/gas 6 and line a baking tray with foil. Drain the chickpeas, pat dry and tip onto the prepared baking tray. Add the oil and paprika, toss to coat, then roast for 20-25 mins until browned and crisp, shaking halfway through cooking.",
      "Meanwhile, put the tomatoes and onion in a small bowl with the vinegar and set aside to pickle. Put the avocado in another bowl and mash with a fork, leaving some larger chunks. Stir in the lime juice and season well. Mix the soured cream with the harissa and set aside until ready to serve.",
      "Heat a griddle pan until nearly smoking. Add the tortillas , one at a time, charring each side until hot with griddle lines. ",
      "Put everything on the table and build the fajitas : spread a little of the harissa cream over the tortilla, top with roasted chickpeas, guacamole, pickled salsa and coriander, if you like. Serve with the lime wedges for squeezing over."
    ],
    "ingredients": [
      {
        "name": "Chickpeas",
        "quantity": "400g"
      },
      {
        "name": "Olive Oil",
        "quantity": "1 tblsp"
      },
      {
        "name": "Paprika",
        "quantity": "pinch"
      },
      {
        "name": "Tomatoes",
        "quantity": "2 small cut chunks"
      },
      {
        "name": "Red Onions",
        "quantity": "1 finely sliced"
      },
      {
        "name": "Red Wine Vinegar",
        "quantity": "2 tsp"
      },
      {
        "name": "Avocado",
        "quantity": "1"
      },
      {
        "name": "Lime",
        "quantity": "Juice of 1"
      },
      {
        "name": "Lime",
        "quantity": "Chopped"
      },
      {
        "name": "Sour Cream",
        "quantity": "100g"
      },
      {
        "name": "Harissa Spice",
        "quantity": "2 tsp"
      },
      {
        "name": "Corn Tortillas",
        "quantity": "4"
      },
      {
        "name": "Coriander",
        "quantity": "to serve"
      }
    ],
    "cuisineType": "mexican",
    "mealType": "vegetarian",
    "difficultyLevel": "medium",
    "prepTime": 30,
    "cookTime": 45,
    "servings": 4,
    "tags": [
      "vegetarian"
    ]
  },
  {
    "name": "Seri muka kuih",
    "description": "Soak glutinous rice with water for at least 1 ½ hours prior to using. Drain.\r\nPrepare a 9-inch round...",
    "imageUrl": "https://www.themealdb.com/images/media/meals/6ut2og1619790195.jpg",
    "instructions": [
      "Soak glutinous rice with water for at least 1 ½ hours prior to using. Drain.",
      "Prepare a 9-inch round or square cake pan and spray with cooking spray or line with plastic wrap.",
      "Mix coconut milk, water, salt and the rice. Pour it into cake pan, topped with the pandan knots.",
      "Steam for 30 minutes.",
      "After 30 minutes, fluff up the rice and remove pandan knots. Then, using a greased spatula, flatten the steamed rice. Make sure there are no holes/air bubbles and gaps in the rice, especially the sides.",
      "Steam for another 10 minutes.",
      "Combine pandan juice, coconut milk, all purpose flour, cornflour, and sugar. Mix well.",
      "Add eggs and whisk well then strain into a medium sized metal bowl or pot.",
      "Place pandan mixture over simmering water (double boiler or bain-marie)",
      "Stir continuously and cook till custard starts to thicken. (15 minutes)",
      "Pour pandan custard into glutinous rice layer, give it a little tap (for air bubbles) and continue to steam for 30 minutes.",
      "Remove kuih seri muka from the steamer and allow to cool completely before cutting into rectangles or diamond shapes."
    ],
    "ingredients": [
      {
        "name": "Rice",
        "quantity": "400g"
      },
      {
        "name": "Coconut Milk",
        "quantity": "150ml"
      },
      {
        "name": "Water",
        "quantity": "100ml"
      },
      {
        "name": "Salt",
        "quantity": "1 tsp"
      },
      {
        "name": "Corn Flour",
        "quantity": "5 tbs"
      },
      {
        "name": "Flour",
        "quantity": "3 tbs"
      },
      {
        "name": "Eggs",
        "quantity": "3"
      },
      {
        "name": "Coconut Cream",
        "quantity": "200ml"
      },
      {
        "name": "Sugar",
        "quantity": "140g"
      }
    ],
    "cuisineType": "malaysian",
    "mealType": "dessert",
    "difficultyLevel": "medium",
    "prepTime": 30,
    "cookTime": 45,
    "servings": 4,
    "tags": []
  },
  {
    "name": "Spicy Arrabiata Penne",
    "description": "Bring a large pot of water to a boil. Add kosher salt to the boiling water, then add the pasta. Cook...",
    "imageUrl": "https://www.themealdb.com/images/media/meals/ustsqw1468250014.jpg",
    "instructions": [
      "Bring a large pot of water to a boil. Add kosher salt to the boiling water, then add the pasta. Cook according to the package instructions, about 9 minutes.",
      "In a large skillet over medium-high heat, add the olive oil and heat until the oil starts to shimmer. Add the garlic and cook, stirring, until fragrant, 1 to 2 minutes. Add the chopped tomatoes, red chile flakes, Italian seasoning and salt and pepper to taste. Bring to a boil and cook for 5 minutes. Remove from the heat and add the chopped basil.",
      "Drain the pasta and add it to the sauce. Garnish with Parmigiano-Reggiano flakes and more basil and serve warm."
    ],
    "ingredients": [
      {
        "name": "penne rigate",
        "quantity": "1 pound"
      },
      {
        "name": "olive oil",
        "quantity": "1/4 cup"
      },
      {
        "name": "garlic",
        "quantity": "3 cloves"
      },
      {
        "name": "chopped tomatoes",
        "quantity": "1 tin"
      },
      {
        "name": "red chilli flakes",
        "quantity": "1/2 teaspoon"
      },
      {
        "name": "italian seasoning",
        "quantity": "1/2 teaspoon"
      },
      {
        "name": "basil",
        "quantity": "6 leaves"
      },
      {
        "name": "Parmigiano-Reggiano",
        "quantity": "sprinkling"
      }
    ],
    "cuisineType": "italian",
    "mealType": "vegetarian",
    "difficultyLevel": "medium",
    "prepTime": 30,
    "cookTime": 45,
    "servings": 4,
    "tags": [
      "pasta",
      "curry"
    ]
  },
  {
    "name": "Rock Cakes",
    "description": "Preheat oven to 180C/350F/Gas 4 and line a baking tray with baking parchment.\r\nMix the flour, sugar ...",
    "imageUrl": "https://www.themealdb.com/images/media/meals/tqrrsq1511723764.jpg",
    "instructions": [
      "Preheat oven to 180C/350F/Gas 4 and line a baking tray with baking parchment.",
      "Mix the flour, sugar and baking powder in a bowl and rub in the cubed butter until the mixture looks like breadcrumbs, then mix in the dried fruit.",
      "In a clean bowl, beat the egg and milk together with the vanilla extract.",
      "Add the egg mixture to the dry ingredients and stir with a spoon until the mixture just comes together as a thick, lumpy dough. Add a teaspoon more milk if you really need it to make the mixture stick together.",
      "Place golfball-sized spoons of the mixture onto the prepared baking tray. Leave space between them as they will flatten and spread out to double their size during baking.",
      "Bake for 15-20 minutes, until golden-brown. Remove from the oven, allow to cool for a couple of minutes then turn them out onto a wire rack to cool."
    ],
    "ingredients": [
      {
        "name": "Self-raising Flour",
        "quantity": "225g"
      },
      {
        "name": "Caster Sugar",
        "quantity": "75g"
      },
      {
        "name": "Baking Powder",
        "quantity": "1 tsp"
      },
      {
        "name": "Butter",
        "quantity": "125g"
      },
      {
        "name": "Dried Fruit",
        "quantity": "150g"
      },
      {
        "name": "Eggs",
        "quantity": "1"
      },
      {
        "name": "Milk",
        "quantity": "1 tbs"
      },
      {
        "name": "Vanilla Extract",
        "quantity": "2 tsp"
      }
    ],
    "cuisineType": "british",
    "mealType": "dessert",
    "difficultyLevel": "medium",
    "prepTime": 30,
    "cookTime": 45,
    "servings": 4,
    "tags": [
      "baking",
      "cake"
    ]
  },
  {
    "name": "Beef stroganoff",
    "description": "Heat the olive oil in a non-stick frying pan then add the sliced onion and cook on a medium heat unt...",
    "imageUrl": "https://www.themealdb.com/images/media/meals/svprys1511176755.jpg",
    "instructions": [
      "Heat the olive oil in a non-stick frying pan then add the sliced onion and cook on a medium heat until completely softened, so around 15 mins, adding a little splash of water if they start to stick at all. Crush in the garlic and cook for a 2-3 mins further, then add the butter. Once the butter is foaming a little, add the mushrooms and cook for around 5 mins until completely softened. Season everything well, then tip onto a plate.",
      "Tip the flour into a bowl with a big pinch of salt and pepper, then toss the steak in the seasoned flour. Add the steak pieces to the pan, splashing in a little oil if the pan looks particularly dry, and fry for 3-4 mins, until well coloured. Tip the onions and mushrooms back into the pan. Whisk the crème fraîche, mustard and beef stock together, then pour into the pan. Cook over a medium heat for around 5 mins. Scatter with parsley, then serve with pappardelle or rice."
    ],
    "ingredients": [
      {
        "name": "Olive Oil",
        "quantity": "1 tbls"
      },
      {
        "name": "Onions",
        "quantity": "1"
      },
      {
        "name": "Garlic",
        "quantity": "1 clove"
      },
      {
        "name": "Butter",
        "quantity": "1 tbsp"
      },
      {
        "name": "Mushrooms",
        "quantity": "250g"
      },
      {
        "name": "Beef Fillet",
        "quantity": "500g"
      },
      {
        "name": "Plain Flour",
        "quantity": "1tbsp"
      },
      {
        "name": "Creme Fraiche",
        "quantity": "150g"
      },
      {
        "name": "English Mustard",
        "quantity": "1 tbsp"
      },
      {
        "name": "Beef Stock",
        "quantity": "100ml"
      },
      {
        "name": "Parsley",
        "quantity": "Topping"
      }
    ],
    "cuisineType": "russian",
    "mealType": "beef",
    "difficultyLevel": "medium",
    "prepTime": 30,
    "cookTime": 45,
    "servings": 4,
    "tags": []
  },
  {
    "name": "Beef Dumpling Stew",
    "description": "Preheat the oven to 180C/350F/Gas 4.\r\n\r\nFor the beef stew, heat the oil and butter in an ovenproof c...",
    "imageUrl": "https://www.themealdb.com/images/media/meals/uyqrrv1511553350.jpg",
    "instructions": [
      "Preheat the oven to 180C/350F/Gas 4.",
      "For the beef stew, heat the oil and butter in an ovenproof casserole and fry the beef until browned on all sides.",
      "Sprinkle over the flour and cook for a further 2-3 minutes.",
      "Add the garlic and all the vegetables and fry for 1-2 minutes.",
      "Stir in the wine, stock and herbs, then add the Worcestershire sauce and balsamic vinegar, to taste. Season with salt and freshly ground black pepper.",
      "Cover with a lid, transfer to the oven and cook for about two hours, or until the meat is tender.",
      "For the dumplings, sift the flour, baking powder and salt into a bowl.",
      "Add the suet and enough water to form a thick dough.",
      "With floured hands, roll spoonfuls of the dough into small balls.",
      "After two hours, remove the lid from the stew and place the balls on top of the stew. Cover, return to the oven and cook for a further 20 minutes, or until the dumplings have swollen and are tender. (If you prefer your dumplings with a golden top, leave the lid off when returning to the oven.)",
      "To serve, place a spoonful of mashed potato onto each of four serving plates and top with the stew and dumplings. Sprinkle with chopped parsley."
    ],
    "ingredients": [
      {
        "name": "Olive Oil",
        "quantity": "2 tbs"
      },
      {
        "name": "Butter",
        "quantity": "25g"
      },
      {
        "name": "Beef",
        "quantity": "750g"
      },
      {
        "name": "Plain Flour",
        "quantity": "2 tblsp"
      },
      {
        "name": "Garlic",
        "quantity": "2 cloves minced"
      },
      {
        "name": "Onions",
        "quantity": "175g"
      },
      {
        "name": "Celery",
        "quantity": "150g"
      },
      {
        "name": "Carrots",
        "quantity": "150g"
      },
      {
        "name": "Leek",
        "quantity": "2 chopped"
      },
      {
        "name": "Swede",
        "quantity": "200g"
      },
      {
        "name": "Red Wine",
        "quantity": "150ml"
      },
      {
        "name": "Beef Stock",
        "quantity": "500g"
      },
      {
        "name": "Bay Leaf",
        "quantity": "2"
      },
      {
        "name": "Thyme",
        "quantity": "3 tbs"
      },
      {
        "name": "Parsley",
        "quantity": "3 tblsp chopped"
      },
      {
        "name": "Plain Flour",
        "quantity": "125g"
      },
      {
        "name": "Baking Powder",
        "quantity": "1 tsp"
      },
      {
        "name": "Suet",
        "quantity": "60g"
      },
      {
        "name": "Water",
        "quantity": "Splash"
      }
    ],
    "cuisineType": "british",
    "mealType": "beef",
    "difficultyLevel": "medium",
    "prepTime": 30,
    "cookTime": 45,
    "servings": 4,
    "tags": [
      "stew",
      "baking"
    ]
  },
  {
    "name": "Kvæfjord Cake “Verdens Beste” (World’s Best Cake)",
    "description": "Vanilla custard\r\n▢\r\nSeparate the egg yolks and set aside the whites to use in the meringue.\r\n▢\r\nWhis...",
    "imageUrl": "https://www.themealdb.com/images/media/meals/gdn1ot1763075684.jpg",
    "instructions": [
      "Vanilla custard",
      "▢",
      "Separate the egg yolks and set aside the whites to use in the meringue.",
      "▢",
      "Whisk together the egg yolks, cornstarch and sugar in a bowl.",
      "▢",
      "Heat the cream and milk in a saucepan. Split open the vanilla pod and add the beans to the saucepan. Once the milk begins to bubble pour about half of it into the bowl with the egg mixture, whisking constantly. Then return the saucepan to the heat and pour the egg mixture back into the saucepan with remaining milk, whisking constantly. Once the mixture thickens lower the heat and continue whisking for about 30 seconds.",
      "▢",
      "Pour the custard into a clean bowl and cover with plastic wrap, placing the plastic directly on the top layer of the custard. Chill in the fridge.",
      "Cake",
      "▢",
      "Mix together butter and sugar until light and fluffy. Add egg yolks one at a time, setting aside the egg whites for the meringue. Add the flour mixed with baking powder. Stir in the milk, beating until smooth (you can use an electric mixer if you prefer).",
      "▢",
      "Preheat oven to 320°F (160°C). Cover a baking sheet with baking paper and spread out the batter into a large, even rectangle.",
      "Meringue topping",
      "▢",
      "Whisk together the egg whites and sugar until you get glossy, stiff peaks. The meringue should hold its form – if it still melts continue whisking.",
      "▢",
      "Spread out the meringue on top of the cake batter. Use a spatula to form light waves with the meringue. Sprinkle almonds on top of the meringue. Bake for about 30 minutes, until the meringue and almonds are golden.",
      "Cream filling",
      "▢",
      "Whisk the cream into stiff peaks. Carefully fold in the vanilla custard.",
      "Assembly",
      "▢",
      "Once the cake has cooled, cut it in half. You can use scissors for this, or a knife on a cutting board, slicing through the baking paper as well.",
      "▢",
      "Place half of the cake on a serving platter with the meringue side down and peel off the baking paper.",
      "▢",
      "Spread the cream filling across the cake. Then carefully remove the other half of the cake from the baking paper and place it over the cream filling, meringue side up.",
      "▢",
      "Serve with fresh berries."
    ],
    "ingredients": [
      {
        "name": "Egg Yolks",
        "quantity": "2 large"
      },
      {
        "name": "Cornstarch",
        "quantity": "2 tblsp"
      },
      {
        "name": "Granulated Sugar",
        "quantity": "1/4 cup"
      },
      {
        "name": "Heavy Cream",
        "quantity": "2/3 Cup"
      },
      {
        "name": "Milk",
        "quantity": "3/4 cup"
      },
      {
        "name": "vanilla pod",
        "quantity": "1"
      },
      {
        "name": "Butter",
        "quantity": "2/3 Cup"
      },
      {
        "name": "Granulated Sugar",
        "quantity": "3/4 cup"
      },
      {
        "name": "Egg Yolks",
        "quantity": "5 Large"
      },
      {
        "name": "Flour",
        "quantity": "1 1/4 cup"
      },
      {
        "name": "Baking Powder",
        "quantity": "1.5 tsp"
      },
      {
        "name": "Milk",
        "quantity": "1/2 cup"
      },
      {
        "name": "Egg White",
        "quantity": "7"
      },
      {
        "name": "Granulated Sugar",
        "quantity": "1 1/2 cups"
      },
      {
        "name": "Almonds",
        "quantity": "Sliced"
      },
      {
        "name": "Whipping Cream",
        "quantity": "1 1/4 cup"
      }
    ],
    "cuisineType": "norwegian",
    "mealType": "dessert",
    "difficultyLevel": "medium",
    "prepTime": 30,
    "cookTime": 45,
    "servings": 4,
    "tags": []
  },
  {
    "name": "Tourtiere",
    "description": "Heat oven to 200C/180C fan/gas 6. Boil the potato until tender, drain and mash, then leave to cool. ...",
    "imageUrl": "https://www.themealdb.com/images/media/meals/ytpstt1511814614.jpg",
    "instructions": [
      "Heat oven to 200C/180C fan/gas 6. Boil the potato until tender, drain and mash, then leave to cool. Heat the oil in a non-stick pan, add the mince and onion and quickly fry until browned. Add the garlic, spices, stock, plenty of pepper and a little salt and mix well. Remove from the heat, stir into the potato and leave to cool.",
      "Roll out half the pastry and line the base of a 20-23cm pie plate or flan tin. Fill with the pork mixture and brush the edges of the pastry with water. Roll out the remaining dough and cover the pie. Press the edges of the pastry to seal, trimming off the excess. Prick the top of the pastry case to allow steam to escape and glaze the top with the beaten egg.",
      "Bake for 30 mins until the pastry is crisp and golden. Serve cut into wedges with a crisp green salad. Leftovers are good cold for lunch the next day, served with a selection of pickles."
    ],
    "ingredients": [
      {
        "name": "Potatoes",
        "quantity": "1 medium"
      },
      {
        "name": "Sunflower Oil",
        "quantity": "1 tsp"
      },
      {
        "name": "Minced Pork",
        "quantity": "500g"
      },
      {
        "name": "Onion",
        "quantity": "1 finely chopped"
      },
      {
        "name": "Garlic Clove",
        "quantity": "1 finely chopped"
      },
      {
        "name": "Cinnamon",
        "quantity": "¼ tsp"
      },
      {
        "name": "Allspice",
        "quantity": "¼ tsp"
      },
      {
        "name": "Nutmeg",
        "quantity": "¼ tsp"
      },
      {
        "name": "Vegetable Stock",
        "quantity": "100ml"
      },
      {
        "name": "Shortcrust Pastry",
        "quantity": "400g"
      },
      {
        "name": "Egg",
        "quantity": "To Glaze"
      }
    ],
    "cuisineType": "canadian",
    "mealType": "pork",
    "difficultyLevel": "medium",
    "prepTime": 30,
    "cookTime": 45,
    "servings": 4,
    "tags": [
      "pie",
      "mainmeal",
      "bbq",
      "cake"
    ]
  },
  {
    "name": "Chocolate Coconut Squares",
    "description": "step 1\r\nHeat oven to 180C/fan 160C/gas 4. Butter and line the base of a 20cm square baking tin. Beat...",
    "imageUrl": "https://www.themealdb.com/images/media/meals/8oupz51761848432.jpg",
    "instructions": [
      "step 1",
      "Heat oven to 180C/fan 160C/gas 4. Butter and line the base of a 20cm square baking tin. Beat together the butter and sugar until pale and creamy, then beat in the eggs. Add 1 tbsp of the flour if the mix starts to curdle.",
      "step 2",
      "Sieve in the flour, baking powder and cocoa and fold in with a metal spoon. Stir in the milk. Scrape mix into the tin and level the top. Bake for 18-20 mins or until the cake springs back when pressed. Allow to cool in the tin.",
      "step 3",
      "To make the icing, put the chocolate, butter and 4 tbsp water in a pan and gently heat until melted. Allow to cool slightly, then beat in the icing sugar.",
      "step 4",
      "Remove cake from tin and peel away paper. Cut into 16 squares. Dip the squares into the icing, then roll in the coconut. Allow to set on cooling rack."
    ],
    "ingredients": [
      {
        "name": "Butter",
        "quantity": "100g"
      },
      {
        "name": "Caster Sugar",
        "quantity": "100g"
      },
      {
        "name": "Egg",
        "quantity": "2"
      },
      {
        "name": "Self-raising Flour",
        "quantity": "140g"
      },
      {
        "name": "Baking Powder",
        "quantity": "1 teaspoon"
      },
      {
        "name": "Cocoa Powder",
        "quantity": "2 tablespoons"
      },
      {
        "name": "Milk",
        "quantity": "2 tablespoons"
      },
      {
        "name": "Plain Chocolate",
        "quantity": "100g"
      },
      {
        "name": "Butter",
        "quantity": "25g"
      },
      {
        "name": "Icing Sugar",
        "quantity": "100g"
      },
      {
        "name": "Desiccated Coconut",
        "quantity": "100g"
      }
    ],
    "cuisineType": "australian",
    "mealType": "dessert",
    "difficultyLevel": "medium",
    "prepTime": 30,
    "cookTime": 45,
    "servings": 4,
    "tags": []
  },
  {
    "name": "Drunken noodles (pad kee mao)",
    "description": "step 1\r\nPrepare the noodles following pack instructions, then drain and set aside. Combine all the i...",
    "imageUrl": "https://www.themealdb.com/images/media/meals/2wx8cm1763373419.jpg",
    "instructions": [
      "step 1",
      "Prepare the noodles following pack instructions, then drain and set aside. Combine all the ingredients for the sauce in a small bowl or jug, and set aside.",
      "step 2",
      "Heat the oil in a large wok or frying pan over a high heat and stir-fry the garlic and chilli for 20 seconds until just starting to turn golden. Add the steak and stir-fry for 1 minute until seared and starting to brown. Add the broccoli and stir-fry for another minute, then tip in the noodles and add the sauce. Stir-fry for another 1-2 mins until well combined and piping hot.",
      "step 3",
      "Stir through the basil and turn off the heat. Serve immediately to avoid overcooking."
    ],
    "ingredients": [
      {
        "name": "Flat Rice Noodles",
        "quantity": "200g"
      },
      {
        "name": "Vegetable Oil",
        "quantity": "2 tblsp"
      },
      {
        "name": "Garlic",
        "quantity": "3 cloves Chopped"
      },
      {
        "name": "Bird",
        "quantity": "3 chopped"
      },
      {
        "name": "Sirloin steak",
        "quantity": "225g"
      },
      {
        "name": "Broccoli",
        "quantity": "100g"
      },
      {
        "name": "Basil Leaves",
        "quantity": "Handful"
      },
      {
        "name": "Soy Sauce",
        "quantity": "4 tbsp"
      },
      {
        "name": "Oyster Sauce",
        "quantity": "4 tbsp"
      },
      {
        "name": "Fish Sauce",
        "quantity": "1 teaspoon"
      },
      {
        "name": "Sugar",
        "quantity": "1 tblsp"
      }
    ],
    "cuisineType": "thai",
    "mealType": "beef",
    "difficultyLevel": "medium",
    "prepTime": 30,
    "cookTime": 45,
    "servings": 4,
    "tags": []
  },
  {
    "name": "Spanish meatballs with clams, chorizo & squid",
    "description": "step 1\r\nMelt the butter in a heavy-based casserole, then soften the shallots for 5 mins. Add the pap...",
    "imageUrl": "https://www.themealdb.com/images/media/meals/2wt8721763334199.jpg",
    "instructions": [
      "step 1",
      "Melt the butter in a heavy-based casserole, then soften the shallots for 5 mins. Add the paprika and crushed garlic and cook for 1 min until the paprika becomes fragrant. Splash in the sherry, then pour the whole lot into a bowl with the breadcrumbs. Season and cool.",
      "step 2",
      "Add the pork mince and the egg yolk to the bowl, then beat well. Shape into 18 small meatballs. Wipe the pan, put on a medium-high heat, then add the oil. Fry the meatballs for 5 mins, just to colour, then lift onto a plate, but keep the oil in the pan. Sizzle the chorizo with the sliced garlic. Add the squid and fry to give a little colour. Now tip in the white wine and bring to the boil, scraping the bottom. Stir in the pulped tomatoes, bring to the boil, then add the meatballs and the clams. Cover and cook for 5 mins until the clam shells open. Discard any that stay shut. Sprinkle with the chopped parsley, drizzle with the extra virgin oil, then serve with crusty bread."
    ],
    "ingredients": [
      {
        "name": "Butter",
        "quantity": "25g"
      },
      {
        "name": "Shallots",
        "quantity": "3 diced"
      },
      {
        "name": "Smoked Paprika",
        "quantity": "1 teaspoon"
      },
      {
        "name": "Garlic",
        "quantity": "2 cloves minced"
      },
      {
        "name": "Garlic",
        "quantity": "1 clove finely chopped"
      },
      {
        "name": "Dry sherry",
        "quantity": "2 tblsp"
      },
      {
        "name": "Breadcrumbs",
        "quantity": "50g"
      },
      {
        "name": "Pork",
        "quantity": "300g"
      },
      {
        "name": "Egg Yolks",
        "quantity": "1"
      },
      {
        "name": "Olive Oil",
        "quantity": "50 ml"
      },
      {
        "name": "Chorizo",
        "quantity": "300g"
      },
      {
        "name": "Squid",
        "quantity": "300g"
      },
      {
        "name": "White Wine",
        "quantity": "100 ml"
      },
      {
        "name": "Tomato",
        "quantity": "300g"
      },
      {
        "name": "Clams",
        "quantity": "400g"
      },
      {
        "name": "Parsley",
        "quantity": "Handful"
      },
      {
        "name": "Extra Virgin Olive Oil",
        "quantity": "Drizzle"
      }
    ],
    "cuisineType": "spanish",
    "mealType": "miscellaneous",
    "difficultyLevel": "medium",
    "prepTime": 30,
    "cookTime": 45,
    "servings": 4,
    "tags": []
  },
  {
    "name": "Spiced smoky barbecued chicken",
    "description": "step 1\r\nMake the marinade. Smash the garlic with a little salt using a pestle and mortar. Add the le...",
    "imageUrl": "https://www.themealdb.com/images/media/meals/a08uqk1761848682.jpg",
    "instructions": [
      "step 1",
      "Make the marinade. Smash the garlic with a little salt using a pestle and mortar. Add the lemon zest and juice, the spice mix, chilli, oil and a good grinding of black pepper. Mix to a paste. This can be done in a mini food processor.",
      "step 2",
      "Toss the chicken in the marinade and set aside while you light the barbecue. When the barbecue’s hot, lay the bunches of herbs on the grid and put the chicken, skin side up, on top. Close the lid, if your barbecue has one, and cook the chicken on the smouldering herbs for about 10 minutes until the meat starts to colour. Turn the chicken and continue to cook for a further 20-30 minutes, turning as necessary, until it is slightly charred from the burnt herbs and cooked through to the bone."
    ],
    "ingredients": [
      {
        "name": "Garlic",
        "quantity": "2 cloves"
      },
      {
        "name": "Lemon",
        "quantity": "Juice/zest of one"
      },
      {
        "name": "Curry Powder",
        "quantity": "2 tblsp"
      },
      {
        "name": "Chilli Flakes",
        "quantity": "Pinch"
      },
      {
        "name": "Olive Oil",
        "quantity": "3  tablespoons"
      },
      {
        "name": "Chicken Thighs",
        "quantity": "12"
      },
      {
        "name": "Rosemary",
        "quantity": "Bunch"
      },
      {
        "name": "Rosemary",
        "quantity": "Bunch"
      },
      {
        "name": "Thyme",
        "quantity": "Bunch"
      },
      {
        "name": "Thyme",
        "quantity": "Bunch"
      },
      {
        "name": "Bay Leaves",
        "quantity": "2"
      }
    ],
    "cuisineType": "australian",
    "mealType": "chicken",
    "difficultyLevel": "medium",
    "prepTime": 30,
    "cookTime": 45,
    "servings": 4,
    "tags": []
  },
  {
    "name": "Bread omelette",
    "description": "Make and enjoy...",
    "imageUrl": "https://www.themealdb.com/images/media/meals/hqaejl1695738653.jpg",
    "instructions": [
      "Make and enjoy"
    ],
    "ingredients": [
      {
        "name": "Bread",
        "quantity": "2"
      },
      {
        "name": "Egg",
        "quantity": "2"
      },
      {
        "name": "Salt",
        "quantity": "0.5"
      }
    ],
    "cuisineType": "indian",
    "mealType": "breakfast",
    "difficultyLevel": "medium",
    "prepTime": 30,
    "cookTime": 45,
    "servings": 4,
    "tags": []
  },
  {
    "name": "Anzac biscuits",
    "description": "step 1\r\nHeat oven to 180C/fan 160C/gas 4. Put the oats, coconut, flour and sugar in a bowl. Melt the...",
    "imageUrl": "https://www.themealdb.com/images/media/meals/q47rkb1762324620.jpg",
    "instructions": [
      "step 1",
      "Heat oven to 180C/fan 160C/gas 4. Put the oats, coconut, flour and sugar in a bowl. Melt the butter in a small pan and stir in the golden syrup. Add the bicarbonate of soda to 2 tbsp boiling water, then stir into the golden syrup and butter mixture.",
      "step 2",
      "Make a well in the middle of the dry ingredients and pour in the butter and golden syrup mixture. Stir gently to incorporate the dry ingredients.",
      "step 3",
      "Put dessertspoonfuls of the mixture on to buttered baking sheets, about 2.5cm/1in apart to allow room for spreading. Bake in batches for 8-10 mins until golden. Transfer to a wire rack to cool."
    ],
    "ingredients": [
      {
        "name": "Porridge oats",
        "quantity": "85g"
      },
      {
        "name": "Desiccated Coconut",
        "quantity": "85g"
      },
      {
        "name": "Plain Flour",
        "quantity": "100g"
      },
      {
        "name": "Caster Sugar",
        "quantity": "100g"
      },
      {
        "name": "Butter",
        "quantity": "100g"
      },
      {
        "name": "Golden Syrup",
        "quantity": "1 tblsp"
      },
      {
        "name": "Bicarbonate Of Soda",
        "quantity": "1 teaspoon"
      }
    ],
    "cuisineType": "australian",
    "mealType": "dessert",
    "difficultyLevel": "medium",
    "prepTime": 30,
    "cookTime": 45,
    "servings": 4,
    "tags": []
  },
  {
    "name": "Prawn & Fennel Bisque",
    "description": "Shell the prawns, then fry the shells in the oil in a large pan for about 5 mins. Add the onion, fen...",
    "imageUrl": "https://www.themealdb.com/images/media/meals/rtwwvv1511799504.jpg",
    "instructions": [
      "Shell the prawns, then fry the shells in the oil in a large pan for about 5 mins. Add the onion, fennel and carrots and cook for about 10 mins until the veg start to soften. Pour in the wine and brandy, bubble hard for about 1 min to drive off the alcohol, then add the tomatoes, stock and paprika. Cover and simmer for 30 mins. Meanwhile, chop the prawns.",
      "Blitz the soup as finely as you can with a stick blender or food processor, then press through a sieve into a bowl. Spend a bit of time really working the mixture through the sieve as this will give the soup its velvety texture.",
      "Tip back into a clean pan, add the prawns and cook for 10 mins, then blitz again until smooth. You can make and chill this a day ahead or freeze it for 1 month. Thaw ovenight in the fridge. To serve, gently reheat in a pan with the cream. If garnishing, cook the 8 prawns in a little butter. Spoon into small bowls and top with the prawns and snipped fennel fronds."
    ],
    "ingredients": [
      {
        "name": "Tiger Prawns",
        "quantity": "450g"
      },
      {
        "name": "Olive Oil",
        "quantity": "4 tbs"
      },
      {
        "name": "Onion",
        "quantity": "1 large"
      },
      {
        "name": "Fennel",
        "quantity": "1 large"
      },
      {
        "name": "Carrots",
        "quantity": "2 chopped"
      },
      {
        "name": "Dry White Wine",
        "quantity": "150ml"
      },
      {
        "name": "Brandy",
        "quantity": "1 tbs"
      },
      {
        "name": "Chopped Tomatoes",
        "quantity": "400g"
      },
      {
        "name": "Fish Stock",
        "quantity": "1L"
      },
      {
        "name": "Paprika",
        "quantity": "2 pinches"
      },
      {
        "name": "Double Cream",
        "quantity": "150ml"
      },
      {
        "name": "Prawns",
        "quantity": "8"
      }
    ],
    "cuisineType": "french",
    "mealType": "side",
    "difficultyLevel": "medium",
    "prepTime": 30,
    "cookTime": 45,
    "servings": 4,
    "tags": [
      "soup",
      "warm",
      "seafood",
      "shellfish"
    ]
  },
  {
    "name": "Bread and Butter Pudding",
    "description": "Grease a 1 litre/2 pint pie dish with butter.\r\nCut the crusts off the bread. Spread each slice with ...",
    "imageUrl": "https://www.themealdb.com/images/media/meals/xqwwpy1483908697.jpg",
    "instructions": [
      "Grease a 1 litre/2 pint pie dish with butter.",
      "Cut the crusts off the bread. Spread each slice with on one side with butter, then cut into triangles.",
      "Arrange a layer of bread, buttered-side up, in the bottom of the dish, then add a layer of sultanas. Sprinkle with a little cinnamon, then repeat the layers of bread and sultanas, sprinkling with cinnamon, until you have used up all of the bread. Finish with a layer of bread, then set aside.",
      "Gently warm the milk and cream in a pan over a low heat to scalding point. Don't let it boil.",
      "Crack the eggs into a bowl, add three quarters of the sugar and lightly whisk until pale.",
      "Add the warm milk and cream mixture and stir well, then strain the custard into a bowl.",
      "Pour the custard over the prepared bread layers and sprinkle with nutmeg and the remaining sugar and leave to stand for 30 minutes.",
      "Preheat the oven to 180C/355F/Gas 4.",
      "Place the dish into the oven and bake for 30-40 minutes, or until the custard has set and the top is golden-brown."
    ],
    "ingredients": [
      {
        "name": "butter",
        "quantity": "25g/1oz"
      },
      {
        "name": "bread",
        "quantity": "8 thin slices"
      },
      {
        "name": "sultanas",
        "quantity": "50g/2oz"
      },
      {
        "name": "cinnamon",
        "quantity": "2 tsp"
      },
      {
        "name": "milk",
        "quantity": "350ml/12fl"
      },
      {
        "name": "double cream",
        "quantity": "50ml/2fl oz"
      },
      {
        "name": "eggs",
        "quantity": "2 free-range"
      },
      {
        "name": "sugar",
        "quantity": "25g/1oz"
      },
      {
        "name": "nutmeg",
        "quantity": "grated, to taste"
      }
    ],
    "cuisineType": "british",
    "mealType": "dessert",
    "difficultyLevel": "medium",
    "prepTime": 30,
    "cookTime": 45,
    "servings": 4,
    "tags": [
      "pudding",
      "brunch"
    ]
  },
  {
    "name": "Chocolate Raspberry Brownies",
    "description": "Heat oven to 180C/160C fan/gas 4. Line a 20 x 30cm baking tray tin with baking parchment. Put the ch...",
    "imageUrl": "https://www.themealdb.com/images/media/meals/yypvst1511386427.jpg",
    "instructions": [
      "Heat oven to 180C/160C fan/gas 4. Line a 20 x 30cm baking tray tin with baking parchment. Put the chocolate, butter and sugar in a pan and gently melt, stirring occasionally with a wooden spoon. Remove from the heat.",
      "Stir the eggs, one by one, into the melted chocolate mixture. Sieve over the flour and cocoa, and stir in. Stir in half the raspberries, scrape into the tray, then scatter over the remaining raspberries. Bake on the middle shelf for 30 mins or, if you prefer a firmer texture, for 5 mins more. Cool before slicing into squares. Store in an airtight container for up to 3 days."
    ],
    "ingredients": [
      {
        "name": "Dark Chocolate",
        "quantity": "200g"
      },
      {
        "name": "Milk Chocolate",
        "quantity": "100g"
      },
      {
        "name": "Salted Butter",
        "quantity": "250g"
      },
      {
        "name": "Light Brown Soft Sugar",
        "quantity": "400g"
      },
      {
        "name": "Eggs",
        "quantity": "4 large"
      },
      {
        "name": "Plain Flour",
        "quantity": "140g"
      },
      {
        "name": "Cocoa",
        "quantity": "50g"
      },
      {
        "name": "Raspberries",
        "quantity": "200g"
      }
    ],
    "cuisineType": "american",
    "mealType": "dessert",
    "difficultyLevel": "medium",
    "prepTime": 30,
    "cookTime": 45,
    "servings": 4,
    "tags": [
      "chocolate",
      "desert",
      "snack"
    ]
  },
  {
    "name": "Szechuan Beef",
    "description": "STEP 1 - MARINATING THE BEEF\r\nIn a bowl, add the beef, salt, sesame seed oil, white pepper, egg whit...",
    "imageUrl": "https://www.themealdb.com/images/media/meals/1529443236.jpg",
    "instructions": [
      "STEP 1 - MARINATING THE BEEF",
      "In a bowl, add the beef, salt, sesame seed oil, white pepper, egg white, 2 Tablespoon of corn starch and 1 Tablespoon of oil.",
      "STEP 2 - STIR FRY",
      "First Cook the beef by adding 2 Tablespoon of oil until the beef is golden brown.",
      "Set the beef aside",
      "In a wok add 1 Tablespoon of oil, minced ginger, minced garlic and stir-fry for few seconds.",
      "Next add all of the vegetables and then add sherry cooking wine and 1 cup of water.",
      "To make the sauce add oyster sauce, hot pepper sauce, and sugar.",
      "add the cooked beef and 1 spoon of soy sauce",
      "To thicken the sauce, whisk together 1 Tablespoon of cornstarch and 2 Tablespoon of water in a bowl and slowly add to your stir-fry until it's the right thickness."
    ],
    "ingredients": [
      {
        "name": "Beef",
        "quantity": "1/2 lb"
      },
      {
        "name": "Salt",
        "quantity": "1/2 tsp"
      },
      {
        "name": "Sesame Seed Oil",
        "quantity": "1 tsp"
      },
      {
        "name": "Pepper",
        "quantity": "1 pinch"
      },
      {
        "name": "Egg White",
        "quantity": "1"
      },
      {
        "name": "Starch",
        "quantity": "3 tbs"
      },
      {
        "name": "Oil",
        "quantity": "4 tbs"
      },
      {
        "name": "Ginger",
        "quantity": "1 tsp"
      },
      {
        "name": "Garlic",
        "quantity": "1 tsp"
      },
      {
        "name": "Onion",
        "quantity": "3/4 cup"
      },
      {
        "name": "Carrots",
        "quantity": "1/2 cup"
      },
      {
        "name": "Green Pepper",
        "quantity": "3/4 cup"
      },
      {
        "name": "Celery",
        "quantity": "1 cup"
      },
      {
        "name": "Mushrooms",
        "quantity": "1 cup"
      },
      {
        "name": "Cooking wine",
        "quantity": "1 tbs"
      },
      {
        "name": "Water",
        "quantity": "1 cup"
      },
      {
        "name": "Oyster Sauce",
        "quantity": "1 tbs"
      },
      {
        "name": "Hotsauce",
        "quantity": "1/2 tsp"
      },
      {
        "name": "Sugar",
        "quantity": "1 tsp"
      },
      {
        "name": "Soy Sauce",
        "quantity": "1 tbs"
      }
    ],
    "cuisineType": "chinese",
    "mealType": "beef",
    "difficultyLevel": "medium",
    "prepTime": 30,
    "cookTime": 45,
    "servings": 4,
    "tags": []
  },
  {
    "name": "Egyptian Fatteh",
    "description": "To prepare bread for bottom of dish: Take pita bread and rip into bite size pieces. In a frying pan,...",
    "imageUrl": "https://www.themealdb.com/images/media/meals/rlwcc51598734603.jpg",
    "instructions": [
      "To prepare bread for bottom of dish: Take pita bread and rip into bite size pieces. In a frying pan, add about a 1/4 stick of butter, add bread pieces and fry until golden brown and crisp. Put these pieces in a glass baking dish, preferably a square sized dish. Set aside.",
      "Then add to same pan, a little more butter, salt, approximately 2 cloves of crushed fresh garlic, and a teaspoon or so of cumin stir around a bit until you can smell aroma, then add fried bread pieces to this mixture, stir to coat bread and put back into glass baking dish. Set aside.",
      "To prepare meat: put some butter in a pot, stir fry meat until brown, add 1 onion quartered, salt & pepper, 1 cube of chicken bouillon and water to cover meat. Bring to a boil, turn down to simmer, cover and cook until tender, approximately 2 hours. After meat has cooled, take out chunks of meat and put in a bowl, set aside. Reserve soup from the meat separately.",
      "To prepare the rice: Put some butter into a pot, add shareya (fideo noodles) like a handful or so, keep stirring until golden brown, not too dark, but very golden. Then add two cups of rice, stir a little bit until some of the rice turns an opaque white. Add 2-1/4 cups of water and salt to taste. Bring to a boil, cover and turn down to simmer, cook until tender. Test the rice tenderness after about 35 minutes.",
      "Now take some of the soup from meat and add to the top of the bread pieces in baking dish to saturate.Add cooked rice on top of bread pieces. Slowly spoon remainder of soup onto rice, looking at glass dish sides to see level of soup, should reach just to top of rice, don’t worry, this doesn’t have to be exact. Now you’re ready to make the sauce and fry the meat to put on top.",
      "To prepare red sauce: In a pan, add a little oil or butter, crushed tomato, a half teaspoon of tomato paste, salt & pepper, 2 cloves of fresh crushed garlic and cumin. Add also approximately 3 tablespoons of vinegar, stir this until you smell aroma and it is a bit smooth. It should be a bit thick, not watery, but if too thick you can add a bit of water. Spread with a wooden spoon atop the rice to cover.",
      "To fry meat: In a pan add a bit of butter or oil, the meat, just a touch of tomato paste, about a tablespoon of fresh crushed garlic, salt & pepper, a teaspoon of cumin. Cook until meat is golden fried.",
      "Spoon this atop the rice and serve. Enjoy!"
    ],
    "ingredients": [
      {
        "name": "Beef",
        "quantity": "1lb"
      },
      {
        "name": "Onion",
        "quantity": "1"
      },
      {
        "name": "Chicken Stock Cube",
        "quantity": "1"
      },
      {
        "name": "Tomatoes",
        "quantity": "2"
      },
      {
        "name": "Garlic Clove",
        "quantity": "4"
      },
      {
        "name": "Tomato Puree",
        "quantity": "1 tbs"
      },
      {
        "name": "Rice",
        "quantity": "2 cups"
      },
      {
        "name": "Noodles",
        "quantity": "1/4 cup"
      },
      {
        "name": "Butter",
        "quantity": "1/4 cup"
      },
      {
        "name": "Olive Oil",
        "quantity": "2 cups"
      },
      {
        "name": "Pita Bread",
        "quantity": "1"
      },
      {
        "name": "Cumin",
        "quantity": "1 tbs"
      },
      {
        "name": "White Wine Vinegar",
        "quantity": "3 tbs"
      },
      {
        "name": "Salt",
        "quantity": "To taste"
      },
      {
        "name": "Pepper",
        "quantity": "To taste"
      }
    ],
    "cuisineType": "egyptian",
    "mealType": "beef",
    "difficultyLevel": "medium",
    "prepTime": 30,
    "cookTime": 45,
    "servings": 4,
    "tags": []
  },
  {
    "name": "Fresh sardines",
    "description": "Wash the fish under the cold tap. Roll in the flour and deep fry in oil until crispy. Lay on kitchen...",
    "imageUrl": "https://www.themealdb.com/images/media/meals/nv5lf31628771380.jpg",
    "instructions": [
      "Wash the fish under the cold tap. Roll in the flour and deep fry in oil until crispy. Lay on kitchen towel to get rid of the excess oil and serve hot or cold with a slice of lemon."
    ],
    "ingredients": [
      {
        "name": "Sardines",
        "quantity": "500g"
      },
      {
        "name": "Vegetable Oil",
        "quantity": "Dash"
      },
      {
        "name": "Flour",
        "quantity": "To Glaze"
      },
      {
        "name": "Salt",
        "quantity": "Dash"
      }
    ],
    "cuisineType": "croatian",
    "mealType": "side",
    "difficultyLevel": "medium",
    "prepTime": 30,
    "cookTime": 45,
    "servings": 4,
    "tags": [
      "fresh"
    ]
  },
  {
    "name": "Strawberries Romanoff",
    "description": "In a medium bowl, combine hulled and quartered strawberries, 4 Tbsp sugar and 4 Tbsp liqueur, stir t...",
    "imageUrl": "https://www.themealdb.com/images/media/meals/oe8rg51699014028.jpg",
    "instructions": [
      "In a medium bowl, combine hulled and quartered strawberries, 4 Tbsp sugar and 4 Tbsp liqueur, stir to combine then cover and refrigerate at least 1 hour and up to 2 hours, stirring once or twice.",
      "Two photos of cut strawberries in a bowl with one having sugar being added to the bowl Two photos of cut up strawberries for Strawberry Romanoff ",
      "Just before serving, in a large mixing bowl, combine 1 cup cold heavy cream and 1/4 cup powdered sugar, and beat with an electric mixer until stiff peaks form. Using a spatula, fold in 1/4 cup sour cream just until well blended.",
      "To serve, stir strawberries then divide between 6 serving glasses or bowls. You can spoon a little syrup over the berries if you like. You can also use this syrup to soak a cake. Spoon cream over strawberries, dividing evenly. You can also use an ice cream scoop with trigger release for a nice rounded puff of cream. Serve right away or chill and enjoy within 2 hours of assembly."
    ],
    "ingredients": [
      {
        "name": "Strawberries",
        "quantity": "2 pint"
      },
      {
        "name": "Sugar",
        "quantity": "4 tbs"
      },
      {
        "name": "Grand Marnier",
        "quantity": "4 tbs"
      },
      {
        "name": "Cream",
        "quantity": "1 cup"
      },
      {
        "name": "Sour Cream",
        "quantity": "1/4 cup"
      }
    ],
    "cuisineType": "russian",
    "mealType": "dessert",
    "difficultyLevel": "medium",
    "prepTime": 30,
    "cookTime": 45,
    "servings": 4,
    "tags": [
      "fruity"
    ]
  },
  {
    "name": "Canadian Butter Tarts",
    "description": "Preheat the oven to fan 170C/ conventional 190C/gas 5. Roll out the pastry on a lightly floured surf...",
    "imageUrl": "https://www.themealdb.com/images/media/meals/wpputp1511812960.jpg",
    "instructions": [
      "Preheat the oven to fan 170C/ conventional 190C/gas 5. Roll out the pastry on a lightly floured surface so it’s slightly thinner than straight from the pack. Then cut out 18-20 rounds with a 7.5cm fluted cutter, re-rolling the trimmings. Use the rounds to line two deep 12-hole tart tins (not muffin tins). If you only have a regular-sized, 12-hole tart tin you will be able to make a few more slightly shallower tarts.",
      "Beat the eggs in a large bowl and combine with the rest of the ingredients except the walnuts. Tip this mixture into a pan and stir continuously for 3-4 minutes until the butter melts, and the mixture bubbles and starts to thicken. It should be thick enough to coat the back of a wooden spoon. Don’t overcook, and be sure to stir all the time as the mixture can easily burn. Remove from the heat and stir in the nuts.",
      "Spoon the filling into the unbaked tart shells so it’s level with the pastry. Bake for 15-18 minutes until set and pale golden. Leave in the tin to cool for a few minutes before lifting out on to a wire rack. Serve warm or cold."
    ],
    "ingredients": [
      {
        "name": "Shortcrust Pastry",
        "quantity": "375g"
      },
      {
        "name": "Eggs",
        "quantity": "2 large"
      },
      {
        "name": "Muscovado Sugar",
        "quantity": "175g"
      },
      {
        "name": "Raisins",
        "quantity": "100g"
      },
      {
        "name": "Vanilla Extract",
        "quantity": "1 tsp"
      },
      {
        "name": "Butter",
        "quantity": "50g"
      },
      {
        "name": "Single Cream",
        "quantity": "4 tsp"
      },
      {
        "name": "Walnuts",
        "quantity": "50g"
      }
    ],
    "cuisineType": "canadian",
    "mealType": "dessert",
    "difficultyLevel": "medium",
    "prepTime": 30,
    "cookTime": 45,
    "servings": 4,
    "tags": [
      "speciality",
      "snack",
      "desert",
      "pudding"
    ]
  },
  {
    "name": "Bitterballen (Dutch meatballs)",
    "description": "Melt the butter in a skillet or pan. When melted, add the flour little by little and stir into a thi...",
    "imageUrl": "https://www.themealdb.com/images/media/meals/lhqev81565090111.jpg",
    "instructions": [
      "Melt the butter in a skillet or pan. When melted, add the flour little by little and stir into a thick paste. Slowly stir in the stock, making sure the roux absorbs the liquid. Simmer for a couple of minutes on a low heat while you stir in the onion, parsley and the shredded meat. The mixture should thicken and turn into a heavy, thick sauce.",
      "Pour the mixture into a shallow container, cover and refrigerate for several hours, or until the sauce has solidified.",
      "Take a heaping tablespoon of the cold, thick sauce and quickly roll it into a small ball. Roll lightly through the flour, then the egg and finally the breadcrumbs. Make sure that the egg covers the whole surface of the bitterbal. When done, refrigerate the snacks while the oil in your fryer heats up to 190C (375F). Fry four bitterballen at a time, until golden.",
      "Serve on a plate with a nice grainy or spicy mustard. "
    ],
    "ingredients": [
      {
        "name": "Butter",
        "quantity": "100g"
      },
      {
        "name": "Flour",
        "quantity": "150g"
      },
      {
        "name": "Beef Stock",
        "quantity": "700ml"
      },
      {
        "name": "Onion",
        "quantity": "30g"
      },
      {
        "name": "Parsley",
        "quantity": "1 tbs"
      },
      {
        "name": "Beef",
        "quantity": "400g"
      },
      {
        "name": "Salt",
        "quantity": "Pinch"
      },
      {
        "name": "Pepper",
        "quantity": "Pinch"
      },
      {
        "name": "Nutmeg",
        "quantity": "Pinch"
      },
      {
        "name": "Flour",
        "quantity": "50g"
      },
      {
        "name": "Eggs",
        "quantity": "2 Beaten"
      },
      {
        "name": "Breadcrumbs",
        "quantity": "50g"
      }
    ],
    "cuisineType": "dutch",
    "mealType": "beef",
    "difficultyLevel": "medium",
    "prepTime": 30,
    "cookTime": 45,
    "servings": 4,
    "tags": [
      "dinnerparty",
      "hangoverfood",
      "alcoholic"
    ]
  },
  {
    "name": "Ajo blanco",
    "description": "step 1\r\nTip the bread into a bowl and pour over 350ml water. Leave to soak for 10 mins.\r\n\r\nstep 2\r\nB...",
    "imageUrl": "https://www.themealdb.com/images/media/meals/5jdtie1763289302.jpg",
    "instructions": [
      "step 1",
      "Tip the bread into a bowl and pour over 350ml water. Leave to soak for 10 mins.",
      "step 2",
      "Blend the ingredients together with 350ml water and 1 tsp salt.",
      "step 3",
      "Let the soup cool in the fridge for 1 hr or so, then serve with a drizzle of oil and some black pepper."
    ],
    "ingredients": [
      {
        "name": "White bread",
        "quantity": "150g"
      },
      {
        "name": "Almonds",
        "quantity": "200g"
      },
      {
        "name": "Extra Virgin Olive Oil",
        "quantity": "50 ml"
      },
      {
        "name": "Garlic Clove",
        "quantity": "1"
      },
      {
        "name": "Red Wine Vinegar",
        "quantity": "1 ½ tbsp"
      }
    ],
    "cuisineType": "spanish",
    "mealType": "starter",
    "difficultyLevel": "medium",
    "prepTime": 30,
    "cookTime": 45,
    "servings": 4,
    "tags": []
  },
  {
    "name": "Suksessterte (Norwegian almond “success cake”)",
    "description": "Almond base\r\n▢\r\nPreheat oven to 345°F (175°C) and grease cake form (I use a 27 cm spring form) – you...",
    "imageUrl": "https://www.themealdb.com/images/media/meals/de83k51763075604.jpg",
    "instructions": [
      "Almond base",
      "▢",
      "Preheat oven to 345°F (175°C) and grease cake form (I use a 27 cm spring form) – you can line the bottom with baking paper if you like.",
      "▢",
      "Grind almonds in an almond grinder or food processor. I like to keep them a bit coarse.",
      "▢",
      "Gently whisk the eggs and sugar together until combined (no longer). Stir in the ground almonds, flour, and baking powder.",
      "▢",
      "Pour batter into cake form and bake for about 45 – 50 minutes, monitoring to make sure the top doesn't burn.",
      "Yellow egg cream",
      "▢",
      "Add egg yolks, heavy cream, sugar, and vanilla to a saucepan. Heat over low/medium heat while stirring constantly until the mixture thickens – about 15 minutes. Turn up the heat if the mixture doesn't thicken, but be careful not to boil.",
      "▢",
      "Let the mixture cool to room temperature and then add the butter. You can use an electric mixer for a fluffy egg cream.",
      "Assembly",
      "▢",
      "Wait for the cake to cool completely before removing from form and frosting."
    ],
    "ingredients": [
      {
        "name": "Almonds",
        "quantity": "2 cups"
      },
      {
        "name": "Egg",
        "quantity": "3"
      },
      {
        "name": "Granulated Sugar",
        "quantity": "1 1/4 cup"
      },
      {
        "name": "Flour",
        "quantity": "2 tblsp"
      },
      {
        "name": "Baking Powder",
        "quantity": "1 teaspoon"
      },
      {
        "name": "Egg Yolks",
        "quantity": "5"
      },
      {
        "name": "Heavy Cream",
        "quantity": "1/2 cup"
      },
      {
        "name": "Granulated Sugar",
        "quantity": "1/3 cup"
      },
      {
        "name": "Vanilla Extract",
        "quantity": "1 teaspoon"
      },
      {
        "name": "Butter",
        "quantity": "100g"
      }
    ],
    "cuisineType": "norwegian",
    "mealType": "dessert",
    "difficultyLevel": "medium",
    "prepTime": 30,
    "cookTime": 45,
    "servings": 4,
    "tags": []
  },
  {
    "name": "Karbonader (Lean Beef Patties) with Caramelized Onions",
    "description": "Grate half an onion and set aside. Slice the rest of the onions and fry in butter on low/medium heat...",
    "imageUrl": "https://www.themealdb.com/images/media/meals/0bpjb11763075817.jpg",
    "instructions": [
      "Grate half an onion and set aside. Slice the rest of the onions and fry in butter on low/medium heat until caramelized.",
      "▢",
      "In a bowl, mix together ground beef, grated onion, salt, pepper, nutmeg, potato/corn starch, and water.",
      "▢",
      "Form into a sausage and cut 6 patties. Using a knife make a light grid pattern in each patty.",
      "▢",
      "Brown both sides of the karbonader in butter on high heat, then turn down to low heat and fry for another 2 – 3 minutes.",
      "▢",
      "Serve the karbonader and onions with potatoes, stewed peas, and brown sauce for dinner, or on a slice of bread for lunch or a snack."
    ],
    "ingredients": [
      {
        "name": "Onion",
        "quantity": "2"
      },
      {
        "name": "Butter",
        "quantity": "1 tablespoon"
      },
      {
        "name": "Ground Beef",
        "quantity": "1 lb"
      },
      {
        "name": "Salt",
        "quantity": "1/2 teaspoon"
      },
      {
        "name": "Pepper",
        "quantity": "1/2 teaspoon"
      },
      {
        "name": "Nutmeg",
        "quantity": "1/2 teaspoon"
      },
      {
        "name": "Cornstarch",
        "quantity": "1/2 tbs"
      },
      {
        "name": "Water",
        "quantity": "50 ml"
      },
      {
        "name": "Butter",
        "quantity": "2 tblsp"
      }
    ],
    "cuisineType": "norwegian",
    "mealType": "beef",
    "difficultyLevel": "medium",
    "prepTime": 30,
    "cookTime": 45,
    "servings": 4,
    "tags": []
  },
  {
    "name": "Croatian Bean Stew",
    "description": "Heat the oil in a pan. Add the chopped vegetables and sauté until tender. Take a pot, empty the bean...",
    "imageUrl": "https://www.themealdb.com/images/media/meals/tnwy8m1628770384.jpg",
    "instructions": [
      "Heat the oil in a pan. Add the chopped vegetables and sauté until tender. Take a pot, empty the beans together with the vegetables into it, put the sausages inside and cook for further 20 minutes on a low heat. Or, put it in an oven and bake it at a temperature of 180ºC/350ºF for 30 minutes. This dish is even better reheated the next day."
    ],
    "ingredients": [
      {
        "name": "Cannellini Beans",
        "quantity": "2 cans"
      },
      {
        "name": "Vegetable Oil",
        "quantity": "3 tbs"
      },
      {
        "name": "Tomatoes",
        "quantity": "2 cups"
      },
      {
        "name": "Challots",
        "quantity": "5"
      },
      {
        "name": "Garlic",
        "quantity": "2 cloves"
      },
      {
        "name": "Parsley",
        "quantity": "Pinch"
      },
      {
        "name": "Chorizo",
        "quantity": "1/2 kg chopped"
      }
    ],
    "cuisineType": "croatian",
    "mealType": "beef",
    "difficultyLevel": "medium",
    "prepTime": 30,
    "cookTime": 45,
    "servings": 4,
    "tags": [
      "warming",
      "soup",
      "beans"
    ]
  },
  {
    "name": "French Omelette",
    "description": "Get everything ready. Warm a 20cm (measured across the top) non-stick frying pan on a medium heat. C...",
    "imageUrl": "https://www.themealdb.com/images/media/meals/yvpuuy1511797244.jpg",
    "instructions": [
      "Get everything ready. Warm a 20cm (measured across the top) non-stick frying pan on a medium heat. Crack the eggs into a bowl and beat them with a fork so they break up and mix, but not as completely as you would for scrambled egg. With the heat on medium-hot, drop one knob of butter into the pan. It should bubble and sizzle, but not brown. Season the eggs with the Parmesan and a little salt and pepper, and pour into the pan.",
      "Let the eggs bubble slightly for a couple of seconds, then take a wooden fork or spatula and gently draw the mixture in from the sides of the pan a few times, so it gathers in folds in the centre. Leave for a few seconds, then stir again to lightly combine uncooked egg with cooked. Leave briefly again, and when partly cooked, stir a bit faster, stopping while there’s some barely cooked egg left. With the pan flat on the heat, shake it back and forth a few times to settle the mixture. It should slide easily in the pan and look soft and moist on top. A quick burst of heat will brown the underside.",
      "Grip the handle underneath. Tilt the pan down away from you and let the omelette fall to the edge. Fold the side nearest to you over by a third with your fork, and keep it rolling over, so the omelette tips onto a plate – or fold it in half, if that’s easier. For a neat finish, cover the omelette with a piece of kitchen paper and plump it up a bit with your fingers. Rub the other knob of butter over to glaze. Serve immediately."
    ],
    "ingredients": [
      {
        "name": "Eggs",
        "quantity": "3"
      },
      {
        "name": "Butter",
        "quantity": "2 knobs"
      },
      {
        "name": "Parmesan",
        "quantity": "1 tsp"
      },
      {
        "name": "Tarragon Leaves",
        "quantity": "3 chopped"
      },
      {
        "name": "Parsley",
        "quantity": "1 tbs chopped"
      },
      {
        "name": "Chives",
        "quantity": "1 tbs chopped"
      },
      {
        "name": "Gruyère",
        "quantity": "4 tbs"
      }
    ],
    "cuisineType": "french",
    "mealType": "miscellaneous",
    "difficultyLevel": "medium",
    "prepTime": 30,
    "cookTime": 45,
    "servings": 4,
    "tags": [
      "egg"
    ]
  },
  {
    "name": "Polskie Nalesniki (Polish Pancakes)",
    "description": "Add flour, eggs, milk, water, and salt in a large bowl then mix with a hand mixer until you have a s...",
    "imageUrl": "https://www.themealdb.com/images/media/meals/58bkyo1593350017.jpg",
    "instructions": [
      "Add flour, eggs, milk, water, and salt in a large bowl then mix with a hand mixer until you have a smooth, lump-free batter.",
      "At this point, mix in the butter or the vegetable oil. Alternatively, you can use them to grease the pan before frying each pancake.",
      "Heat a non-stick pan over medium heat, then pour in the batter, swirling the pan to help it spread.",
      "When the pancake starts pulling away a bit from the sides, and the top is no longer wet, flip it and cook shortly on the other side as well.",
      "Transfer to a plate. Cook the remaining batter until all used up.",
      "Serve warm, with the filling of your choice."
    ],
    "ingredients": [
      {
        "name": "Flour",
        "quantity": "1 cup"
      },
      {
        "name": "Eggs",
        "quantity": "2"
      },
      {
        "name": "Milk",
        "quantity": "1 cup"
      },
      {
        "name": "Water",
        "quantity": "3/4 cup"
      },
      {
        "name": "Salt",
        "quantity": "Pinch"
      },
      {
        "name": "Sugar",
        "quantity": "1 tsp"
      },
      {
        "name": "Butter",
        "quantity": "3 tbs"
      }
    ],
    "cuisineType": "polish",
    "mealType": "dessert",
    "difficultyLevel": "medium",
    "prepTime": 30,
    "cookTime": 45,
    "servings": 4,
    "tags": []
  },
  {
    "name": "Shrimp Chow Fun",
    "description": "STEP 1 - SOAK THE RICE NOODLES\r\nSoak the rice noodles overnight untill they are soft\r\nSTEP 2 - BOIL ...",
    "imageUrl": "https://www.themealdb.com/images/media/meals/1529445434.jpg",
    "instructions": [
      "STEP 1 - SOAK THE RICE NOODLES",
      "Soak the rice noodles overnight untill they are soft",
      "STEP 2 - BOIL THE RICE NOODLES",
      "Boil the noodles for 10-15 minutes and then rinse with cold water to stop the cooking process of the noodles.",
      "STEP 3 -MARINATING THE SHRIMP",
      "In a bowl add the shrimp, egg, 1 pinch of white pepper, 1 Teaspoon of sesame seed oil, 1 Tablespoon corn starch and 1 tablespoon of oil",
      "Mix together well",
      "STEP 4 - STIR FRY",
      "In a wok add 2 Tablespoons of oil, shrimp and stir fry them until it is golden brown",
      "Set the shrimp aside",
      "Add 1 Tablespoon of oil to the work and then add minced garlic, ginger and all of the vegetables.",
      "Add the noodles to the wok",
      "Next add sherry cooking wine, oyster sauce, sugar, vinegar, sesame seed oil, 1 pinch white pepper, and soy sauce",
      "Add back in the shrimp",
      "To thicken the sauce, whisk together 1 Tablespoon of corn starch and 2 Tablespoon of water in a bowl and slowly add to your stir-fry until it's the right thickness."
    ],
    "ingredients": [
      {
        "name": "Rice Stick Noodles",
        "quantity": "1/2 bag"
      },
      {
        "name": "Prawns",
        "quantity": "8 oz"
      },
      {
        "name": "Egg",
        "quantity": "1/2"
      },
      {
        "name": "Pepper",
        "quantity": "pinch"
      },
      {
        "name": "Sesame Seed Oil",
        "quantity": "2 tsp"
      },
      {
        "name": "Cornstarch",
        "quantity": "2 tbs"
      },
      {
        "name": "Oil",
        "quantity": "4 tbs"
      },
      {
        "name": "Minced Garlic",
        "quantity": "1 tsp"
      },
      {
        "name": "Ginger",
        "quantity": "1 tsp"
      },
      {
        "name": "Onion",
        "quantity": "1/2 cup"
      },
      {
        "name": "Bean Sprouts",
        "quantity": "1 cup"
      },
      {
        "name": "Spring Onions",
        "quantity": "1/2 cup"
      },
      {
        "name": "Cooking wine",
        "quantity": "1 tbs"
      },
      {
        "name": "Oyster Sauce",
        "quantity": "1 tbs"
      },
      {
        "name": "Sugar",
        "quantity": "1/2 tbs"
      },
      {
        "name": "Vinegar",
        "quantity": "1/2 tbs"
      },
      {
        "name": "Soy Sauce",
        "quantity": "1 tbs"
      }
    ],
    "cuisineType": "chinese",
    "mealType": "seafood",
    "difficultyLevel": "medium",
    "prepTime": 30,
    "cookTime": 45,
    "servings": 4,
    "tags": []
  },
  {
    "name": "Budino Di Ricotta",
    "description": "Mash the ricotta and beat well with the egg yolks, stir in the flour, sugar, cinnamon, grated lemon ...",
    "imageUrl": "https://www.themealdb.com/images/media/meals/1549542877.jpg",
    "instructions": [
      "Mash the ricotta and beat well with the egg yolks, stir in the flour, sugar, cinnamon, grated lemon rind and the rum and mix well. You can do this in a food processor. Beat the egg whites until stiff, fold in and pour into a buttered and floured 25cm cake tin. Bake in the oven at 180ºC/160ºC fan/gas 4 for about 40 minutes, or until it is firm.",
      "Serve hot or cold dusted with icing sugar."
    ],
    "ingredients": [
      {
        "name": "Ricotta",
        "quantity": "500g"
      },
      {
        "name": "Eggs",
        "quantity": "4 large"
      },
      {
        "name": "Flour",
        "quantity": "3 tbs"
      },
      {
        "name": "Sugar",
        "quantity": "250g"
      },
      {
        "name": "Cinnamon",
        "quantity": "1 tsp"
      },
      {
        "name": "Lemons",
        "quantity": "Grated Zest of 2"
      },
      {
        "name": "Dark Rum",
        "quantity": "5 tbs"
      },
      {
        "name": "Icing Sugar",
        "quantity": "sprinking"
      }
    ],
    "cuisineType": "italian",
    "mealType": "dessert",
    "difficultyLevel": "medium",
    "prepTime": 30,
    "cookTime": 45,
    "servings": 4,
    "tags": [
      "cake",
      "baking",
      "desert",
      "sweet",
      "alcoholic",
      "calorific"
    ]
  },
  {
    "name": "Classic Christmas pudding",
    "description": "Get everything for the pudding prepared. Chop the almonds coarsely. Peel, core and chop the cooking ...",
    "imageUrl": "https://www.themealdb.com/images/media/meals/1d85821576790598.jpg",
    "instructions": [
      "Get everything for the pudding prepared. Chop the almonds coarsely. Peel, core and chop the cooking apples. Sharpen your knife and chop the candied peel. (You can chop the almonds and apples in a food processor, but the peel must be done by hand.) Grate three quarters of the nutmeg (sounds a lot but it's correct).",
      "Mix the almonds, apples, candied peel, nutmeg, raisins, flour, breadcrumbs, light muscovado sugar, eggs and 2 tbsp brandy or cognac in a large bowl. ",
      "Holding the butter in its wrapper, grate a quarter of it into the bowl, then stir everything together. Repeat until all the butter is grated, then stir for 3-4 mins – the mixture is ready when it subsides slightly after each stir. Ask the family to stir too, and get everyone to make a wish. ",
      "Generously butter two 1.2 litre bowls and put a circle of baking parchment in the bottom of each. Pack in the pudding mixture. Cover with a double layer of baking parchment, pleating it to allow for expansion, then tie with string (keep the paper in place with a rubber band while tying). Trim off any excess paper. ",
      "Now stand each bowl on a large sheet of foil and bring the edges up over the top, then put another sheet of foil over the top and bring it down underneath to make a double package (this makes the puddings watertight). Tie with more string, and make a handle for easy lifting in and out of the pan. Watch our video to see how to tie up a pudding correctly.",
      "Boil or oven steam the puddings for 8 hrs, topping up with water as necessary. Remove from the pans and leave to cool overnight. When cold, discard the messy wrappings and re-wrap in new baking parchment, foil and string. Store in a cool, dry place until Christmas. ",
      "To make the brandy butter, cream the butter with the orange zest and icing sugar. Gradually beat in the brandy or cognac and chopped stem ginger. Put in a small bowl, fork the top attractively and put in the fridge to set. The butter will keep for a week in the fridge, or it can be frozen for up to six weeks. ",
      "On Christmas Day, boil or oven steam for 1 hr. Unwrap and turn out. To flame, warm 3-4 tbsp brandy in a small pan, pour it over the pudding and set light to it."
    ],
    "ingredients": [
      {
        "name": "Almonds",
        "quantity": "50g"
      },
      {
        "name": "Bramley Apples",
        "quantity": "2 large"
      },
      {
        "name": "Candied Peel",
        "quantity": "200g"
      },
      {
        "name": "Nutmeg",
        "quantity": "1 whole"
      },
      {
        "name": "Raisins",
        "quantity": "1kg"
      },
      {
        "name": "Plain Flour",
        "quantity": "140g"
      },
      {
        "name": "Breadcrumbs",
        "quantity": "100g"
      },
      {
        "name": "Muscovado Sugar",
        "quantity": "100g"
      },
      {
        "name": "Eggs",
        "quantity": "3 Large"
      },
      {
        "name": "Brandy",
        "quantity": "2 tbs"
      },
      {
        "name": "Butter",
        "quantity": "250g"
      }
    ],
    "cuisineType": "british",
    "mealType": "dessert",
    "difficultyLevel": "medium",
    "prepTime": 30,
    "cookTime": 45,
    "servings": 4,
    "tags": [
      "christmas"
    ]
  },
  {
    "name": "Spanish tomato bread with jamón Serrano",
    "description": "step 1\r\nMix together the chopped tomatoes, garlic clove, olive oil, salt and pepper. Keep in the fri...",
    "imageUrl": "https://www.themealdb.com/images/media/meals/hsp1fo1763327867.jpg",
    "instructions": [
      "step 1",
      "Mix together the chopped tomatoes, garlic clove, olive oil, salt and pepper. Keep in the fridge until needed.",
      "step 2",
      "To serve, toast 20 slices of baguette. Spoon a little tomato topping on to each piece of toast. Tear 5-6 slices of jamón Serrano into pieces and put one piece on each slice of bread."
    ],
    "ingredients": [
      {
        "name": "Tomato",
        "quantity": "4 Chopped"
      },
      {
        "name": "Garlic",
        "quantity": "1 clove finely chopped"
      },
      {
        "name": "Olive Oil",
        "quantity": "3  tablespoons"
      },
      {
        "name": "Salt",
        "quantity": "Pinch"
      },
      {
        "name": "Pepper",
        "quantity": "Pinch"
      },
      {
        "name": "Baguette",
        "quantity": "20 slices"
      },
      {
        "name": "Serrano Ham",
        "quantity": "5 Slices"
      }
    ],
    "cuisineType": "spanish",
    "mealType": "pork",
    "difficultyLevel": "medium",
    "prepTime": 30,
    "cookTime": 45,
    "servings": 4,
    "tags": []
  },
  {
    "name": "Lamb Biryani",
    "description": "Grind the cashew, poppy seeds and cumin seeds into a smooth paste, using as little water as possible...",
    "imageUrl": "https://www.themealdb.com/images/media/meals/xrttsx1487339558.jpg",
    "instructions": [
      "Grind the cashew, poppy seeds and cumin seeds into a smooth paste, using as little water as possible. Set aside. ",
      "Deep fry the sliced onions when it is hot. Don’t overcrowd the oil. When the onions turn light brown, remove from oil and drain on paper towel. The fried onion will crisp up as it drains. Also fry the cashewnuts till golden brown. Set aside.",
      "Wash the rice and soak in water for twenty minutes.",
      "Meanwhile, take a big wide pan, add oil in medium heat, add the sliced onions, add the blended paste, to it add the green chillies, ginger garlic paste and garlic and fry for a minute.",
      "Then add the tomatoes and sauté them well till they are cooked and not mushy.",
      "Then to it add the red chilli powder, biryani powder, mint, coriander leaves and sauté them well.",
      "Add the yogurt and mix well. I always move the skillet away from the heat when adding yogurt which prevents it from curdling.",
      "Now after returning the skillet back to the stove, add the washed lamb and salt and ½ cup water and mix well. Cook for 1 hour and cook it covered in medium low heat or put it in a pressure cooker for 6 whistles. If the water is not drained totally, heat it by keeping it open.",
      "Take another big pan, add thrice the cup of rice you use, and boil it. When it is boiling high, add the rice, salt and jeera and mix well. After 7 minutes exact or when the rice is 80% done. Switch off and drain the rice.",
      "Now, the layering starts. To the lamb, pat and level it. Add the drained hot rice on the top of it. Garnish with fried onions, ghee, mint, coriander leaves and saffron dissolved in milk.",
      "Cover the dish and bake in a 350f oven for 15 minutes or till the cooked but not mushy. Or cook in the stove medium heat for 12 minutes and lowest heat for 5 minutes. And switch off. Mix and serve hot!",
      "Notes",
      "1. If you are cooking in oven, do make sure to cook in a big oven safe pan and cover it tight and then keep in oven for the final step.",
      "2. You can skip biryani masala if you don’t have and add just garam masala (1 tsp and red chilli powder – 3 tsp instead of 1 tsp)",
      "3. If it is spicy in the end, squeeze some lemon, it will reduce the heat and enhance the flavors also."
    ],
    "ingredients": [
      {
        "name": "Cashew nuts",
        "quantity": "12"
      },
      {
        "name": "Khus khus",
        "quantity": "½ tbsp"
      },
      {
        "name": "Cumin seeds",
        "quantity": "½ tbsp"
      },
      {
        "name": "Onions",
        "quantity": "3 sliced thinly"
      },
      {
        "name": "Ginger garlic paste",
        "quantity": "2 tsp"
      },
      {
        "name": "Garlic",
        "quantity": "4 whole"
      },
      {
        "name": "Mint",
        "quantity": "Leaves"
      },
      {
        "name": "Cilantro",
        "quantity": "Leaves"
      },
      {
        "name": "Saffron",
        "quantity": "½ tsp dissolved in ½ cup warm milk"
      },
      {
        "name": "Ghee",
        "quantity": "2 tbsp"
      },
      {
        "name": "Basmati rice",
        "quantity": "2 Cups"
      },
      {
        "name": "Full fat yogurt",
        "quantity": "½ cup"
      },
      {
        "name": "Cumin Seeds",
        "quantity": "1 tbsp"
      },
      {
        "name": "Bay leaf",
        "quantity": "½"
      },
      {
        "name": "Cinnamon",
        "quantity": "1 thin piece"
      },
      {
        "name": "Cloves",
        "quantity": "3"
      },
      {
        "name": "Cardamom",
        "quantity": "2"
      },
      {
        "name": "Lamb",
        "quantity": "1 lb"
      },
      {
        "name": "Red Chilli powder",
        "quantity": "1 tsp"
      },
      {
        "name": "Biryani masala",
        "quantity": "1 tbsp"
      }
    ],
    "cuisineType": "indian",
    "mealType": "lamb",
    "difficultyLevel": "medium",
    "prepTime": 30,
    "cookTime": 45,
    "servings": 4,
    "tags": [
      "curry",
      "meat"
    ]
  },
  {
    "name": "Chorizo & soft-boiled egg salad",
    "description": "step 1\r\nCook the potatoes in a large pan of boiling salted water for 12 mins, adding the eggs after ...",
    "imageUrl": "https://www.themealdb.com/images/media/meals/v8eaed1763257313.jpg",
    "instructions": [
      "step 1",
      "Cook the potatoes in a large pan of boiling salted water for 12 mins, adding the eggs after 6 mins, and the beans for the final 2 mins. Drain everything and cool the eggs under cold running water.",
      "step 2",
      "Meanwhile fry chorizo slices for 1-2 mins, until beginning to crisp. Remove from the pan with a slotted spoon and set aside, leaving the oil from the chorizo in the pan. Add the garlic to the pan and cook gently for 1 min.",
      "step 3",
      "Remove the pan from the heat, stir in the vinegar and parsley, then toss with the potatoes, beans, chorizo and seasoning. Shell the eggs, cut into quarters and add to the salad."
    ],
    "ingredients": [
      {
        "name": "Baby New Potatoes",
        "quantity": "500g"
      },
      {
        "name": "Egg",
        "quantity": "4"
      },
      {
        "name": "Green Beans",
        "quantity": "225g"
      },
      {
        "name": "Chorizo",
        "quantity": "225g"
      },
      {
        "name": "Garlic Clove",
        "quantity": "1 sliced"
      },
      {
        "name": "Sherry vinegar",
        "quantity": "2 tbsp"
      },
      {
        "name": "Parsley",
        "quantity": "2 tbsp chopped"
      }
    ],
    "cuisineType": "spanish",
    "mealType": "pork",
    "difficultyLevel": "medium",
    "prepTime": 30,
    "cookTime": 45,
    "servings": 4,
    "tags": []
  },
  {
    "name": "Authentic Norwegian Kransekake",
    "description": "Grind almonds in an almond grinder or food processor.\r\n▢\r\nMix almonds and powdered sugar together in...",
    "imageUrl": "https://www.themealdb.com/images/media/meals/yk78uc1763075719.jpg",
    "instructions": [
      "Grind almonds in an almond grinder or food processor.",
      "▢",
      "Mix almonds and powdered sugar together in a large mixing bowl. Add three of the egg whites and knead the dough together with your hands until it comes together in a ball. Wrap in cling film and leave in the fridge for at least an hour, preferably until the next day.",
      "▢",
      "Grease the kransekake forms thoroughly and coat with semolina, flour, or bread crumbs.",
      "▢",
      "Preheat oven to 210°C (410°F) top and bottom heat. Divide the dough into six sections.",
      "▢",
      "Slowly add the remaining egg white to the dough and knead it until you can roll it into long sausages about as thick as your index finger. Fill the forms with the dough sausages, pinching the ends together to make rings.",
      "▢",
      "Set the forms on a baking sheet and back in the middle of the oven for about 10 – 12 minutes, until the tops are golden brown."
    ],
    "ingredients": [
      {
        "name": "Almonds",
        "quantity": "3 Cups"
      },
      {
        "name": "Egg White",
        "quantity": "4"
      },
      {
        "name": "Powdered Sugar",
        "quantity": "4 cups"
      },
      {
        "name": "Powdered Sugar",
        "quantity": "2 cups"
      },
      {
        "name": "Egg White",
        "quantity": "1"
      },
      {
        "name": "Lemon Juice",
        "quantity": "1/2 teaspoon"
      }
    ],
    "cuisineType": "norwegian",
    "mealType": "dessert",
    "difficultyLevel": "medium",
    "prepTime": 30,
    "cookTime": 45,
    "servings": 4,
    "tags": []
  },
  {
    "name": "Patatas bravas",
    "description": "step 1\r\nHeat the oil in a pan and fry the onion for about 5 mins until softened. Add the garlic, cho...",
    "imageUrl": "https://www.themealdb.com/images/media/meals/bvg8sn1763298713.jpg",
    "instructions": [
      "step 1",
      "Heat the oil in a pan and fry the onion for about 5 mins until softened. Add the garlic, chopped tomatoes, tomato purée, sweet paprika, chilli powder, sugar and a pinch of salt, then bring to the boil, stirring occasionally. Lower to a simmer and cook for 10 mins until pulpy. Can be kept chilled for up to 24 hrs.",
      "step 2",
      "Heat oven to 200C/180C fan/gas 6. Pat the potatoes dry with kitchen paper, then tip into a roasting tin and toss in the olive oil and some seasoning. Roast for 40-50 mins until crisp and golden. Tip the potatoes into serving dishes and spoon over the tomato sauce. Sprinkle with some fresh parsley to serve."
    ],
    "ingredients": [
      {
        "name": "Olive Oil",
        "quantity": "3  tablespoons"
      },
      {
        "name": "Onion",
        "quantity": "1 small finely diced"
      },
      {
        "name": "Garlic",
        "quantity": "2 cloves chopped"
      },
      {
        "name": "Tinned Tomatos",
        "quantity": "225g"
      },
      {
        "name": "Tomato Puree",
        "quantity": "1 tablespoon"
      },
      {
        "name": "Paprika",
        "quantity": "2 teaspoon"
      },
      {
        "name": "Chilli Powder",
        "quantity": "Pinch"
      },
      {
        "name": "Sugar",
        "quantity": "Pinch"
      },
      {
        "name": "Parsley",
        "quantity": "Chopped"
      },
      {
        "name": "Potatoes",
        "quantity": "900g"
      },
      {
        "name": "Olive Oil",
        "quantity": "2 tbsp"
      }
    ],
    "cuisineType": "spanish",
    "mealType": "vegetarian",
    "difficultyLevel": "medium",
    "prepTime": 30,
    "cookTime": 45,
    "servings": 4,
    "tags": []
  },
  {
    "name": "Moussaka",
    "description": "Heat the grill to high. Brown the beef in a deep ovenproof frying pan over a high heat for 5 mins. M...",
    "imageUrl": "https://www.themealdb.com/images/media/meals/ctg8jd1585563097.jpg",
    "instructions": [
      "Heat the grill to high. Brown the beef in a deep ovenproof frying pan over a high heat for 5 mins. Meanwhile, prick the aubergine with a fork, then microwave on High for 3-5 mins until soft. Mix the yogurt, egg and parmesan together, then add a little seasoning.",
      "Stir the tomatoes, purée and potatoes in with the beef with some seasoning and heat through. Smooth the surface of the beef mixture with the back of a spoon, then slice the cooked aubergine and arrange on top. Pour the yogurt mixture over the aubergines, smooth out evenly, then grill until the topping has set and turned golden."
    ],
    "ingredients": [
      {
        "name": "Beef",
        "quantity": "500g"
      },
      {
        "name": "Aubergine",
        "quantity": "1 large"
      },
      {
        "name": "Greek Yogurt",
        "quantity": "150g"
      },
      {
        "name": "Egg",
        "quantity": "1 beaten"
      },
      {
        "name": "Parmesan",
        "quantity": "3 tbs"
      },
      {
        "name": "Tomato",
        "quantity": "400g"
      },
      {
        "name": "Tomato Puree",
        "quantity": "4 tbs"
      },
      {
        "name": "Potatoes",
        "quantity": "350g"
      }
    ],
    "cuisineType": "greek",
    "mealType": "beef",
    "difficultyLevel": "medium",
    "prepTime": 30,
    "cookTime": 45,
    "servings": 4,
    "tags": []
  },
  {
    "name": "Norwegian Krumkake",
    "description": "▢\r\nWhisk the egg and sugar until the mixture thickens.\r\n▢\r\nMelt the butter and let it cool slightly,...",
    "imageUrl": "https://www.themealdb.com/images/media/meals/z9g8011763075640.jpg",
    "instructions": [
      "▢",
      "Whisk the egg and sugar until the mixture thickens.",
      "▢",
      "Melt the butter and let it cool slightly, then add the butter to the egg mixture.",
      "▢",
      "Mix in spices and then slowly add the flour while stirring to avoid lumps. ",
      "▢",
      "Let the batter rest for at least 30 minutes. This improves the texture of the krumkaker.",
      "▢",
      "Spoon about one heaping tablespoon of batter onto iron and bake. If the batter is too thick, add some water to it.",
      "▢",
      "While still hot, shape the krumkake with a wooden krumkake roller or over a cup (if using a cup, make them a bit thicker). The krumkaker harden quickly, so you can just let them sit on the roller/cup until the next krumkake is ready to be shaped. ",
      "▢",
      "After completely cooled, store the krumkaker in a metal or glass tin lined with paper towels at the bottom. You can also freeze them!"
    ],
    "ingredients": [
      {
        "name": "Egg",
        "quantity": "3 Large"
      },
      {
        "name": "Sugar",
        "quantity": "3/4 cup"
      },
      {
        "name": "Butter",
        "quantity": "2/3 Cup"
      },
      {
        "name": "Cardamom",
        "quantity": "1 teaspoon"
      },
      {
        "name": "Nutmeg",
        "quantity": "1 pinch"
      },
      {
        "name": "Salt",
        "quantity": "1/2 teaspoon"
      },
      {
        "name": "Flour",
        "quantity": "1 1/4 cup"
      },
      {
        "name": "Water",
        "quantity": "Splash"
      }
    ],
    "cuisineType": "norwegian",
    "mealType": "dessert",
    "difficultyLevel": "medium",
    "prepTime": 30,
    "cookTime": 45,
    "servings": 4,
    "tags": []
  },
  {
    "name": "Chorizo & tomato salad",
    "description": "step 1\r\nPut the tomatoes in a bowl with the onion and thyme. Season, then drizzle with the vinegar a...",
    "imageUrl": "https://www.themealdb.com/images/media/meals/6cskio1763338156.jpg",
    "instructions": [
      "step 1",
      "Put the tomatoes in a bowl with the onion and thyme. Season, then drizzle with the vinegar and oil. Let the flavours mingle while you cook the chorizo.",
      "step 2",
      "In a hot, dry pan, fry the chorizo slices until browned on both sides. Serve the tomatoes with the fried chorizo, drizzled with a little oil from the pan."
    ],
    "ingredients": [
      {
        "name": "Beef tomatoes",
        "quantity": "3"
      },
      {
        "name": "Red Onions",
        "quantity": "1/2"
      },
      {
        "name": "Thyme",
        "quantity": "Sprigs of fresh"
      },
      {
        "name": "Sherry vinegar",
        "quantity": "1 tablespoon"
      },
      {
        "name": "Extra Virgin Olive Oil",
        "quantity": "2 tblsp"
      },
      {
        "name": "Chorizo",
        "quantity": "100g"
      }
    ],
    "cuisineType": "spanish",
    "mealType": "pork",
    "difficultyLevel": "medium",
    "prepTime": 30,
    "cookTime": 45,
    "servings": 4,
    "tags": []
  },
  {
    "name": "Fresh sardines",
    "description": "Wash the fish under the cold tap. Roll in the flour and deep fry in oil until crispy. Lay on kitchen...",
    "imageUrl": "https://www.themealdb.com/images/media/meals/nv5lf31628771380.jpg",
    "instructions": [
      "Wash the fish under the cold tap. Roll in the flour and deep fry in oil until crispy. Lay on kitchen towel to get rid of the excess oil and serve hot or cold with a slice of lemon."
    ],
    "ingredients": [
      {
        "name": "Sardines",
        "quantity": "500g"
      },
      {
        "name": "Vegetable Oil",
        "quantity": "Dash"
      },
      {
        "name": "Flour",
        "quantity": "To Glaze"
      },
      {
        "name": "Salt",
        "quantity": "Dash"
      }
    ],
    "cuisineType": "croatian",
    "mealType": "side",
    "difficultyLevel": "medium",
    "prepTime": 30,
    "cookTime": 45,
    "servings": 4,
    "tags": [
      "fresh"
    ]
  },
  {
    "name": "Sushi",
    "description": "STEP 1\r\nTO MAKE SUSHI ROLLS: Pat out some rice. Lay a nori sheet on the mat, shiny-side down. Dip yo...",
    "imageUrl": "https://www.themealdb.com/images/media/meals/g046bb1663960946.jpg",
    "instructions": [
      "STEP 1",
      "TO MAKE SUSHI ROLLS: Pat out some rice. Lay a nori sheet on the mat, shiny-side down. Dip your hands in the vinegared water, then pat handfuls of rice on top in a 1cm thick layer, leaving the furthest edge from you clear.",
      "STEP 2",
      "Spread over some Japanese mayonnaise. Use a spoon to spread out a thin layer of mayonnaise down the middle of the rice.",
      "STEP 3",
      "Add the filling. Get your child to top the mayonnaise with a line of their favourite fillings – here we’ve used tuna and cucumber.",
      "STEP 4",
      "Roll it up. Lift the edge of the mat over the rice, applying a little pressure to keep everything in a tight roll.",
      "STEP 5",
      "Stick down the sides like a stamp. When you get to the edge without any rice, brush with a little water and continue to roll into a tight roll.",
      "STEP 6",
      "Wrap in cling film. Remove the mat and roll tightly in cling film before a grown-up cuts the sushi into thick slices, then unravel the cling film.",
      "STEP 7",
      "TO MAKE PRESSED SUSHI: Layer over some smoked salmon. Line a loaf tin with cling film, then place a thin layer of smoked salmon inside on top of the cling film.",
      "STEP 8",
      "Cover with rice and press down. Press about 3cm of rice over the fish, fold the cling film over and press down as much as you can, using another tin if you have one.",
      "STEP 9",
      "Tip it out like a sandcastle. Turn block of sushi onto a chopping board. Get a grown-up to cut into fingers, then remove the cling film.",
      "STEP 10",
      "TO MAKE SUSHI BALLS: Choose your topping. Get a small square of cling film and place a topping, like half a prawn or a small piece of smoked salmon, on it. Use damp hands to roll walnut-sized balls of rice and place on the topping.",
      "STEP 11",
      "Make into tight balls. Bring the corners of the cling film together and tighten into balls by twisting it up, then unwrap and serve."
    ],
    "ingredients": [
      {
        "name": "Sushi Rice",
        "quantity": "300ml"
      },
      {
        "name": "Rice wine",
        "quantity": "100ml"
      },
      {
        "name": "Caster Sugar",
        "quantity": "2 tbs"
      },
      {
        "name": "Mayonnaise",
        "quantity": "3 tbs"
      },
      {
        "name": "Rice wine",
        "quantity": "1 tbs"
      },
      {
        "name": "Soy Sauce",
        "quantity": "1 tbs"
      },
      {
        "name": "Cucumber",
        "quantity": "1"
      }
    ],
    "cuisineType": "japanese",
    "mealType": "seafood",
    "difficultyLevel": "medium",
    "prepTime": 30,
    "cookTime": 45,
    "servings": 4,
    "tags": []
  },
  {
    "name": "Seafood rice",
    "description": "step 1\r\nHeat the oil in a deep frying pan, then soften the leek for 5 mins without browning. Add the...",
    "imageUrl": "https://www.themealdb.com/images/media/meals/5r5rvx1763287943.jpg",
    "instructions": [
      "step 1",
      "Heat the oil in a deep frying pan, then soften the leek for 5 mins without browning. Add the chorizo and fry until it releases its oils. Stir in the turmeric and rice until coated by the oils, then pour in the stock. Bring to the boil, then simmer for 15 mins, stirring occasionally.",
      "step 2",
      "Tip in the peas and cook for 5 mins, then stir in the seafood to heat through for a final 1-2 mins cooking or until rice is cooked. Check for seasoning and serve immediately with lemon wedges."
    ],
    "ingredients": [
      {
        "name": "Olive Oil",
        "quantity": "1 tbsp"
      },
      {
        "name": "Leek",
        "quantity": "1 sliced"
      },
      {
        "name": "Chorizo",
        "quantity": "110g"
      },
      {
        "name": "Turmeric",
        "quantity": "1 teaspoon"
      },
      {
        "name": "Rice",
        "quantity": "300g"
      },
      {
        "name": "Fish Stock",
        "quantity": "1 L"
      },
      {
        "name": "Peas",
        "quantity": "200g"
      },
      {
        "name": "Frozen Seafood mix",
        "quantity": "400g"
      }
    ],
    "cuisineType": "spanish",
    "mealType": "seafood",
    "difficultyLevel": "medium",
    "prepTime": 30,
    "cookTime": 45,
    "servings": 4,
    "tags": []
  },
  {
    "name": "Potato Gratin with Chicken",
    "description": "15 minute potato gratin with chicken and bacon greens: a gratin always seems more effort and more in...",
    "imageUrl": "https://www.themealdb.com/images/media/meals/qwrtut1468418027.jpg",
    "instructions": [
      "15 minute potato gratin with chicken and bacon greens: a gratin always seems more effort and more indulgent than ordinary boiled or roasts, but it doesn't have to take 45mins, it's nice for a change and you can control the calorie content by going with full fat to low fat creme fraiche. (It's always tastes better full fat though obviously!) to serve 4: use 800g of potatoes, finely slice and boil in a pan for about 5-8 mins till firmish, not soft. Finely slice 3 onions and place in an oven dish with 2 tblsp of olive oil and 100ml of chicken stock. Cook till the onions are soft then drain the potatoes and pour onto the onions. Season and spoon over cream or creme fraiche till all is covered but not swimming. Grate Parmesan over the top then finish under the grill till nicely golden. serve with chicken and bacon, peas and spinach."
    ],
    "ingredients": [
      {
        "name": "Potatoes",
        "quantity": "800g"
      },
      {
        "name": "Onions",
        "quantity": "3"
      },
      {
        "name": "Olive Oil",
        "quantity": "2 tblsp"
      },
      {
        "name": "Chicken Stock",
        "quantity": "100ml"
      },
      {
        "name": "Creme Fraiche",
        "quantity": "1 pot"
      },
      {
        "name": "Parmesan",
        "quantity": "Topping"
      },
      {
        "name": "Chicken Breasts",
        "quantity": "4"
      },
      {
        "name": "Bacon",
        "quantity": "4"
      },
      {
        "name": "Spinach",
        "quantity": "Topping"
      },
      {
        "name": "Peas",
        "quantity": "Topping"
      }
    ],
    "cuisineType": "italian",
    "mealType": "chicken",
    "difficultyLevel": "medium",
    "prepTime": 30,
    "cookTime": 45,
    "servings": 4,
    "tags": []
  },
  {
    "name": "Mini chilli beef pies",
    "description": "step 1\r\nTo make chilli, heat oil in a pan and fry onion for 5 mins until soft. Add spices; fry for 1...",
    "imageUrl": "https://www.themealdb.com/images/media/meals/6sarfo1762340107.jpg",
    "instructions": [
      "step 1",
      "To make chilli, heat oil in a pan and fry onion for 5 mins until soft. Add spices; fry for 1 min. Stir in beef and cook for a few mins. Add tomato purée, stock and cinnamon. Give it a stir, bring to the boil, then simmer for 15-20 mins until very little liquid is left. Add beans 5 mins before the end of cooking. Check seasoning and cool.",
      "step 2",
      "Heat oven to 200C/fan 180C/gas 6. Using a 7cm pastry cutter, stamp out 12 circles from the pastry. Use to line a 12-hole mini muffin tray, prick the base of the pastry with a fork, and bake for 10 mins. Remove from oven and cool on a wire tray. Repeat with remaining pastry.",
      "step 3",
      "Meanwhile, cook the potato in boiling water until tender. Drain, mash with soured cream and seasoning, then stir through chives. Spoon 1-2 tsp of chilli mix into the pastry cases and top with a tsp of mash. Ruffle mash with a fork; return to the oven for 15 mins or until golden."
    ],
    "ingredients": [
      {
        "name": "Ready rolled shortcrust pastry",
        "quantity": "450g"
      },
      {
        "name": "Sunflower Oil",
        "quantity": "1 tablespoon"
      },
      {
        "name": "Onion",
        "quantity": "1 small"
      },
      {
        "name": "Hot Chilli Powder",
        "quantity": "2 tsp"
      },
      {
        "name": "Ground Cumin",
        "quantity": "2 tsp"
      },
      {
        "name": "Minced Beef",
        "quantity": "250g"
      },
      {
        "name": "Tomato Puree",
        "quantity": "85g"
      },
      {
        "name": "Beef Stock",
        "quantity": "150ml"
      },
      {
        "name": "Ground Cinnamon",
        "quantity": "Pinch"
      },
      {
        "name": "Kidney Beans",
        "quantity": "200g"
      },
      {
        "name": "Potatoes",
        "quantity": "1 large"
      },
      {
        "name": "Sour Cream",
        "quantity": "3  tablespoons"
      },
      {
        "name": "Chopped Chive",
        "quantity": "2 tablespoons"
      }
    ],
    "cuisineType": "australian",
    "mealType": "beef",
    "difficultyLevel": "medium",
    "prepTime": 30,
    "cookTime": 45,
    "servings": 4,
    "tags": []
  },
  {
    "name": "Beef Caldereta",
    "description": "0.\tHeat oil in a cooking pot. Saute onion and garlic until onion softens\r\n1.\tAdd beef. Saute until t...",
    "imageUrl": "https://www.themealdb.com/images/media/meals/41cxjh1683207682.jpg",
    "instructions": [
      "0.\tHeat oil in a cooking pot. Saute onion and garlic until onion softens",
      "1.\tAdd beef. Saute until the outer part turns light brown.",
      "2.\tAdd soy sauce. Pour tomato sauce and water. Let boil.",
      "3.\tAdd Knorr Beef Cube. Cover the pressure cooker. Cook for 30 minutes.",
      "4.\tPan-fry carrot and potato until it browns. Set aside.",
      "5.\tAdd chili pepper, liver spread and peanut butter. Stir.",
      "6.\tAdd bell peppers, fried potato and carrot. Cover the pot. Continue cooking for 5 to 7 minutes.",
      "7.\tSeason with salt and ground black pepper. Serve."
    ],
    "ingredients": [
      {
        "name": "Beef",
        "quantity": "2kg cut cubes"
      },
      {
        "name": "Beef Stock",
        "quantity": "1"
      },
      {
        "name": "Soy Sauce",
        "quantity": "1 tbs"
      },
      {
        "name": "Water",
        "quantity": "2 cups"
      },
      {
        "name": "Green Pepper",
        "quantity": "1 sliced"
      },
      {
        "name": "Red Pepper",
        "quantity": "1 sliced"
      },
      {
        "name": "Potatoes",
        "quantity": "1 sliced"
      },
      {
        "name": "Carrots",
        "quantity": "1 sliced"
      },
      {
        "name": "Tomato Puree",
        "quantity": "8 ounces"
      },
      {
        "name": "Peanut Butter",
        "quantity": "3  tablespoons"
      },
      {
        "name": "Chilli Powder",
        "quantity": "5"
      },
      {
        "name": "Onion",
        "quantity": "1 chopped"
      },
      {
        "name": "Garlic",
        "quantity": "5 cloves"
      },
      {
        "name": "Olive Oil",
        "quantity": "3 tbs"
      }
    ],
    "cuisineType": "filipino",
    "mealType": "beef",
    "difficultyLevel": "medium",
    "prepTime": 30,
    "cookTime": 45,
    "servings": 4,
    "tags": []
  },
  {
    "name": "Chakchouka ",
    "description": "In a large cast iron skillet or sauté pan with a lid, heat oil over medium high heat. Add the onion ...",
    "imageUrl": "https://www.themealdb.com/images/media/meals/gpz67p1560458984.jpg",
    "instructions": [
      "In a large cast iron skillet or sauté pan with a lid, heat oil over medium high heat. Add the onion and sauté for 2-3 minutes, until softened. Add the peppers and garlic, and sauté for an additional 3-5 minutes. Add the tomatoes, cumin, paprika, salt, and chili powder. Mix well and bring the mixture to a simmer. Reduce the heat to medium low and continue to simmer, uncovered, 10-15 minutes until the mixture has thickened to your desired consistency. (Taste the sauce at this point and adjust for salt and spice, as desired.) Using the back of a spoon, make four craters in the mixture, large enough to hold an egg. Crack one egg into each of the craters. Cover the skillet and simmer for 5-7 minutes, until the eggs have set. Serve immediately with crusty bread or pita."
    ],
    "ingredients": [
      {
        "name": "Tomatoes",
        "quantity": "4"
      },
      {
        "name": "Olive Oil",
        "quantity": "2 tbs"
      },
      {
        "name": "Onion",
        "quantity": "1 Diced"
      },
      {
        "name": "Red Pepper",
        "quantity": "1 sliced"
      },
      {
        "name": "Green Pepper",
        "quantity": "1 sliced"
      },
      {
        "name": "Garlic",
        "quantity": "3 Cloves Crushed"
      },
      {
        "name": "Cumin",
        "quantity": "1 tsp"
      },
      {
        "name": "Paprika",
        "quantity": "1 tsp"
      },
      {
        "name": "Salt",
        "quantity": "3/4 teaspoon"
      },
      {
        "name": "Chili Powder",
        "quantity": "1/2 teaspoon"
      },
      {
        "name": "Eggs",
        "quantity": "4"
      }
    ],
    "cuisineType": "tunisian",
    "mealType": "miscellaneous",
    "difficultyLevel": "medium",
    "prepTime": 30,
    "cookTime": 45,
    "servings": 4,
    "tags": []
  },
  {
    "name": "Leblebi Soup",
    "description": "Heat the oil in a large pot. Add the onion and cook until translucent.\r\nDrain the soaked chickpeas a...",
    "imageUrl": "https://www.themealdb.com/images/media/meals/x2fw9e1560460636.jpg",
    "instructions": [
      "Heat the oil in a large pot. Add the onion and cook until translucent.",
      "Drain the soaked chickpeas and add them to the pot together with the vegetable stock. Bring to the boil, then reduce the heat and cover. Simmer for 30 minutes.",
      "In the meantime toast the cumin in a small ungreased frying pan, then grind them in a mortar. Add the garlic and salt and pound to a fine paste.",
      "Add the paste and the harissa to the soup and simmer until the chickpeas are tender, about 30 minutes.",
      "Season to taste with salt, pepper and lemon juice and serve hot."
    ],
    "ingredients": [
      {
        "name": "Olive Oil",
        "quantity": "2 tbs"
      },
      {
        "name": "Onion",
        "quantity": "1 medium finely diced"
      },
      {
        "name": "Chickpeas",
        "quantity": "250g"
      },
      {
        "name": "Vegetable Stock",
        "quantity": "1.5L"
      },
      {
        "name": "Cumin",
        "quantity": "1 tsp"
      },
      {
        "name": "Garlic",
        "quantity": "5 cloves"
      },
      {
        "name": "Salt",
        "quantity": "1/2 tsp"
      },
      {
        "name": "Harissa Spice",
        "quantity": "1 tsp"
      },
      {
        "name": "Pepper",
        "quantity": "Pinch"
      },
      {
        "name": "Lime",
        "quantity": "1/2"
      }
    ],
    "cuisineType": "tunisian",
    "mealType": "vegetarian",
    "difficultyLevel": "medium",
    "prepTime": 30,
    "cookTime": 45,
    "servings": 4,
    "tags": [
      "soup"
    ]
  },
  {
    "name": "Pisto con huevos",
    "description": "step 1\r\nHeat the oil in a large flameproof casserole dish or a cast-iron skillet over a low heat. Ad...",
    "imageUrl": "https://www.themealdb.com/images/media/meals/0nswfe1763279040.jpg",
    "instructions": [
      "step 1",
      "Heat the oil in a large flameproof casserole dish or a cast-iron skillet over a low heat. Add the onions and a sprinkle of salt, cover and cook gently for 15 mins, stirring occasionally. Add the garlic and cook for another 2 mins.",
      "step 2",
      "Next, throw in the peppers and cook over a medium heat, covered, for about 5 mins, stirring every so often, until the peppers are just tender.",
      "step 3",
      "Mix in the oregano, thyme, bay leaves, some black pepper and a little salt, if needed. Tip in the courgettes and aubergine, combine thoroughly, and cook over a medium heat, covered, for 10 mins. Stir in the tomatoes, cover and cook for 20 mins, stirring occasionally.",
      "step 4",
      "Carefully crack the eggs over the pisto – try not to break the yolks. Cook in the sauce on a medium heat for 5-6 mins until the eggs are cooked through but still a little soft, then scatter with parsley before serving"
    ],
    "ingredients": [
      {
        "name": "Olive Oil",
        "quantity": "2 tblsp"
      },
      {
        "name": "Onion",
        "quantity": "2"
      },
      {
        "name": "Garlic Clove",
        "quantity": "4 Chopped"
      },
      {
        "name": "Mixed peppers",
        "quantity": "5"
      },
      {
        "name": "Oregano",
        "quantity": "1 teaspoon"
      },
      {
        "name": "Thyme",
        "quantity": "Sprigs of fresh"
      },
      {
        "name": "Bay Leaves",
        "quantity": "4 leaves"
      },
      {
        "name": "Courgettes",
        "quantity": "2 chopped"
      },
      {
        "name": "Aubergine",
        "quantity": "1 chopped"
      },
      {
        "name": "Tomato",
        "quantity": "4 large"
      },
      {
        "name": "Egg",
        "quantity": "4 large"
      },
      {
        "name": "Parsley",
        "quantity": "Handful"
      }
    ],
    "cuisineType": "spanish",
    "mealType": "vegetarian",
    "difficultyLevel": "medium",
    "prepTime": 30,
    "cookTime": 45,
    "servings": 4,
    "tags": []
  },
  {
    "name": "Spiced smoky barbecued chicken",
    "description": "step 1\r\nMake the marinade. Smash the garlic with a little salt using a pestle and mortar. Add the le...",
    "imageUrl": "https://www.themealdb.com/images/media/meals/a08uqk1761848682.jpg",
    "instructions": [
      "step 1",
      "Make the marinade. Smash the garlic with a little salt using a pestle and mortar. Add the lemon zest and juice, the spice mix, chilli, oil and a good grinding of black pepper. Mix to a paste. This can be done in a mini food processor.",
      "step 2",
      "Toss the chicken in the marinade and set aside while you light the barbecue. When the barbecue’s hot, lay the bunches of herbs on the grid and put the chicken, skin side up, on top. Close the lid, if your barbecue has one, and cook the chicken on the smouldering herbs for about 10 minutes until the meat starts to colour. Turn the chicken and continue to cook for a further 20-30 minutes, turning as necessary, until it is slightly charred from the burnt herbs and cooked through to the bone."
    ],
    "ingredients": [
      {
        "name": "Garlic",
        "quantity": "2 cloves"
      },
      {
        "name": "Lemon",
        "quantity": "Juice/zest of one"
      },
      {
        "name": "Curry Powder",
        "quantity": "2 tblsp"
      },
      {
        "name": "Chilli Flakes",
        "quantity": "Pinch"
      },
      {
        "name": "Olive Oil",
        "quantity": "3  tablespoons"
      },
      {
        "name": "Chicken Thighs",
        "quantity": "12"
      },
      {
        "name": "Rosemary",
        "quantity": "Bunch"
      },
      {
        "name": "Rosemary",
        "quantity": "Bunch"
      },
      {
        "name": "Thyme",
        "quantity": "Bunch"
      },
      {
        "name": "Thyme",
        "quantity": "Bunch"
      },
      {
        "name": "Bay Leaves",
        "quantity": "2"
      }
    ],
    "cuisineType": "australian",
    "mealType": "chicken",
    "difficultyLevel": "medium",
    "prepTime": 30,
    "cookTime": 45,
    "servings": 4,
    "tags": []
  },
  {
    "name": "Peanut Butter Cheesecake",
    "description": "Oil and line a 20cm round loose- bottomed cake tin with cling film, making it as smooth as possible....",
    "imageUrl": "https://www.themealdb.com/images/media/meals/qtuuys1511387068.jpg",
    "instructions": [
      "Oil and line a 20cm round loose- bottomed cake tin with cling film, making it as smooth as possible. Melt the butter in a pan. Crush the biscuits by bashing them in a bag with a rolling pin, then stir them into the butter until very well coated. Press the mixture firmly into the base of the tin and chill.",
      "Soak the gelatine in water while you make the filling. Tip the ricotta into a bowl, then beat in the peanut butter and syrup. Ricotta has a slightly grainy texture so blitz until smooth with a stick blender for a smoother texture if you prefer.",
      "Take the soaked gelatine from the water and squeeze dry. Put it into a pan with the milk and heat very gently until the gelatine dissolves. Beat into the peanut mixture, then tip onto the biscuit base. Chill until set.",
      "To freeze, leave in the tin and as soon as it is solid, cover the surface with cling film, then wrap the tin with cling film and foil.",
      "To defrost, thaw in the fridge overnight.",
      "To serve, carefully remove from the tin. Whisk the cream with the sugar until it holds its shape, then spread on top of the cheesecake and scatter with the peanut brittle."
    ],
    "ingredients": [
      {
        "name": "Butter",
        "quantity": "50g"
      },
      {
        "name": "Peanut Cookies",
        "quantity": "175g"
      },
      {
        "name": "Gelatine Leafs",
        "quantity": "5"
      },
      {
        "name": "Ricotta",
        "quantity": "500g"
      },
      {
        "name": "Peanut Butter",
        "quantity": "175g"
      },
      {
        "name": "Golden Syrup",
        "quantity": "175g"
      },
      {
        "name": "Milk",
        "quantity": "150ml"
      },
      {
        "name": "Double Cream",
        "quantity": "275ml"
      },
      {
        "name": "Light Brown Soft Sugar",
        "quantity": "2 tblsp"
      },
      {
        "name": "Peanut Brittle",
        "quantity": "Crushed"
      }
    ],
    "cuisineType": "american",
    "mealType": "dessert",
    "difficultyLevel": "medium",
    "prepTime": 30,
    "cookTime": 45,
    "servings": 4,
    "tags": [
      "cake",
      "desert",
      "treat",
      "unhealthy",
      "speciality"
    ]
  },
  {
    "name": "Chicken Karaage",
    "description": "Add the ginger, garlic, soy sauce, sake and sugar to a bowl and whisk to combine. Add the chicken, t...",
    "imageUrl": "https://www.themealdb.com/images/media/meals/tyywsw1505930373.jpg",
    "instructions": [
      "Add the ginger, garlic, soy sauce, sake and sugar to a bowl and whisk to combine. Add the chicken, then stir to coat evenly. Cover and refrigerate for at least 1 hour.",
      "Add 1 inch of vegetable oil to a heavy bottomed pot and heat until the oil reaches 360 degrees F. Line a wire rack with 2 sheets of paper towels and get your tongs out. Put the potato starch in a bowl",
      "Add a handful of chicken to the potato starch and toss to coat each piece evenly.",
      "Fry the karaage in batches until the exterior is a medium brown and the chicken is cooked through. Transfer the fried chicken to the paper towel lined rack. If you want the karaage to stay crispy longer, you can fry the chicken a second time, until it's a darker color after it's cooled off once. Serve with lemon wedges."
    ],
    "ingredients": [
      {
        "name": "Chicken",
        "quantity": "450 grams Boneless skin"
      },
      {
        "name": "Ginger",
        "quantity": "1 tablespoon"
      },
      {
        "name": "Garlic",
        "quantity": "1 clove"
      },
      {
        "name": "Soy sauce",
        "quantity": "2 tablespoons"
      },
      {
        "name": "Sake",
        "quantity": "1 tablespoon"
      },
      {
        "name": "Granulated sugar",
        "quantity": "2 teaspoon"
      },
      {
        "name": "Potato starch",
        "quantity": "1/3 cup"
      },
      {
        "name": "Vegetable oil",
        "quantity": "1/3 cup"
      },
      {
        "name": "Lemon",
        "quantity": "1/3 cup"
      }
    ],
    "cuisineType": "japanese",
    "mealType": "chicken",
    "difficultyLevel": "medium",
    "prepTime": 30,
    "cookTime": 45,
    "servings": 4,
    "tags": []
  },
  {
    "name": "Roasted Eggplant With Tahini, Pine Nuts, and Lentils",
    "description": "\r\nFor the Lentils: Adjust oven rack to center position and preheat oven to 450°F to prepare for roas...",
    "imageUrl": "https://www.themealdb.com/images/media/meals/ysqrus1487425681.jpg",
    "instructions": [
      "For the Lentils: Adjust oven rack to center position and preheat oven to 450°F to prepare for roasting eggplant. Meanwhile, heat 2 tablespoons olive oil in a medium saucepan over medium heat until shimmering. Add carrots, celery, and onion and cook, stirring, until softened but not browned, about 4 minutes. Add garlic and cook, stirring, until fragrant, about 30 seconds. Add lentils, bay leaves, stock or water, and a pinch of salt. Bring to a simmer, cover with the lid partially ajar, and cook until lentils are tender, about 30 minutes. (Top up with water if lentils are at any point not fully submerged.) Remove lid, stir in vinegar, and reduce until lentils are moist but not soupy. Season to taste with salt and pepper, cover, and keep warm until ready to serve.",
      "2.",
      "For the Eggplant: While lentils cook, cut each eggplant in half. Score flesh with the tip of a paring knife in a cross-hatch pattern at 1-inch intervals. Transfer to a foil-lined rimmed baking sheet, cut side up, and brush each eggplant half with 1 tablespoon oil, letting each brushstroke be fully absorbed before brushing with more. Season with salt and pepper. Place a rosemary sprig on top of each one. Transfer to oven and roast until completely tender and well charred, 25 to 35 minutes. Remove from oven and discard rosemary.",
      "3.",
      "To Serve: Heat 2 tablespoons olive oil and pine nuts in a medium skillet set over medium heat. Cook, tossing nuts frequently, until golden brown and aromatic, about 4 minutes. Transfer to a bowl to halt cooking. Stir half of parsley and rosemary into lentils and transfer to a serving platter. Arrange eggplant halves on top. Spread a few tablespoons of tahini sauce over each eggplant half and sprinkle with pine nuts. Sprinkle with remaining parsley and rosemary, drizzle with additional olive oil, and serve."
    ],
    "ingredients": [
      {
        "name": "Olive Oil",
        "quantity": "2 tablespoons"
      },
      {
        "name": "Carrots",
        "quantity": "2 small cut into chunks"
      },
      {
        "name": "Celery",
        "quantity": "2 small stalks"
      },
      {
        "name": "Onion",
        "quantity": "1 medium finely diced"
      },
      {
        "name": "Garlic",
        "quantity": "6 medium cloves sliced"
      },
      {
        "name": "Brown Lentils",
        "quantity": "12 ounces (340g)"
      },
      {
        "name": "Bay Leaves",
        "quantity": "2"
      },
      {
        "name": "Water",
        "quantity": "4 cups"
      },
      {
        "name": "Salt",
        "quantity": "Pinch"
      },
      {
        "name": "Apple Cider Vinegar",
        "quantity": "2 teaspoons (10ml)"
      },
      {
        "name": "Pepper",
        "quantity": "Pinch"
      },
      {
        "name": "Egg Plants",
        "quantity": "2 large"
      },
      {
        "name": "Rosemary",
        "quantity": "4 sprigs"
      },
      {
        "name": "Pine nuts",
        "quantity": "1/4 cup"
      },
      {
        "name": "Parsley",
        "quantity": "2 tablespoons"
      }
    ],
    "cuisineType": "american",
    "mealType": "vegetarian",
    "difficultyLevel": "medium",
    "prepTime": 30,
    "cookTime": 45,
    "servings": 4,
    "tags": [
      "vegetarian",
      "pulse",
      "nutty"
    ]
  },
  {
    "name": "Osso Buco alla Milanese",
    "description": "Heat the oven to 300 degrees.\r\nDredging the shanks: pour the flour into a shallow dish (a pie plate ...",
    "imageUrl": "https://www.themealdb.com/images/media/meals/wwuqvt1487345467.jpg",
    "instructions": [
      "Heat the oven to 300 degrees.",
      "Dredging the shanks: pour the flour into a shallow dish (a pie plate works nicely). Season the veal shanks on all sides with salt and pepper. One at a time, roll the shanks around in the flour coat, and shake and pat the shank to remove any excuses flour. Discard the remaining flour.",
      "Browning the shanks: put the oil and 1 tablespoon of the butter in a wide Dutch oven or heavy braising pot (6 to 7 quart) and heat over medium-high heat. When the butter has melted and the oil is shimmering, lower the shanks into the pot, flat side down; if the shanks won’t fit without touching one another, do this in batches. Brown the shanks, turning once with tongs, until both flat sides are well caramelized, about 5 minutes per side. If the butter-oil mixture starts to burn, lower the heat just a bit. Transfer the shanks to a large platter or tray and set aside.",
      "The aromatics: pour off and discard the fat from the pot. Wipe out any burnt bits with a damp paper towel, being careful not to remove any delicious little caramelized bits. Ad the remaining 2 tablespoons butter to the pot and melt it over medium heat. When the butter has stopped foaming, add the onion, carrot, celery, and fennel. Season with salt and pepper, stir, and cook the vegetables until they begin to soften but do not brown, about 6 minutes. Stir in the garlic, orange zest, marjoram, and bay leaf, and stew for another minute or two.",
      "The braising liquid: add the wine, increase the heat to high, and bring to a boil. Boil, stirring occasionally, to reduce the wine by about half, 5 minutes. Add the stock and tomatoes, with their juice, and boil again to reduce the liquid to about 1 cup total, about 10 minutes.",
      "The braise: Place the shanks in the pot so that they are sitting with the exposed bone facing up, and pour over any juices that accumulated as they sat. Cover with parchment paper, pressing down so the parchment nearly touches the veal and the edges hang over the sides of the pot by about an inch. Cover tightly with the lid, and slide into the lower part of the oven to braise at a gentle simmer. Check the pot after the first 15 minutes, and if the liquid is simmering too aggressively, lower the oven heat by 10 or 15 degrees. Continue braising, turning the shanks and spooning some pan juices over the top after the first 40 minutes, until the meat is completely tender and pulling away from the bone, about 2 hours.",
      "The gremolata: While the shanks are braising, stir together the garlic, parsley, and lemon zest in a small bowl. Cover with plastic wrap and set aside in a cool place (or the refrigerator, if your kitchen is very warm.)",
      "The finish: When the veal is fork-tender and falling away from the bone, remove the lid and sprinkle over half of the gremolata. Return the veal to the oven, uncovered, for another 15 minutes to caramelize it some.",
      "Using a slotted spatula or spoon, carefully lift the shanks from the braising liquid, doing your best to keep them intact. The shanks will be very tender and threatening to fall into pieces, and the marrow will be wobbly inside the bones, so this can be a bit tricky. But if they do break apart, don’t worry, the flavor won’t suffer at all. Arrange the shanks on a serving platter or other large plate, without stacking, and cover with foil to keep warm.",
      "Finishing the sauce: Set the braising pot on top of the stove and evaluate the sauce: if there is a visible layer of fat floating on the surface, use a large spoon to skim it off and discard it. Taste the sauce for concentration of flavor. If it tastes a bit weak or flat, bring it to a boil over high heat, and boil to reduce the volume and intensify the flavor for 5 to 10 minutes. Taste again for salt and pepper. If the sauce wants more zip, stir in a teaspoon or two of the remaining gremolata.",
      "Portioning the veal shanks: if the shanks are reasonably sized, serve one per person. If the shanks are gargantuan or you’re dealing with modest appetites, pull apart the larger shanks, separating them at their natural seams, and serve smaller amounts. Be sure to give the marrow bones to whomever prizes them most.",
      "Serving: Arrange the veal shanks on warm dinner plates accompanied by the risotto, if serving. Just before carrying the plates to the table, sprinkle on the remaining gremolata and then spoon over a generous amount of sauce – the contact with the hot liquid will aromatize the gremolata and perk up everyone’s appetite with the whiff of garlic and lemon."
    ],
    "ingredients": [
      {
        "name": "Veal",
        "quantity": "4 meaty shanks"
      },
      {
        "name": "Flour",
        "quantity": "½ cup"
      },
      {
        "name": "Olive Oil",
        "quantity": "2 tablespoons"
      },
      {
        "name": "Butter",
        "quantity": "3 tablespoons"
      },
      {
        "name": "Onion",
        "quantity": "1 medium chopped into ½-inch pieces"
      },
      {
        "name": "Carrots",
        "quantity": "1 chopped into ½-inch pieces"
      },
      {
        "name": "Celery",
        "quantity": "1 chopped into ½-inch pieces"
      },
      {
        "name": "Fennel",
        "quantity": "1 bulb chopped into ½-inch pieces"
      },
      {
        "name": "Garlic",
        "quantity": "3 cloves"
      },
      {
        "name": "Orange Zest",
        "quantity": "2 strips"
      },
      {
        "name": "Marjoram",
        "quantity": "1 ½ teaspoons"
      },
      {
        "name": "Bay Leaf",
        "quantity": "1"
      },
      {
        "name": "Dry White Wine",
        "quantity": "1 cup"
      },
      {
        "name": "Chicken Stock",
        "quantity": "½ cup"
      },
      {
        "name": "Tomatoes",
        "quantity": "1 cup chopped with juice"
      },
      {
        "name": "Parsley",
        "quantity": "2 tablespoons chopped"
      },
      {
        "name": "Garlic",
        "quantity": "1 teaspoon minced"
      },
      {
        "name": "Lemon Zest",
        "quantity": "1 teaspoon grated"
      }
    ],
    "cuisineType": "italian",
    "mealType": "miscellaneous",
    "difficultyLevel": "medium",
    "prepTime": 30,
    "cookTime": 45,
    "servings": 4,
    "tags": []
  },
  {
    "name": "Lamb Tagine",
    "description": "Heat the olive oil in a heavy-based pan and add the onion and carrot. Cook for 3- 4 mins until softe...",
    "imageUrl": "https://www.themealdb.com/images/media/meals/yuwtuu1511295751.jpg",
    "instructions": [
      "Heat the olive oil in a heavy-based pan and add the onion and carrot. Cook for 3- 4 mins until softened.",
      "Add the diced lamb and brown all over. Stir in the garlic and all the spices and cook for a few mins more or until the aromas are released.",
      "Add the honey and apricots, crumble in the stock cube and pour over roughly 500ml boiling water or enough to cover the meat. Give it a good stir and bring to the boil. Turn down to a simmer, put the lid on and cook for 1 hour.",
      "Remove the lid and cook for a further 30 mins, then stir in the squash. Cook for 20 – 30 mins more until the squash is soft and the lamb is tender. Serve alongside rice or couscous and sprinkle with parsley and pine nuts, if using."
    ],
    "ingredients": [
      {
        "name": "Olive Oil",
        "quantity": "2 tblsp"
      },
      {
        "name": "Onion",
        "quantity": "1 finely sliced"
      },
      {
        "name": "Carrots",
        "quantity": "2 chopped"
      },
      {
        "name": "Lamb Leg",
        "quantity": "500g"
      },
      {
        "name": "Garlic",
        "quantity": "2 cloves minced"
      },
      {
        "name": "Cumin",
        "quantity": "½ tsp"
      },
      {
        "name": "Ginger",
        "quantity": "½ tsp"
      },
      {
        "name": "Saffron",
        "quantity": "¼ tsp"
      },
      {
        "name": "Cinnamon",
        "quantity": "1 tsp"
      },
      {
        "name": "Honey",
        "quantity": "1 tblsp"
      },
      {
        "name": "Apricot",
        "quantity": "100g"
      },
      {
        "name": "Vegetable Stock Cube",
        "quantity": "1"
      },
      {
        "name": "Butternut Squash",
        "quantity": "1 medium chopped"
      },
      {
        "name": "Couscous",
        "quantity": "Steamed"
      },
      {
        "name": "Parsley",
        "quantity": "Chopped"
      }
    ],
    "cuisineType": "moroccan",
    "mealType": "lamb",
    "difficultyLevel": "medium",
    "prepTime": 30,
    "cookTime": 45,
    "servings": 4,
    "tags": []
  },
  {
    "name": "Salt cod tortilla",
    "description": "step 1\r\nHeat half the oil in a frying pan, and sauté the onion over a medium heat until soft and pal...",
    "imageUrl": "https://www.themealdb.com/images/media/meals/njj1681763297231.jpg",
    "instructions": [
      "step 1",
      "Heat half the oil in a frying pan, and sauté the onion over a medium heat until soft and pale gold – this will take about 8 mins. Remove from the pan, set aside, and add the potatoes to the pan. Cook until they are tender but not falling apart, carefully turning every so often. Cover the pan some of the time to help the slices cook through. Add the onions back to the pan along with the garlic and cook for another 4 mins. Tip into a bowl with the eggs, parsley and some seasoning and mix together. Leave to sit for half an hour.",
      "step 2",
      "Meanwhile, put the cod in a saucepan and cover with water. Bring up to a simmer. Remove from the heat, cover and leave for 10 mins. Drain, leave to cool and remove the skin and any bones. Break into large flakes and add to the potato and egg mixture.",
      "step 3",
      "Heat the rest of the oil in a non-stick frying pan. Pour in the tortilla mix and cook over a medium-low heat until it is just set and coming away from the sides of the pan. You might need to cover it to help the centre set. Be careful not to overcook it. Put a spatula underneath the tortilla every so often to make sure it isn’t sticking. Slide the tortilla onto a plate, then put the pan on top and flip the tortilla into it, uncooked side-down. Cook over a low heat until golden, or grill until just set. Leave to cool a little before serving."
    ],
    "ingredients": [
      {
        "name": "Olive Oil",
        "quantity": "4 tbsp"
      },
      {
        "name": "Onion",
        "quantity": "1 Large Chopped"
      },
      {
        "name": "Jersey Royal Potatoes",
        "quantity": "300g"
      },
      {
        "name": "Garlic",
        "quantity": "2 cloves chopped"
      },
      {
        "name": "Egg",
        "quantity": "8"
      },
      {
        "name": "Parsley",
        "quantity": "2 1/2 Tbs"
      },
      {
        "name": "Salt Cod",
        "quantity": "300g"
      }
    ],
    "cuisineType": "spanish",
    "mealType": "seafood",
    "difficultyLevel": "medium",
    "prepTime": 30,
    "cookTime": 45,
    "servings": 4,
    "tags": []
  },
  {
    "name": "French Onion Soup",
    "description": "Melt the butter with the oil in a large heavy-based pan. Add the onions and fry with the lid on for ...",
    "imageUrl": "https://www.themealdb.com/images/media/meals/xvrrux1511783685.jpg",
    "instructions": [
      "Melt the butter with the oil in a large heavy-based pan. Add the onions and fry with the lid on for 10 mins until soft. Sprinkle in the sugar and cook for 20 mins more, stirring frequently, until caramelised. The onions should be really golden, full of flavour and soft when pinched between your fingers. Take care towards the end to ensure that they don’t burn.",
      "Add the garlic for the final few mins of the onions’ cooking time, then sprinkle in the flour and stir well. Increase the heat and keep stirring as you gradually add the wine, followed by the hot stock. Cover and simmer for 15-20 mins.",
      "To serve, turn on the grill, and toast the bread. Ladle the soup into heatproof bowls. Put a slice or two of toast on top of the bowls of soup, and pile on the cheese. Grill until melted. Alternatively, you can complete the toasts under the grill, then serve them on top."
    ],
    "ingredients": [
      {
        "name": "Butter",
        "quantity": "50g"
      },
      {
        "name": "Olive Oil",
        "quantity": "1 tbs"
      },
      {
        "name": "Onion",
        "quantity": "1 kg"
      },
      {
        "name": "Sugar",
        "quantity": "1 tsp"
      },
      {
        "name": "Garlic Clove",
        "quantity": "4 sliced"
      },
      {
        "name": "Plain Flour",
        "quantity": "2 tbs"
      },
      {
        "name": "Dry White Wine",
        "quantity": "250ml"
      },
      {
        "name": "Beef Stock",
        "quantity": "1L"
      },
      {
        "name": "Bread",
        "quantity": "4 sliced"
      },
      {
        "name": "Gruyère",
        "quantity": "140g"
      }
    ],
    "cuisineType": "french",
    "mealType": "side",
    "difficultyLevel": "medium",
    "prepTime": 30,
    "cookTime": 45,
    "servings": 4,
    "tags": [
      "soup"
    ]
  },
  {
    "name": "Carrot Cake",
    "description": "For the carrot cake, preheat the oven to 160C/325F/Gas 3. Grease and line a 26cm/10in springform cak...",
    "imageUrl": "https://www.themealdb.com/images/media/meals/vrspxv1511722107.jpg",
    "instructions": [
      "For the carrot cake, preheat the oven to 160C/325F/Gas 3. Grease and line a 26cm/10in springform cake tin.",
      "Mix all of the ingredients for the carrot cake, except the carrots and walnuts, together in a bowl until well combined. Stir in the carrots and walnuts.",
      "Spoon the mixture into the cake tin and bake for 1 hour 15 minutes, or until a skewer inserted into the middle comes out clean. Remove the cake from the oven and set aside to cool for 10 minutes, then carefully remove the cake from the tin and set aside to cool completely on a cooling rack.",
      "Meanwhile, for the icing, beat the cream cheese, caster sugar and butter together in a bowl until fluffy. Spread the icing over the top of the cake with a palette knife."
    ],
    "ingredients": [
      {
        "name": "Vegetable Oil",
        "quantity": "450ml"
      },
      {
        "name": "Plain Flour",
        "quantity": "400g"
      },
      {
        "name": "Bicarbonate Of Soda",
        "quantity": "2 tsp"
      },
      {
        "name": "Sugar",
        "quantity": "550ml"
      },
      {
        "name": "Eggs",
        "quantity": "5"
      },
      {
        "name": "Salt",
        "quantity": "½ tsp"
      },
      {
        "name": "Cinnamon",
        "quantity": "2 tsp"
      },
      {
        "name": "Carrots",
        "quantity": "500g grated"
      },
      {
        "name": "Walnuts",
        "quantity": "150g"
      },
      {
        "name": "Cream Cheese",
        "quantity": "200g"
      },
      {
        "name": "Caster Sugar",
        "quantity": "150g"
      },
      {
        "name": "Butter",
        "quantity": "100g"
      }
    ],
    "cuisineType": "british",
    "mealType": "dessert",
    "difficultyLevel": "medium",
    "prepTime": 30,
    "cookTime": 45,
    "servings": 4,
    "tags": [
      "cake",
      "treat",
      "sweet"
    ]
  },
  {
    "name": "Spiced tortilla",
    "description": "step 1\r\nHeat the oil in a large frying pan. Fry the onion and half the chilli for 5 mins until softe...",
    "imageUrl": "https://www.themealdb.com/images/media/meals/7b862e1763194846.jpg",
    "instructions": [
      "step 1",
      "Heat the oil in a large frying pan. Fry the onion and half the chilli for 5 mins until softened. Tip in the spices, fry for 1 min more, then add the cherry tomatoes, potatoes and coriander stalks to the pan. Season the eggs well, pour over the top of the veg and leave to cook gently for 8-10 mins until almost set.",
      "step 2",
      "Heat the grill and flash the tortilla underneath for 1-2 mins until the top is set. Scatter the coriander leaves and remaining chilli over the top, slice into wedges and serve with a green salad."
    ],
    "ingredients": [
      {
        "name": "Sunflower Oil",
        "quantity": "1 tbsp"
      },
      {
        "name": "Onion",
        "quantity": "1"
      },
      {
        "name": "Red Chilli",
        "quantity": "1"
      },
      {
        "name": "Curry Powder",
        "quantity": "2 teaspoon"
      },
      {
        "name": "Cherry Tomatoes",
        "quantity": "300g"
      },
      {
        "name": "Potatoes",
        "quantity": "500g"
      },
      {
        "name": "Coriander",
        "quantity": "Bunch"
      },
      {
        "name": "Egg",
        "quantity": "8"
      }
    ],
    "cuisineType": "spanish",
    "mealType": "vegetarian",
    "difficultyLevel": "medium",
    "prepTime": 30,
    "cookTime": 45,
    "servings": 4,
    "tags": []
  },
  {
    "name": "Home-made Mandazi",
    "description": "This is one recipe a lot of people have requested and I have tried to make it as simple as possible ...",
    "imageUrl": "https://www.themealdb.com/images/media/meals/thazgm1555350962.jpg",
    "instructions": [
      "This is one recipe a lot of people have requested and I have tried to make it as simple as possible and I hope it will work for you. Make sure you use the right flour which is basically one with raising agents. Adjust the amount of sugar to your taste and try using different flavours to have variety whenever you have them.",
      "You can use Coconut milk instead of regular milk, you can also add desiccated coconut to the dry flour or other spices like powdered cloves or cinnamon.",
      "For “healthy looking” mandazis do not roll the dough too thin before frying and use the procedure I have indicated above.",
      "1. Mix the flour,cinnamon and sugar in a suitable bowl.",
      "2. In a separate bowl whisk the egg into the milk",
      "3. Make a well at the centre of the flour and add the milk and egg mixture and slowly mix to form a dough.",
      "4. Knead the dough for 3-4 minutes or until it stops sticking to the sides of the bowl and you have a smooth surface.",
      "5. Cover the dough with a damp cloth  and allow to rest for 15 minutes.",
      "6. Roll the dough on a lightly floured surface into a 1cm thick piece.",
      "7. Using a sharp small knife, cut the dough into the desired size setting aside ready for deep frying.",
      "8. Heat your oil in a suitable pot and gently dip the mandazi pieces to cook until light brown on the first side then turn to cook on the second side.",
      "9. Serve them warm or cold"
    ],
    "ingredients": [
      {
        "name": "Self-raising Flour",
        "quantity": "750g"
      },
      {
        "name": "Sugar",
        "quantity": "6 tablespoons"
      },
      {
        "name": "Eggs",
        "quantity": "2"
      },
      {
        "name": "Milk",
        "quantity": "1 cup"
      }
    ],
    "cuisineType": "kenyan",
    "mealType": "breakfast",
    "difficultyLevel": "medium",
    "prepTime": 30,
    "cookTime": 45,
    "servings": 4,
    "tags": [
      "baking",
      "breakfast",
      "egg",
      "warm",
      "snack"
    ]
  },
  {
    "name": "Snert (Dutch Split Pea Soup)",
    "description": "Gather the ingredients.\r\n\r\nIn a large soup pot, bring water, split peas, pork belly or bacon, pork c...",
    "imageUrl": "https://www.themealdb.com/images/media/meals/9ptx0a1565090843.jpg",
    "instructions": [
      "Gather the ingredients.",
      "In a large soup pot, bring water, split peas, pork belly or bacon, pork chop, and bouillon cube to a boil. Reduce the heat to a simmer, cover and let cook for 45 minutes, stirring occasionally and skimming off any foam that rises to the top. ",
      "Remove the pork chop, debone, and thinly slice the meat. Set aside.",
      "Add the celery, carrots, potato, onion, leek, and celeriac to the soup. Return to the boil, reduce the heat to a simmer and let cook, uncovered, for another 30 minutes, adding a little extra water if the ingredients start to stick to the bottom of the pot.",
      "Add the smoked sausage for the last 15 minutes of cooking time. When the vegetables are tender, remove the bacon and smoked sausage, slice thinly and set aside.",
      "If you prefer a smooth consistency, purée the soup with a stick blender. Season to taste with salt and pepper. Add the meat back to the soup, setting some slices of rookworst aside.",
      "Serve in heated bowls or soup plates, garnished with slices of rookworst and chopped celery leaf.",
      "Enjoy!"
    ],
    "ingredients": [
      {
        "name": "Water",
        "quantity": "2L"
      },
      {
        "name": "Peas",
        "quantity": "300g"
      },
      {
        "name": "Pork",
        "quantity": "100g"
      },
      {
        "name": "Vegetable Stock Cube",
        "quantity": "1"
      },
      {
        "name": "Celery",
        "quantity": "2"
      },
      {
        "name": "Carrots",
        "quantity": "2"
      },
      {
        "name": "Potatoes",
        "quantity": "1 large"
      },
      {
        "name": "Onion",
        "quantity": "1 small"
      },
      {
        "name": "Leek",
        "quantity": "1 small"
      },
      {
        "name": "Celeriac",
        "quantity": "1 cup"
      },
      {
        "name": "Sausages",
        "quantity": "1 pound"
      }
    ],
    "cuisineType": "dutch",
    "mealType": "side",
    "difficultyLevel": "medium",
    "prepTime": 30,
    "cookTime": 45,
    "servings": 4,
    "tags": [
      "soup",
      "cake"
    ]
  },
  {
    "name": "Mustard champ",
    "description": "STEP 1\r\nBoil the potatoes for 15 mins or until tender. Drain, then mash.\r\n\r\nSTEP 2\r\nHeat the milk an...",
    "imageUrl": "https://www.themealdb.com/images/media/meals/o7p9581608589317.jpg",
    "instructions": [
      "STEP 1",
      "Boil the potatoes for 15 mins or until tender. Drain, then mash.",
      "STEP 2",
      "Heat the milk and half the butter in the corner of the pan, then beat into the mash, along with the wholegrain mustard.",
      "STEP 3",
      "Gently fry the spring onions in the remaining butter for 2 mins until just soft but still a perky green. Fold into the mash and serve. Great with gammon or to top a fish pie."
    ],
    "ingredients": [
      {
        "name": "Potatoes",
        "quantity": "1kg"
      },
      {
        "name": "Milk",
        "quantity": "200ml"
      },
      {
        "name": "Butter",
        "quantity": "50g"
      },
      {
        "name": "Mustard",
        "quantity": "2 tbs"
      },
      {
        "name": "Spring Onions",
        "quantity": "Bunch"
      },
      {
        "name": "Spring Onions",
        "quantity": "Bunch"
      }
    ],
    "cuisineType": "irish",
    "mealType": "side",
    "difficultyLevel": "medium",
    "prepTime": 30,
    "cookTime": 45,
    "servings": 4,
    "tags": []
  },
  {
    "name": "Tall Skoleboller",
    "description": "▢\r\nHeat the milk until it's lukewarm. Add the yeast and dissolve.\r\n▢\r\nAdd the sugar, cardamom, vanil...",
    "imageUrl": "https://www.themealdb.com/images/media/meals/xihiu41762773169.jpg",
    "instructions": [
      "▢",
      "Heat the milk until it's lukewarm. Add the yeast and dissolve.",
      "▢",
      "Add the sugar, cardamom, vanilla, and about 2/3 of the flour.",
      "▢",
      "Mix the dough together either by hand or in a mixer with a dough hook, slowly adding the rest of the flour. You might need a bit more or less flour to form dough that isn't too sticky to knead. When the dough forms a nice ball, add the softened butter and continue to knead the dough for about ten minutes.",
      "▢",
      "Roll the dough into a cylinder and cut into six equal parts. Roll each piece into a round bun and set them in a greased muffin/cake tin. Cover and let rise until doubled in size (about an hour)."
    ],
    "ingredients": [
      {
        "name": "Milk",
        "quantity": "1 cup"
      },
      {
        "name": "Instant Yeast",
        "quantity": "3 tsp"
      },
      {
        "name": "Granulated Sugar",
        "quantity": "1-⅓ cups"
      },
      {
        "name": "Cardamom",
        "quantity": "1 tsp"
      },
      {
        "name": "Vanilla Extract",
        "quantity": "1 teaspoon"
      },
      {
        "name": "Flour",
        "quantity": "2 1/4 cups"
      },
      {
        "name": "Butter",
        "quantity": "5 tblsp"
      },
      {
        "name": "Milk",
        "quantity": "1 1/4 cup"
      },
      {
        "name": "Granulated Sugar",
        "quantity": "1-⅓ cups"
      },
      {
        "name": "Egg Yolks",
        "quantity": "3"
      },
      {
        "name": "Cornstarch",
        "quantity": "2 tblsp"
      },
      {
        "name": "vanilla pod",
        "quantity": "1"
      },
      {
        "name": "Powdered Sugar",
        "quantity": "2 cups"
      },
      {
        "name": "Water",
        "quantity": "3  tablespoons"
      },
      {
        "name": "Shredded Coconut",
        "quantity": "1 cup"
      }
    ],
    "cuisineType": "norwegian",
    "mealType": "dessert",
    "difficultyLevel": "medium",
    "prepTime": 30,
    "cookTime": 45,
    "servings": 4,
    "tags": []
  },
  {
    "name": "Sweet and Sour Pork",
    "description": "Preparation\r\n1. Crack the egg into a bowl. Separate the egg white and yolk.\r\n\r\nSweet and Sour Pork\r\n...",
    "imageUrl": "https://www.themealdb.com/images/media/meals/1529442316.jpg",
    "instructions": [
      "Preparation",
      "1. Crack the egg into a bowl. Separate the egg white and yolk.",
      "Sweet and Sour Pork",
      "2. Slice the pork tenderloin into strips.",
      "3. Prepare the marinade using a pinch of salt, one teaspoon of starch, two teaspoons of light soy sauce, and an egg white.",
      "4. Marinade the pork strips for about 20 minutes.",
      "5. Put the remaining starch in a bowl. Add some water and vinegar to make a starchy sauce.",
      "Sweet and Sour Pork",
      "Cooking Instructions",
      "1. Pour the cooking oil into a wok and heat to 190°C (375°F). Add the marinated pork strips and fry them until they turn brown. Remove the cooked pork from the wok and place on a plate.",
      "2. Leave some oil in the wok. Put the tomato sauce and white sugar into the wok, and heat until the oil and sauce are fully combined.",
      "3. Add some water to the wok and thoroughly heat the sweet and sour sauce before adding the pork strips to it.",
      "4. Pour in the starchy sauce. Stir-fry all the ingredients until the pork and sauce are thoroughly mixed together.",
      "5. Serve on a plate and add some coriander for decoration."
    ],
    "ingredients": [
      {
        "name": "Pork",
        "quantity": "200g"
      },
      {
        "name": "Egg",
        "quantity": "1"
      },
      {
        "name": "Water",
        "quantity": "Dash"
      },
      {
        "name": "Salt",
        "quantity": "1/2 tsp"
      },
      {
        "name": "Sugar",
        "quantity": "1 tsp"
      },
      {
        "name": "Soy Sauce",
        "quantity": "10g"
      },
      {
        "name": "Starch",
        "quantity": "10g"
      },
      {
        "name": "Tomato Puree",
        "quantity": "30g"
      },
      {
        "name": "Vinegar",
        "quantity": "10g"
      },
      {
        "name": "Coriander",
        "quantity": "Dash"
      }
    ],
    "cuisineType": "chinese",
    "mealType": "pork",
    "difficultyLevel": "medium",
    "prepTime": 30,
    "cookTime": 45,
    "servings": 4,
    "tags": [
      "sweet"
    ]
  },
  {
    "name": "Bread omelette",
    "description": "Make and enjoy...",
    "imageUrl": "https://www.themealdb.com/images/media/meals/hqaejl1695738653.jpg",
    "instructions": [
      "Make and enjoy"
    ],
    "ingredients": [
      {
        "name": "Bread",
        "quantity": "2"
      },
      {
        "name": "Egg",
        "quantity": "2"
      },
      {
        "name": "Salt",
        "quantity": "0.5"
      }
    ],
    "cuisineType": "indian",
    "mealType": "breakfast",
    "difficultyLevel": "medium",
    "prepTime": 30,
    "cookTime": 45,
    "servings": 4,
    "tags": []
  },
  {
    "name": "Seri muka kuih",
    "description": "Soak glutinous rice with water for at least 1 ½ hours prior to using. Drain.\r\nPrepare a 9-inch round...",
    "imageUrl": "https://www.themealdb.com/images/media/meals/6ut2og1619790195.jpg",
    "instructions": [
      "Soak glutinous rice with water for at least 1 ½ hours prior to using. Drain.",
      "Prepare a 9-inch round or square cake pan and spray with cooking spray or line with plastic wrap.",
      "Mix coconut milk, water, salt and the rice. Pour it into cake pan, topped with the pandan knots.",
      "Steam for 30 minutes.",
      "After 30 minutes, fluff up the rice and remove pandan knots. Then, using a greased spatula, flatten the steamed rice. Make sure there are no holes/air bubbles and gaps in the rice, especially the sides.",
      "Steam for another 10 minutes.",
      "Combine pandan juice, coconut milk, all purpose flour, cornflour, and sugar. Mix well.",
      "Add eggs and whisk well then strain into a medium sized metal bowl or pot.",
      "Place pandan mixture over simmering water (double boiler or bain-marie)",
      "Stir continuously and cook till custard starts to thicken. (15 minutes)",
      "Pour pandan custard into glutinous rice layer, give it a little tap (for air bubbles) and continue to steam for 30 minutes.",
      "Remove kuih seri muka from the steamer and allow to cool completely before cutting into rectangles or diamond shapes."
    ],
    "ingredients": [
      {
        "name": "Rice",
        "quantity": "400g"
      },
      {
        "name": "Coconut Milk",
        "quantity": "150ml"
      },
      {
        "name": "Water",
        "quantity": "100ml"
      },
      {
        "name": "Salt",
        "quantity": "1 tsp"
      },
      {
        "name": "Corn Flour",
        "quantity": "5 tbs"
      },
      {
        "name": "Flour",
        "quantity": "3 tbs"
      },
      {
        "name": "Eggs",
        "quantity": "3"
      },
      {
        "name": "Coconut Cream",
        "quantity": "200ml"
      },
      {
        "name": "Sugar",
        "quantity": "140g"
      }
    ],
    "cuisineType": "malaysian",
    "mealType": "dessert",
    "difficultyLevel": "medium",
    "prepTime": 30,
    "cookTime": 45,
    "servings": 4,
    "tags": []
  },
  {
    "name": "Laksa King Prawn Noodles",
    "description": "Heat the oil in a medium saucepan and add the chilli. Cook for 1 min, then add the curry paste, stir...",
    "imageUrl": "https://www.themealdb.com/images/media/meals/rvypwy1503069308.jpg",
    "instructions": [
      "Heat the oil in a medium saucepan and add the chilli. Cook for 1 min, then add the curry paste, stir and cook for 1 min more. Dissolve the stock cube in a large jug in 700ml boiling water, then pour into the pan and stir to combine. Tip in the coconut milk and bring to the boil.",
      "Add the fish sauce and a little seasoning. Toss in the noodles and cook for a further 3-4 mins until softening. Squeeze in the lime juice, add the prawns and cook through until warm, about 2-3 mins. Scatter over some of the coriander.",
      "Serve in bowls with the remaining coriander and lime wedges on top for squeezing over."
    ],
    "ingredients": [
      {
        "name": "Olive Oil",
        "quantity": "1 tbsp"
      },
      {
        "name": "Red Chilli",
        "quantity": "1 finely sliced"
      },
      {
        "name": "Thai red curry paste",
        "quantity": "2 ½ tbsp"
      },
      {
        "name": "vegetable stock cube",
        "quantity": "1"
      },
      {
        "name": "coconut milk",
        "quantity": "400ml can"
      },
      {
        "name": "fish sauce",
        "quantity": "2 tsp"
      },
      {
        "name": "rice noodles",
        "quantity": "100g"
      },
      {
        "name": "lime",
        "quantity": "2 juice of 1, the other halved"
      },
      {
        "name": "king prawns",
        "quantity": "150g"
      },
      {
        "name": "coriander",
        "quantity": "½ small pack"
      }
    ],
    "cuisineType": "malaysian",
    "mealType": "seafood",
    "difficultyLevel": "medium",
    "prepTime": 30,
    "cookTime": 45,
    "servings": 4,
    "tags": [
      "shellfish",
      "seafood"
    ]
  },
  {
    "name": "Katsu Chicken curry",
    "description": "Prep:15min  ›  Cook:30min  ›  Ready in:45min \r\n\r\nFor the curry sauce: Heat oil in medium non-stick s...",
    "imageUrl": "https://www.themealdb.com/images/media/meals/vwrpps1503068729.jpg",
    "instructions": [
      "Prep:15min  ›  Cook:30min  ›  Ready in:45min ",
      "For the curry sauce: Heat oil in medium non-stick saucepan, add onion and garlic and cook until softened. Stir in carrots and cook over low heat for 10 to 12 minutes.",
      "Add flour and curry powder; cook for 1 minute. Gradually stir in stock until combined; add honey, soy sauce and bay leaf. Slowly bring to the boil.",
      "Turn down heat and simmer for 20 minutes or until sauce thickens but is still of pouring consistency. Stir in garam masala. Pour the curry sauce through a sieve; return to saucepan and keep on low heat until ready to serve.",
      "For the chicken: Season both sides of chicken breasts with salt and pepper. Place flour, egg and breadcrumbs in separate bowls and arrange in a row. Coat the chicken breasts in flour, then dip them into the egg, then coat in breadcrumbs, making sure you cover both sides.",
      "Heat oil in large frying pan over medium-high heat. Place chicken into hot oil and cook until golden brown, about 3 or 4 minutes each side. Once cooked, place on kitchen paper to absorb excess oil.",
      "Pour curry sauce over chicken, serve with white rice and enjoy!"
    ],
    "ingredients": [
      {
        "name": "chicken breast",
        "quantity": "4 pounded to 1cm thickness"
      },
      {
        "name": "plain flour",
        "quantity": "2 tablespoons"
      },
      {
        "name": "egg",
        "quantity": "1 beaten"
      },
      {
        "name": "breadcrumbs",
        "quantity": "100g fine"
      },
      {
        "name": "vegetable oil",
        "quantity": "230ml frying"
      },
      {
        "name": "sunflower oil",
        "quantity": "2 tablespoons"
      },
      {
        "name": "onions",
        "quantity": "2 sliced"
      },
      {
        "name": "garlic",
        "quantity": "5 chopped cloves"
      },
      {
        "name": "carrot",
        "quantity": "2 sliced"
      },
      {
        "name": "plain flour",
        "quantity": "2 tablespoons"
      },
      {
        "name": "curry powder",
        "quantity": "4 teaspoons"
      },
      {
        "name": "chicken stock",
        "quantity": "600ml"
      },
      {
        "name": "honey",
        "quantity": "2 teaspoons"
      },
      {
        "name": "soy sauce",
        "quantity": "4 teaspoons"
      },
      {
        "name": "bay leaf",
        "quantity": "1"
      },
      {
        "name": "garam masala",
        "quantity": "1 teaspoon"
      }
    ],
    "cuisineType": "japanese",
    "mealType": "chicken",
    "difficultyLevel": "medium",
    "prepTime": 30,
    "cookTime": 45,
    "servings": 4,
    "tags": [
      "curry",
      "meat"
    ]
  },
  {
    "name": "Smoked Haddock Kedgeree",
    "description": "Melt 50g butter in a large saucepan (about 20cm across), add 1 finely chopped medium onion and cook ...",
    "imageUrl": "https://www.themealdb.com/images/media/meals/1550441275.jpg",
    "instructions": [
      "Melt 50g butter in a large saucepan (about 20cm across), add 1 finely chopped medium onion and cook gently over a medium heat for 5 minutes, until softened but not browned.",
      "Stir in 3 split cardamom pods, ¼ tsp turmeric, 1 small cinnamon stick and 2 bay leaves, then cook for 1 minute.",
      "Tip in 450g basmati rice and stir until it is all well coated in the spicy butter.",
      "Pour in 1 litre chicken or fish stock, add ½ teaspoon salt and bring to the boil, stir once to release any rice from the bottom of the pan. Cover with a close-fitting lid, reduce the heat to low and leave to cook very gently for 12 minutes.",
      "Meanwhile, bring some water to the boil in a large shallow pan. Add 750g un-dyed smoked haddock fillet and simmer for 4 minutes, until the fish is just cooked. Lift it out onto a plate and leave until cool enough to handle.",
      "Hard-boil 3 eggs for 8 minutes.",
      "Flake the fish, discarding any skin and bones. Drain the eggs, cool slightly, then peel and chop. ",
      "Uncover the rice and remove the bay leaves, cinnamon stick and cardamom pods if you wish to. Gently fork in the fish and the chopped eggs, cover again and return to the heat for 2-3 minutes, or until the fish has heated through.",
      "Gently stir in almost all the 3 tbsp chopped fresh parsley, and season with a little salt and black pepper to taste. Serve scattered with the remaining parsley and garnished with 1 lemon, cut into wedges."
    ],
    "ingredients": [
      {
        "name": "Butter",
        "quantity": "50g"
      },
      {
        "name": "Onion",
        "quantity": "1 chopped"
      },
      {
        "name": "Cardamom",
        "quantity": "3 Pods"
      },
      {
        "name": "Turmeric",
        "quantity": "1/4 tsp"
      },
      {
        "name": "Cinnamon Stick",
        "quantity": "1 small"
      },
      {
        "name": "Bay Leaf",
        "quantity": "Sprigs of fresh"
      },
      {
        "name": "Basmati Rice",
        "quantity": "450g"
      },
      {
        "name": "Chicken Stock",
        "quantity": "1 Litre"
      },
      {
        "name": "Smoked Haddock",
        "quantity": "750g"
      },
      {
        "name": "Eggs",
        "quantity": "3"
      },
      {
        "name": "Parsley",
        "quantity": "3 tblsp chopped"
      },
      {
        "name": "Lemon",
        "quantity": "1 chopped"
      }
    ],
    "cuisineType": "indian",
    "mealType": "breakfast",
    "difficultyLevel": "medium",
    "prepTime": 30,
    "cookTime": 45,
    "servings": 4,
    "tags": [
      "brunch",
      "fish",
      "fusion"
    ]
  },
  {
    "name": "Split Pea Soup",
    "description": "Put the gammon in a very large pan with 2 litres water and bring to the boil. Remove from the heat a...",
    "imageUrl": "https://www.themealdb.com/images/media/meals/xxtsvx1511814083.jpg",
    "instructions": [
      "Put the gammon in a very large pan with 2 litres water and bring to the boil. Remove from the heat and drain off the water – this helps to get rid of some of the saltiness. Recover with 2 litres cold water and bring to the boil again. Put everything but the frozen peas into the pan and bring to the boil. Reduce to a simmer and cook for 1½-2½ hrs, topping up the water as and when you need to, to a similar level it started at. As the ham cooks and softens, you can halve it if you want, so it is all submerged under the liquid. When the ham is tender enough to pull into shreds, it is ready.",
      "Lift out the ham, peel off and discard the skin. While it is still hot (wear a clean pair of rubber gloves), shred the meat. Remove bay from the soup and stir in the frozen peas. Simmer for 1 min, then blend until smooth. Add a splash of water if too thick, and return to the pan to heat through if it has cooled, or if you are making ahead.",
      "When you are ready to serve, mix the hot soup with most of the ham – gently reheat if made ahead. Serve in bowls with the remaining ham scattered on top, and eat with crusty bread and butter."
    ],
    "ingredients": [
      {
        "name": "Ham",
        "quantity": "1kg"
      },
      {
        "name": "Peas",
        "quantity": "200g (soaked overnight)"
      },
      {
        "name": "Onions",
        "quantity": "2 chopped"
      },
      {
        "name": "Carrots",
        "quantity": "2 chopped"
      },
      {
        "name": "Bay Leaves",
        "quantity": "2"
      },
      {
        "name": "Celery",
        "quantity": "1 chopped"
      },
      {
        "name": "Frozen Peas",
        "quantity": "300g"
      },
      {
        "name": "Bread",
        "quantity": "to serve"
      }
    ],
    "cuisineType": "canadian",
    "mealType": "side",
    "difficultyLevel": "medium",
    "prepTime": 30,
    "cookTime": 45,
    "servings": 4,
    "tags": [
      "soup",
      "warm"
    ]
  },
  {
    "name": "Coddled pork with cider",
    "description": "STEP 1\r\nHeat the butter in a casserole dish until sizzling, then fry the pork for 2-3 mins on each s...",
    "imageUrl": "https://www.themealdb.com/images/media/meals/7vpsfp1608588991.jpg",
    "instructions": [
      "STEP 1",
      "Heat the butter in a casserole dish until sizzling, then fry the pork for 2-3 mins on each side until browned. Remove from the pan.",
      "STEP 2",
      "Tip the bacon, carrot, potatoes and swede into the pan, then gently fry until slightly coloured. Stir in the cabbage, sit the chops back on top, add the bay leaf, then pour over the cider and stock. Cover the pan, then leave everything to gently simmer for 20 mins until the pork is cooked through and the vegetables are tender.",
      "STEP 3",
      "Serve at the table spooned straight from the dish."
    ],
    "ingredients": [
      {
        "name": "Butter",
        "quantity": "Knob"
      },
      {
        "name": "Pork Chops",
        "quantity": "2"
      },
      {
        "name": "Bacon",
        "quantity": "4"
      },
      {
        "name": "Potatoes",
        "quantity": "2"
      },
      {
        "name": "Carrots",
        "quantity": "1"
      },
      {
        "name": "Swede",
        "quantity": "1/2"
      },
      {
        "name": "Cabbage",
        "quantity": "1/2"
      },
      {
        "name": "Bay Leaf",
        "quantity": "1"
      },
      {
        "name": "Cider",
        "quantity": "100ml"
      },
      {
        "name": "Chicken Stock",
        "quantity": "100g"
      }
    ],
    "cuisineType": "irish",
    "mealType": "pork",
    "difficultyLevel": "medium",
    "prepTime": 30,
    "cookTime": 45,
    "servings": 4,
    "tags": []
  },
  {
    "name": "Sticky Toffee Pudding Ultimate",
    "description": "Stone and chop the dates quite small, put them in a bowl, then pour the boiling water over. Leave fo...",
    "imageUrl": "https://www.themealdb.com/images/media/meals/xrptpq1483909204.jpg",
    "instructions": [
      "Stone and chop the dates quite small, put them in a bowl, then pour the boiling water over. Leave for about 30 mins until cool and well-soaked, then mash a bit with a fork. Stir in the vanilla extract. Butter and flour seven mini pudding tins (each about 200ml/7fl oz) and sit them on a baking sheet. Heat oven to 180C/fan 160C/gas 4.",
      "While the dates are soaking, make the puddings. Mix the flour and bicarbonate of soda together and beat the eggs in a separate bowl. Beat the butter and sugar together in a large bowl for a few mins until slightly creamy (the mixture will be grainy from the sugar). Add the eggs a little at a time, beating well between additions. Beat in the black treacle then, using a large metal spoon, gently fold in one-third of the flour, then half the milk, being careful not to overbeat. Repeat until all the flour and milk is used. Stir the soaked dates into the pudding batter. The mix may look a little curdled at this point and will be like a soft, thick batter. Spoon it evenly between the tins and bake for 20-25 mins, until risen and firm.",
      "Meanwhile, put the sugar and butter for the sauce in a medium saucepan with half the cream. Bring to the boil over a medium heat, stirring all the time, until the sugar has completely dissolved. Stir in the black treacle, turn up the heat slightly and let the mixture bubble away for 2-3 mins until it is a rich toffee colour, stirring occasionally to make sure it doesn’t burn. Take the pan off the heat and beat in the rest of the cream.",
      "Remove the puddings from the oven. Leave in the tins for a few mins, then loosen them well from the sides of the tins with a small palette knife before turning them out. You can serve them now with the sauce drizzled over, but they’ll be even stickier if left for a day or two coated in the sauce. To do this, pour about half the sauce into one or two ovenproof serving dishes. Sit the upturned puddings on the sauce, then pour the rest of the sauce over them. Cover with a loose tent of foil so that the sauce doesn’t smudge (no need to chill).",
      "When ready to serve, heat oven to 180C/fan 160C/gas 4. Warm the puddings through, still covered, for 15-20 mins or until the sauce is bubbling. Serve them on their own, or with cream or custard."
    ],
    "ingredients": [
      {
        "name": "Medjool dates",
        "quantity": "225g"
      },
      {
        "name": "water",
        "quantity": "175ml Boiling"
      },
      {
        "name": "vanilla extract",
        "quantity": "1 tsp"
      },
      {
        "name": "self-raising flour",
        "quantity": "175g"
      },
      {
        "name": "bicarbonate of soda",
        "quantity": "1 tsp"
      },
      {
        "name": "eggs",
        "quantity": "2"
      },
      {
        "name": "butter",
        "quantity": "85g"
      },
      {
        "name": "demerara sugar",
        "quantity": "140g"
      },
      {
        "name": "black treacle",
        "quantity": "2 tbsp"
      },
      {
        "name": "milk",
        "quantity": "100ml"
      },
      {
        "name": "ice cream",
        "quantity": "1 scoop"
      },
      {
        "name": "muscovado sugar",
        "quantity": "175g"
      },
      {
        "name": "butter",
        "quantity": "50g"
      },
      {
        "name": "double cream",
        "quantity": "225ml"
      },
      {
        "name": "black treacle",
        "quantity": "1 tbsp"
      }
    ],
    "cuisineType": "british",
    "mealType": "dessert",
    "difficultyLevel": "medium",
    "prepTime": 30,
    "cookTime": 45,
    "servings": 4,
    "tags": [
      "pudding",
      "desert",
      "cake",
      "dairy"
    ]
  },
  {
    "name": "Red Peas Soup",
    "description": "Wash and rinse the dried kidney beans.. then cover with water in a deep bowl. Remember as they soak ...",
    "imageUrl": "https://www.themealdb.com/images/media/meals/sqpqtp1515365614.jpg",
    "instructions": [
      "Wash and rinse the dried kidney beans.. then cover with water in a deep bowl. Remember as they soak they will expand to at least triple the size they were originally so add a lot of water to the bowl. Soak them overnight or for at least 2 hrs to make the cooking step go quicker. I tossed out the water they were soaked in after it did the job.",
      "Have your butcher cut the salted pigtail into 2 inch pieces as it will be very difficult to cut with an ordinary kitchen knife. Wash, then place a deep pot with water and bring to a boil. Cook for 20 minutes, then drain + rinse and repeat (boil again in water). The goal is to make the pieces of pig tails tender and to remove most of the salt it was cured in.",
      "Time to start the soup. Place everything in the pot (except the flour and potato), then cover with water and place on a high flame to bring to a boil. As it comes to a boil, skim off any scum/froth at the top and discard. Reduce the heat to a gentle boil and allow it to cook for 1 hr and 15 mins.. basically until the beans are tender and start falling apart.",
      "It’s now time to add the potato (and Yams etc if you’re adding it) as well as the coconut milk and continue cooking for 15 minutes.",
      "Now is a good time to start making the basic dough for the spinner dumplings. Mix the flour and water (add a pinch of salt if you want) until you have a soft/smooth dough. allow it to rest for 5 minutes, then pinch of a tablespoon at a time and roll between your hands to form a cigarette shape.",
      "Add them to the pot, stir well and continue cooking for another 15 minutes on a rolling boil.",
      "You’ll notice that I didn’t add any salt to the pot as the remaining salt from the salted pigtails will be enough to properly season this dish. However you can taste and adjust accordingly. Lets recap the timing part of things so you’re not confused. Cook the base of the soup for 1 hr and 15 minute or until tender, then add the potatoes and cook for 15 minutes, then add the dumplings and cook for a further 15 minutes. Keep in mind that this soup will thicken quite a bit as it cools.",
      "While this is not a traditional recipe to any one specific island, versions of this soup (sometimes called stewed peas) can be found throughout the Caribbean, Latin America and Africa. A hearty bowl of this soup will surely give you the sleepies (some may call it ethnic fatigue). You can certainly freeze the leftovers and heat it up another day."
    ],
    "ingredients": [
      {
        "name": "Kidney Beans",
        "quantity": "2 cups"
      },
      {
        "name": "Carrots",
        "quantity": "1 large"
      },
      {
        "name": "Spring Onions",
        "quantity": "2 chopped"
      },
      {
        "name": "Thyme",
        "quantity": "4 sprigs"
      },
      {
        "name": "Onion",
        "quantity": "1 Diced"
      },
      {
        "name": "Black Pepper",
        "quantity": "1/2 tsp"
      },
      {
        "name": "Red Pepper",
        "quantity": "2 chopped"
      },
      {
        "name": "Garlic Clove",
        "quantity": "4 Mashed"
      },
      {
        "name": "Allspice",
        "quantity": "1 tbs"
      },
      {
        "name": "Beef",
        "quantity": "2 Lbs"
      },
      {
        "name": "Water",
        "quantity": "2L"
      },
      {
        "name": "Potatoes",
        "quantity": "4"
      },
      {
        "name": "Plain Flour",
        "quantity": "1 cup"
      },
      {
        "name": "Water",
        "quantity": "1/4 cup"
      },
      {
        "name": "Coconut Milk",
        "quantity": "1 cup"
      }
    ],
    "cuisineType": "jamaican",
    "mealType": "beef",
    "difficultyLevel": "medium",
    "prepTime": 30,
    "cookTime": 45,
    "servings": 4,
    "tags": [
      "soup",
      "sidedish"
    ]
  },
  {
    "name": "Pan-fried hake, white bean & chorizo broth",
    "description": "step 1\r\nDrain the beans, then tip into a large pan with 2 litres of water. Simmer with the whole gar...",
    "imageUrl": "https://www.themealdb.com/images/media/meals/4yjart1763248459.jpg",
    "instructions": [
      "step 1",
      "Drain the beans, then tip into a large pan with 2 litres of water. Simmer with the whole garlic cloves, bay leaves and thyme for 30 mins or until cooked and tender. Remove from the heat and set aside.",
      "step 2",
      "Meanwhile, heat 2 tbsp oil in a frying pan. Fry the bread with the remaining garlic clove. When golden and crisp, scoop out and drain on kitchen paper. Add the chorizo to the pan, fry until crisp, tip out and keep warm with the bread.",
      "step 3",
      "Add another 2 tbsp oil and the onion to the pan, and cook for 5 mins until softened. Stir in the paprika. Drain the beans and add to the onions with the chicken stock and 2 tsp salt. Cook for 5-10 mins. Stir through the parsley and keep warm.",
      "step 4",
      "Season the hake and heat the remaining 2 tbsp oil in the frying pan. Put the hake, skin-side down, in the pan and cook for 3-5 mins over a mediumhigh heat to crisp up the skin. Flip the fish over and cook for a further 3-5 mins until cooked through. Spoon the white bean mix into bowls, place the hake on top and finish with the fried bread, chorizo and a little more thyme."
    ],
    "ingredients": [
      {
        "name": "Dried white beans",
        "quantity": "450g"
      },
      {
        "name": "Garlic",
        "quantity": "4 cloves"
      },
      {
        "name": "Bay Leaves",
        "quantity": "2"
      },
      {
        "name": "Thyme",
        "quantity": "1 teaspoon"
      },
      {
        "name": "Olive Oil",
        "quantity": "6 tablespoons"
      },
      {
        "name": "Bread",
        "quantity": "100g"
      },
      {
        "name": "Chorizo",
        "quantity": "100g"
      },
      {
        "name": "Onion",
        "quantity": "1"
      },
      {
        "name": "Paprika",
        "quantity": "3 tsp"
      },
      {
        "name": "Chicken Stock",
        "quantity": "1 L"
      },
      {
        "name": "Parsley",
        "quantity": "Handful"
      },
      {
        "name": "Hake",
        "quantity": "6"
      }
    ],
    "cuisineType": "spanish",
    "mealType": "seafood",
    "difficultyLevel": "medium",
    "prepTime": 30,
    "cookTime": 45,
    "servings": 4,
    "tags": []
  },
  {
    "name": "Grilled eggplant with coconut milk",
    "description": ".  Prepare the eggplants for grilling by pricking them all over with a fork.  This is so it won’t bu...",
    "imageUrl": "https://www.themealdb.com/images/media/meals/bopa2i1683209167.jpg",
    "instructions": [
      ".  Prepare the eggplants for grilling by pricking them all over with a fork.  This is so it won’t burst during the grilling process as the natural water in it heats up.",
      "2.  Grill the eggplants, turning them over frequently to ensure even cooking.  Grill until the skins are dark brown, even black and the eggplant is soft when you touch it.",
      "3.  Soak the grilled eggplant in a bowl of water to cool it down.  Peel the skin off the eggplant.  Place the whole eggplants in a shallow dish (my mom actually cuts the eggplant into small, bite-sized pieces).",
      " 4.  In a small mixing bowl, mix together the coconut milk or cream, lemon powder, salt and hot pepper.  Mix until the lemon powder and salt dissolve.  Taste, then adjust the amount of lemon powder, salt and hot pepper to your liking.  Pour the mixture over the eggplant.  Sprinkle the green onions over the eggplant and coconut milk.  Stir gently to combine. "
    ],
    "ingredients": [
      {
        "name": "Egg Plants",
        "quantity": "6"
      },
      {
        "name": "Coconut Milk",
        "quantity": "1 can"
      },
      {
        "name": "Lemon Juice",
        "quantity": "1 tbs"
      },
      {
        "name": "Salt",
        "quantity": "1 tsp"
      },
      {
        "name": "Red Pepper Flakes",
        "quantity": "To taste"
      },
      {
        "name": "Onions",
        "quantity": "4 Sticks"
      }
    ],
    "cuisineType": "filipino",
    "mealType": "vegetarian",
    "difficultyLevel": "medium",
    "prepTime": 30,
    "cookTime": 45,
    "servings": 4,
    "tags": []
  },
  {
    "name": "Tall Skoleboller",
    "description": "▢\r\nHeat the milk until it's lukewarm. Add the yeast and dissolve.\r\n▢\r\nAdd the sugar, cardamom, vanil...",
    "imageUrl": "https://www.themealdb.com/images/media/meals/xihiu41762773169.jpg",
    "instructions": [
      "▢",
      "Heat the milk until it's lukewarm. Add the yeast and dissolve.",
      "▢",
      "Add the sugar, cardamom, vanilla, and about 2/3 of the flour.",
      "▢",
      "Mix the dough together either by hand or in a mixer with a dough hook, slowly adding the rest of the flour. You might need a bit more or less flour to form dough that isn't too sticky to knead. When the dough forms a nice ball, add the softened butter and continue to knead the dough for about ten minutes.",
      "▢",
      "Roll the dough into a cylinder and cut into six equal parts. Roll each piece into a round bun and set them in a greased muffin/cake tin. Cover and let rise until doubled in size (about an hour)."
    ],
    "ingredients": [
      {
        "name": "Milk",
        "quantity": "1 cup"
      },
      {
        "name": "Instant Yeast",
        "quantity": "3 tsp"
      },
      {
        "name": "Granulated Sugar",
        "quantity": "1-⅓ cups"
      },
      {
        "name": "Cardamom",
        "quantity": "1 tsp"
      },
      {
        "name": "Vanilla Extract",
        "quantity": "1 teaspoon"
      },
      {
        "name": "Flour",
        "quantity": "2 1/4 cups"
      },
      {
        "name": "Butter",
        "quantity": "5 tblsp"
      },
      {
        "name": "Milk",
        "quantity": "1 1/4 cup"
      },
      {
        "name": "Granulated Sugar",
        "quantity": "1-⅓ cups"
      },
      {
        "name": "Egg Yolks",
        "quantity": "3"
      },
      {
        "name": "Cornstarch",
        "quantity": "2 tblsp"
      },
      {
        "name": "vanilla pod",
        "quantity": "1"
      },
      {
        "name": "Powdered Sugar",
        "quantity": "2 cups"
      },
      {
        "name": "Water",
        "quantity": "3  tablespoons"
      },
      {
        "name": "Shredded Coconut",
        "quantity": "1 cup"
      }
    ],
    "cuisineType": "norwegian",
    "mealType": "dessert",
    "difficultyLevel": "medium",
    "prepTime": 30,
    "cookTime": 45,
    "servings": 4,
    "tags": []
  },
  {
    "name": "Spaghetti alla Carbonara",
    "description": "STEP 1\r\nPut a large saucepan of water on to boil.\r\n\r\nSTEP 2\r\nFinely chop the 100g pancetta, having f...",
    "imageUrl": "https://www.themealdb.com/images/media/meals/llcbn01574260722.jpg",
    "instructions": [
      "STEP 1",
      "Put a large saucepan of water on to boil.",
      "STEP 2",
      "Finely chop the 100g pancetta, having first removed any rind. Finely grate 50g pecorino cheese and 50g parmesan and mix them together.",
      "STEP 3",
      "Beat the 3 large eggs in a medium bowl and season with a little freshly grated black pepper. Set everything aside.",
      "STEP 4",
      "Add 1 tsp salt to the boiling water, add 350g spaghetti and when the water comes back to the boil, cook at a constant simmer, covered, for 10 minutes or until al dente (just cooked).",
      "STEP 5",
      "Squash 2 peeled plump garlic cloves with the blade of a knife, just to bruise it.",
      "STEP 6",
      "While the spaghetti is cooking, fry the pancetta with the garlic. Drop 50g unsalted butter into a large frying pan or wok and, as soon as the butter has melted, tip in the pancetta and garlic.",
      "STEP 7",
      "Leave to cook on a medium heat for about 5 minutes, stirring often, until the pancetta is golden and crisp. The garlic has now imparted its flavour, so take it out with a slotted spoon and discard.",
      "STEP 8",
      "Keep the heat under the pancetta on low. When the pasta is ready, lift it from the water with a pasta fork or tongs and put it in the frying pan with the pancetta. Don’t worry if a little water drops in the pan as well (you want this to happen) and don’t throw the pasta water away yet.",
      "STEP 9",
      "Mix most of the cheese in with the eggs, keeping a small handful back for sprinkling over later.",
      "STEP 10",
      "Take the pan of spaghetti and pancetta off the heat. Now quickly pour in the eggs and cheese. Using the tongs or a long fork, lift up the spaghetti so it mixes easily with the egg mixture, which thickens but doesn’t scramble, and everything is coated.",
      "STEP 11",
      "Add extra pasta cooking water to keep it saucy (several tablespoons should do it). You don’t want it wet, just moist. Season with a little salt, if needed.",
      "STEP 12",
      "Use a long-pronged fork to twist the pasta on to the serving plate or bowl. Serve immediately with a little sprinkling of the remaining cheese and a grating of black pepper. If the dish does get a little dry before serving, splash in some more hot pasta water and the glossy sauciness will be revived."
    ],
    "ingredients": [
      {
        "name": "Spaghetti",
        "quantity": "320g"
      },
      {
        "name": "Egg Yolks",
        "quantity": "6"
      },
      {
        "name": "Salt",
        "quantity": "As required"
      },
      {
        "name": "Bacon",
        "quantity": "150g"
      },
      {
        "name": "Pecorino",
        "quantity": "50g"
      },
      {
        "name": "Black Pepper",
        "quantity": "As required"
      }
    ],
    "cuisineType": "italian",
    "mealType": "pasta",
    "difficultyLevel": "medium",
    "prepTime": 30,
    "cookTime": 45,
    "servings": 4,
    "tags": [
      "pasta",
      "bbq",
      "breakfast"
    ]
  },
  {
    "name": "Arroz al horno (baked rice)",
    "description": "step 1\r\nHeat oven to 200C/180C/gas 6. Heat half the oil in a deep frying or sauté pan (or shallow ca...",
    "imageUrl": "https://www.themealdb.com/images/media/meals/qt4i0n1763256454.jpg",
    "instructions": [
      "step 1",
      "Heat oven to 200C/180C/gas 6. Heat half the oil in a deep frying or sauté pan (or shallow casserole dish) measuring around 30cm in diameter. Over a high heat, colour the pork belly slices on each side in several batches, then transfer to a bowl. Add the remaining oil to the pan and lower the heat to medium, then add the black pudding and bacon and fry all over for several mins. Remove with a slotted spoon. Fry the onion and peppers for around 10 mins until soft and pale gold, then add the tomato and cook until soft. Add the garlic, smoked paprika and chilli flakes and cook for another 2 mins, then put the pork, black pudding and bacon back in the pan. Add the beans, stock and whichever herb you're using, and bring everything to the boil.",
      "step 2",
      "Sprinkle the rice around the pork belly, pushing it underneath the stock. Let the stock come to the boil again, season well, then transfer to the oven (leave it uncovered). Cook for 20 mins without stirring, then check to see how the rice is doing. The rice should be tender and the stock absorbed. If it’s not ready, put back in the oven for another 5 mins, then check again. Taste for seasoning.",
      "step 3",
      "Squeeze lemon juice over the top and drizzle over some extra virgin olive oil just before serving, if you like."
    ],
    "ingredients": [
      {
        "name": "Extra Virgin Olive Oil",
        "quantity": "2 tbsp"
      },
      {
        "name": "Pork belly slices",
        "quantity": "800g"
      },
      {
        "name": "Black Pudding",
        "quantity": "150g"
      },
      {
        "name": "Bacon lardon",
        "quantity": "100g"
      },
      {
        "name": "Onion",
        "quantity": "1 chopped"
      },
      {
        "name": "Red Pepper",
        "quantity": "2"
      },
      {
        "name": "Plum Tomatoes",
        "quantity": "1 chopped"
      },
      {
        "name": "Garlic Clove",
        "quantity": "8"
      },
      {
        "name": "Paprika",
        "quantity": "4 teaspoons"
      },
      {
        "name": "Chilli Flakes",
        "quantity": "1/2 teaspoon"
      },
      {
        "name": "Dried white beans",
        "quantity": "200g"
      },
      {
        "name": "Chicken Stock",
        "quantity": "1 1/2 L"
      },
      {
        "name": "Thyme",
        "quantity": "6 parts"
      },
      {
        "name": "Paella Rice",
        "quantity": "375g"
      },
      {
        "name": "Lemon Juice",
        "quantity": "1"
      }
    ],
    "cuisineType": "spanish",
    "mealType": "pork",
    "difficultyLevel": "medium",
    "prepTime": 30,
    "cookTime": 45,
    "servings": 4,
    "tags": []
  },
  {
    "name": "Thai Green Curry",
    "description": "Put the potatoes in a pan of boiling water and cook for 5 minutes. Throw in the beans and cook for a...",
    "imageUrl": "https://www.themealdb.com/images/media/meals/sstssx1487349585.jpg",
    "instructions": [
      "Put the potatoes in a pan of boiling water and cook for 5 minutes. Throw in the beans and cook for a further 3 minutes, by which time both should be just tender but not too soft. Drain and put to one side.",
      "In a wok or large frying pan, heat the oil until very hot, then drop in the garlic and cook until golden, this should take only a few seconds. Don’t let it go very dark or it will spoil the taste. Spoon in the curry paste and stir it around for a few seconds to begin to cook the spices and release all the flavours. Next, pour in the coconut milk and let it come to a bubble.",
      "Stir in the fish sauce and sugar, then the pieces of chicken. Turn the heat down to a simmer and cook, covered, for about 8 minutes until the chicken is cooked.",
      "Tip in the potatoes and beans and let them warm through in the hot coconut milk, then add a lovely citrussy flavour by stirring in the shredded lime leaves (or lime zest). The basil leaves go in next, but only leave them briefly on the heat or they will quickly lose their brightness. Scatter with the lime garnish and serve immediately with boiled rice."
    ],
    "ingredients": [
      {
        "name": "Potatoes",
        "quantity": "225g new"
      },
      {
        "name": "green beans",
        "quantity": "100g"
      },
      {
        "name": "sunflower oil",
        "quantity": "1 tbsp"
      },
      {
        "name": "garlic",
        "quantity": "1 clove"
      },
      {
        "name": "Thai green curry paste",
        "quantity": "4 tsp"
      },
      {
        "name": "coconut milk",
        "quantity": "400ml"
      },
      {
        "name": "Thai fish sauce",
        "quantity": "2 tsp"
      },
      {
        "name": "Sugar",
        "quantity": "1 tsp"
      },
      {
        "name": "Chicken",
        "quantity": "450g boneless"
      },
      {
        "name": "lime",
        "quantity": "2 fresh kaffir leaves"
      },
      {
        "name": "basil",
        "quantity": "handfull"
      },
      {
        "name": "Rice",
        "quantity": "Boiled"
      }
    ],
    "cuisineType": "thai",
    "mealType": "chicken",
    "difficultyLevel": "medium",
    "prepTime": 30,
    "cookTime": 45,
    "servings": 4,
    "tags": [
      "curry",
      "mild"
    ]
  },
  {
    "name": "Red Peas Soup",
    "description": "Wash and rinse the dried kidney beans.. then cover with water in a deep bowl. Remember as they soak ...",
    "imageUrl": "https://www.themealdb.com/images/media/meals/sqpqtp1515365614.jpg",
    "instructions": [
      "Wash and rinse the dried kidney beans.. then cover with water in a deep bowl. Remember as they soak they will expand to at least triple the size they were originally so add a lot of water to the bowl. Soak them overnight or for at least 2 hrs to make the cooking step go quicker. I tossed out the water they were soaked in after it did the job.",
      "Have your butcher cut the salted pigtail into 2 inch pieces as it will be very difficult to cut with an ordinary kitchen knife. Wash, then place a deep pot with water and bring to a boil. Cook for 20 minutes, then drain + rinse and repeat (boil again in water). The goal is to make the pieces of pig tails tender and to remove most of the salt it was cured in.",
      "Time to start the soup. Place everything in the pot (except the flour and potato), then cover with water and place on a high flame to bring to a boil. As it comes to a boil, skim off any scum/froth at the top and discard. Reduce the heat to a gentle boil and allow it to cook for 1 hr and 15 mins.. basically until the beans are tender and start falling apart.",
      "It’s now time to add the potato (and Yams etc if you’re adding it) as well as the coconut milk and continue cooking for 15 minutes.",
      "Now is a good time to start making the basic dough for the spinner dumplings. Mix the flour and water (add a pinch of salt if you want) until you have a soft/smooth dough. allow it to rest for 5 minutes, then pinch of a tablespoon at a time and roll between your hands to form a cigarette shape.",
      "Add them to the pot, stir well and continue cooking for another 15 minutes on a rolling boil.",
      "You’ll notice that I didn’t add any salt to the pot as the remaining salt from the salted pigtails will be enough to properly season this dish. However you can taste and adjust accordingly. Lets recap the timing part of things so you’re not confused. Cook the base of the soup for 1 hr and 15 minute or until tender, then add the potatoes and cook for 15 minutes, then add the dumplings and cook for a further 15 minutes. Keep in mind that this soup will thicken quite a bit as it cools.",
      "While this is not a traditional recipe to any one specific island, versions of this soup (sometimes called stewed peas) can be found throughout the Caribbean, Latin America and Africa. A hearty bowl of this soup will surely give you the sleepies (some may call it ethnic fatigue). You can certainly freeze the leftovers and heat it up another day."
    ],
    "ingredients": [
      {
        "name": "Kidney Beans",
        "quantity": "2 cups"
      },
      {
        "name": "Carrots",
        "quantity": "1 large"
      },
      {
        "name": "Spring Onions",
        "quantity": "2 chopped"
      },
      {
        "name": "Thyme",
        "quantity": "4 sprigs"
      },
      {
        "name": "Onion",
        "quantity": "1 Diced"
      },
      {
        "name": "Black Pepper",
        "quantity": "1/2 tsp"
      },
      {
        "name": "Red Pepper",
        "quantity": "2 chopped"
      },
      {
        "name": "Garlic Clove",
        "quantity": "4 Mashed"
      },
      {
        "name": "Allspice",
        "quantity": "1 tbs"
      },
      {
        "name": "Beef",
        "quantity": "2 Lbs"
      },
      {
        "name": "Water",
        "quantity": "2L"
      },
      {
        "name": "Potatoes",
        "quantity": "4"
      },
      {
        "name": "Plain Flour",
        "quantity": "1 cup"
      },
      {
        "name": "Water",
        "quantity": "1/4 cup"
      },
      {
        "name": "Coconut Milk",
        "quantity": "1 cup"
      }
    ],
    "cuisineType": "jamaican",
    "mealType": "beef",
    "difficultyLevel": "medium",
    "prepTime": 30,
    "cookTime": 45,
    "servings": 4,
    "tags": [
      "soup",
      "sidedish"
    ]
  },
  {
    "name": "Asado",
    "description": "Prepare the Fire: Start a wood fire in your grill and let it burn down to coals.\r\nSeason the Meat: G...",
    "imageUrl": "https://www.themealdb.com/images/media/meals/kgfh3q1763075438.jpg",
    "instructions": [
      "Prepare the Fire: Start a wood fire in your grill and let it burn down to coals.",
      "Season the Meat: Generously salt the beef cuts.",
      "Grill the Meat: Place the beef on the grill, starting with the thickest cuts farthest from the coals. Add chorizo and morcilla after the beef has been cooking for a while.",
      "Cook to Perfection: Cook the meat, turning occasionally, until it reaches your desired doneness. Typically, ribs may take up to 2 hours; thinner cuts will cook faster.",
      "Rest and Serve: Let the meat rest for about 10 minutes before slicing. Serve with chimichurri sauce and grilled vegetables.",
      "Pro Tips:",
      "Use a mix of wood and charcoal for a consistent heat source. Wood adds flavor, while charcoal maintains temperature.",
      "Season the meat just before grilling to ensure it retains its moisture and flavor.",
      "Serving Suggestions:",
      "Serve with a side of chimichurri sauce, a fresh tomato salad, and crusty bread. Pair with a robust Malbec wine to complement the rich flavors of the meat."
    ],
    "ingredients": [
      {
        "name": "Mixed Beef Cuts",
        "quantity": "2kg"
      },
      {
        "name": "Chorizo",
        "quantity": "4"
      },
      {
        "name": "Morcilla",
        "quantity": "2"
      },
      {
        "name": "Salt",
        "quantity": "To taste"
      }
    ],
    "cuisineType": "argentinian",
    "mealType": "beef",
    "difficultyLevel": "medium",
    "prepTime": 30,
    "cookTime": 45,
    "servings": 4,
    "tags": []
  },
  {
    "name": "Warm roast asparagus salad",
    "description": "step 1\r\nPreheat the oven to 200C/Gas 6/fan 180C. Snap off the woody ends of the asparagus and discar...",
    "imageUrl": "https://www.themealdb.com/images/media/meals/ktsws11761998344.jpg",
    "instructions": [
      "step 1",
      "Preheat the oven to 200C/Gas 6/fan 180C. Snap off the woody ends of the asparagus and discard. Arrange the asparagus in a single layer in a baking tray with sides. Cut the tomatoes in half widthways, nestle them in with the asparagus, season with sea salt and pepper and drizzle with olive oil. Roll each bacon rasher into a tight roll (if large, first cut in half crosswise), and arrange in the tray. Drizzle the bacon rolls with the honey and bake for 20 minutes until the tomatoes are soft and the bacon is crisp.",
      "step 2",
      "In the meantime, boil the potatoes until tender. Whisk the vinegar, olive oil, mustard, some sea salt and pepper in a large bowl until blended. Toss the rocket or spinach leaves in half of the dressing, and arrange on a large serving platter.",
      "step 3",
      "Drain the potatoes and cut in half. Gently toss them in the rest of the dressing, and arrange on the platter with the asparagus. Tuck in the tomatoes and bacon."
    ],
    "ingredients": [
      {
        "name": "Asparagus",
        "quantity": "500g"
      },
      {
        "name": "Red Wine Vinegar",
        "quantity": "2 tbsp"
      },
      {
        "name": "Tomato",
        "quantity": "4"
      },
      {
        "name": "Extra Virgin Olive Oil",
        "quantity": "1 tbsp"
      },
      {
        "name": "Streaky Bacon",
        "quantity": "12"
      },
      {
        "name": "Clear Honey",
        "quantity": "1 teaspoon"
      },
      {
        "name": "Jersey Royal Potatoes",
        "quantity": "16"
      },
      {
        "name": "Extra Virgin Olive Oil",
        "quantity": "2 tblsp"
      },
      {
        "name": "Dijon Mustard",
        "quantity": "1 teaspoon"
      },
      {
        "name": "Rocket",
        "quantity": "100g"
      }
    ],
    "cuisineType": "australian",
    "mealType": "pork",
    "difficultyLevel": "medium",
    "prepTime": 30,
    "cookTime": 45,
    "servings": 4,
    "tags": []
  },
  {
    "name": "Chickpea, chorizo & spinach stew",
    "description": "step 1\r\nHeat the oil in a large pan, then gently fry the onion for 3-4 mins until it begins to softe...",
    "imageUrl": "https://www.themealdb.com/images/media/meals/xvnx8j1763287209.jpg",
    "instructions": [
      "step 1",
      "Heat the oil in a large pan, then gently fry the onion for 3-4 mins until it begins to soften. Stir in the carrot, celery, thyme and bay leaves. Season, then cook for 2-3 mins, stirring occasionally. Add the garlic, chorizo, cinnamon and smoked paprika. Gently fry until the vegetables soften and the chorizo starts to release its oils and crisp up.",
      "step 2",
      "Stir in the chickpeas, vinegar and 150ml water, then bring to a simmer for 1-2 mins until the chickpeas have heated up. Add the spinach, then stir through the chickpeas until it wilts a little. Remove from the heat, season to taste, then serve warm with crusty bread."
    ],
    "ingredients": [
      {
        "name": "Extra Virgin Olive Oil",
        "quantity": "4 tablespoons"
      },
      {
        "name": "Onion",
        "quantity": "1 chopped"
      },
      {
        "name": "Carrots",
        "quantity": "1 Diced"
      },
      {
        "name": "Celery",
        "quantity": "1 Diced"
      },
      {
        "name": "Thyme",
        "quantity": "3"
      },
      {
        "name": "Bay Leaves",
        "quantity": "2"
      },
      {
        "name": "Garlic",
        "quantity": "2 cloves chopped"
      },
      {
        "name": "Chorizo",
        "quantity": "200g"
      },
      {
        "name": "Cinnamon",
        "quantity": "1/4 tsp"
      },
      {
        "name": "Paprika",
        "quantity": "1 teaspoon"
      },
      {
        "name": "Chickpeas",
        "quantity": "800g"
      },
      {
        "name": "Sherry vinegar",
        "quantity": "2 tblsp"
      },
      {
        "name": "Spinach",
        "quantity": "400g"
      }
    ],
    "cuisineType": "spanish",
    "mealType": "pork",
    "difficultyLevel": "medium",
    "prepTime": 30,
    "cookTime": 45,
    "servings": 4,
    "tags": []
  }
]